[
  {
    "content": "We will definitely be back.",
    "id": "3434a02b-9ef0-4a39-aba4-c5286c15fc2e"
  },
  {
    "content": "In this case, he tried to meld a very artsy style film with an anti-establishment hippie film and only succeeded in producing a bomb of gargantuan proportions.<br /><br />The film begins with a rap session where a lot of \"with it\" students sit around saying such platitudes as \"power to the people\" and complaining about \"the man\".",
    "id": "626cd8c3-fd37-4344-85d8-2c2c986dacc4"
  },
  {
    "content": "You know, This movie could have been shot in a back alley in New York.",
    "id": "32635cc7-2951-4093-9ec7-f461d69b0a97"
  },
  {
    "content": "He had learned so much and had a really incredible time.",
    "id": "bfff1faa-d8aa-4338-a55c-4b8f4505027b"
  },
  {
    "content": "Most importantly, the order was not messed up too much.",
    "id": "1cc51b94-e6d7-4b42-b041-d5ebf62a57f3"
  },
  {
    "content": "A total waste of even digital \"film\".",
    "id": "a45144dc-56a0-4707-8ff3-214be5e0bf72"
  },
  {
    "content": "Is now a good time to invest in these real estate stocks?",
    "id": "ac4ad6a6-5d34-420a-a1de-2f5b096b5766"
  },
  {
    "content": "**Develop Loyalty Programs:**\n   - Create reward systems that encourage repeat purchases (e.g., points per purchase that can be redeemed for discounts).",
    "id": "d92f32aa-3c6c-402f-ac0a-165dc36c9516"
  },
  {
    "content": "I'm not sure why I watched the whole thing; perhaps it was a morbid fascination, like watching an impending train crash: it's horrible, but you can't manage to force yourself to look away.",
    "id": "3ae2f219-f705-46ed-bd94-f208b6a8428f"
  },
  {
    "content": "GRAND CAYMAN, Cayman Islands, Sept. 02, 2021 (GLOBE NEWSWIRE) -- Navios Maritime Holdings Inc. (“Navios Holdings” or the “Company”) (NYSE: NM), a global seaborne shipping and logistics company, today reported financial results for the second quarter and six months ended June 30, 2021.",
    "id": "25250831-413b-401c-b025-40fcd99b0772"
  },
  {
    "content": "Her mom smiled and praised her for being such a brave girl.",
    "id": "e00a62e1-d4bd-450a-91d4-a49ba6a71fdd"
  },
  {
    "content": "Not once have they gotten any order right.",
    "id": "f8e3b455-52fc-479f-88c7-a114e68b6dd9"
  },
  {
    "content": "The location is close to the mall but away from the mayhem of trying to find parking close by.",
    "id": "9ecea7a7-9052-4174-b89b-fb48035b38ae"
  },
  {
    "content": "- **Workshops**: Conduct workshops that utilize scenario-based learning to demonstrate how decision biases can skew perceptions and outcomes.",
    "id": "3c1e8831-305e-4a8d-8d76-df8f10f9822c"
  },
  {
    "content": "Such works post us warnings about undesirable trends in our society to watch out for; but to be effective they must also be entertaining.",
    "id": "a07bf61a-24c6-4d85-ba3e-3c3c8210efe2"
  },
  {
    "content": "Revenue $91.1 million for Q1 2020 Cash used in operating activities $1.5 million for Q1 2020 Adjusted EBITDA (a non-GAAP measure) $28.7 million for Q1 2020 Liquidation of.",
    "id": "c03f2898-33b8-4cb6-ac59-61f4631a0eb1"
  },
  {
    "content": "One day, a kid went to the beach.",
    "id": "7164b4dc-49ac-4e9f-b15f-c77e6ceee444"
  },
  {
    "content": "In addition, Navios Partners has some exposure to the container charter market through its 33.5% equity interest in Navios Maritime Containers L.P. (NMCI), as well as a number of owned container vessels some of which are trading in the spot market.",
    "id": "e68d73ea-a62a-4283-a546-53b71262cf18"
  },
  {
    "content": "### The Role of Perceptions of Fairness and Justice\n\nPerception is subjective; hence two individuals may assess the same social exchange differently.",
    "id": "7ef6ba95-865e-408d-aeb3-13199484478c"
  },
  {
    "content": "GRAND CAYMAN, Cayman Islands, Sept. 03, 2021 (GLOBE NEWSWIRE) -- Navios Maritime Holdings Inc. (“Navios Holdings” or the “Company”) (NYSE: NM), a global seaborne shipping and logistics company, announced that on September 3, 2021, the Company issued a notice of redemption with respect to an aggregate principal amount of $20,000,000 of its 11.25% Senior Secured Notes due 2022 (the “Notes”) at a redemption price equal to 100.00% of the aggregate principal amount thereof, plus accrued and unpaid interest to, but excluding, the redemption date of September 13, 2021.",
    "id": "51a52d08-ec65-4435-900f-d686821c82bc"
  },
  {
    "content": "I've been buying tires at Discount Tire for over 10 years now and it's honestly the only place I will consider going for tires.",
    "id": "04d96e4b-fb79-40ec-839d-66e894a07c92"
  },
  {
    "content": "The best thing about the movie was the house which serves as the setting.",
    "id": "e70ae606-5cff-4d7f-9ebc-4fdb3d053299"
  },
  {
    "content": "To enjoy William Shatner's scintillating banter.<br /><br />My choice is \"B,\" but the women aren't on camera long enough to justify suffering through an hour of this show.",
    "id": "bf9251b6-09f1-4ec0-88cc-50182668ecfd"
  },
  {
    "content": "Navios Maritime Partners L.P. (NYSE: NMM) and Navios Maritime Acquisition Corp (NYSE: NNA) have agreed to merge; under the agreement, shareholders of Navios Acquisition will receive 0.1275 of a common unit of Navios Partners for each share.",
    "id": "1f1dbc9a-9b27-4008-8dcd-6d8100eab6d1"
  },
  {
    "content": "- Implement counter-cyclical policies to ensure government spending boosts during downturns and stabilizes during thriving periods.",
    "id": "188ba9a9-c8d2-4f9e-b3d9-d2f4b3b8afca"
  },
  {
    "content": "All I have to say is nicest barista EVER at the drive-thru window!",
    "id": "216e462d-5767-46b7-81ed-80cd6d0eb8bc"
  },
  {
    "content": "When she opened the door, Ruby saw that the cabinet was filled with things that were rotten.",
    "id": "89080e28-a0a7-453a-94dc-b13c1824cc55"
  },
  {
    "content": "Mark hugged his cousin tightly and said, \"I'm so glad I was able to help!\"",
    "id": "55811df7-9f2e-4113-8c7d-9a707ecb8d88"
  },
  {
    "content": "Apparently, because of the way the promotional process and the film festival circuit work.<br /><br />First of all, it won first prize at the Rio Film Festival where it was called the best Brazilian movie of the year.",
    "id": "e0417df9-da80-4dec-af60-38e831d6a811"
  },
  {
    "content": "So Amy walked into the room and the first thing she saw was a toy gun.",
    "id": "5509a00c-23f6-4370-b789-6218c53bbbe6"
  },
  {
    "content": "Maybe there wouldn't have been a movie then but there really wasn't one anyway so what's the difference.",
    "id": "8630f049-b836-4f01-ba94-7c6f0eac6052"
  },
  {
    "content": "#### 6.",
    "id": "05bc87e2-b8d7-4b48-822f-3d8feeaa0750"
  },
  {
    "content": "Navios Maritime Acquisition: Dividends Gone As Expected And Bankruptcy Risk Looms",
    "id": "96bc26ee-f1b8-4d53-a59b-47d92668c05f"
  },
  {
    "content": "The first 30 minutes of SMTM that I watched got through only six questions (many of which pertained to other TV shows).",
    "id": "0c36c102-6a02-4de2-9afe-38fe1774f2b7"
  },
  {
    "content": "The noodles and rice weren't the best, of course, but I did enjoy both chicken dishes, especially amped up with chili sauce.",
    "id": "9e8a259c-aa43-4dd8-956c-79cee5fe86ca"
  },
  {
    "content": "Very snobby and slow.",
    "id": "01e84f80-a716-4b52-bb7e-9daa8c980200"
  },
  {
    "content": "That shouldn't be a surprise since my last name is Thomas, right?",
    "id": "07645c9b-28eb-41b7-8ec4-56225a2d4be7"
  },
  {
    "content": "Is this mall REIT a solid long-term investment?",
    "id": "5b25b3a2-496d-4b64-b030-03cb23e5357c"
  },
  {
    "content": "My husband had a spicy chicken sandwich of some sort.",
    "id": "e7c8237c-6699-41da-996f-95ca387dac21"
  },
  {
    "content": "Tailoring communications and offers based on these stages can enhance customer experience and increase conversion rates.",
    "id": "0ae3d57e-e881-421f-8859-bf3e1a12f9f3"
  },
  {
    "content": "Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks.",
    "id": "234fedf6-8494-4fae-b03e-ed8417bf174b"
  },
  {
    "content": "they are pure evil to.",
    "id": "26d6be1c-55b4-4669-a491-7419b8ce4c09"
  },
  {
    "content": "The latest trend in earnings estimate revisions could translate into further price increase in the near term.",
    "id": "f0d4f6fc-2968-43e4-8527-64b66a1744b6"
  },
  {
    "content": "Navios Maritime Partners: Too Cheap To Ignore",
    "id": "1f3a2c90-ff55-42d9-be03-e3323af15ffa"
  },
  {
    "content": "Navios Holdings Buyout Could Unlock Massive Value",
    "id": "8418f42a-69be-44fd-af37-23bcc9069c00"
  },
  {
    "content": "John felt much better and he happily said \"Yes!\"",
    "id": "cc09c34a-a376-488f-98a6-3862e0b4c285"
  },
  {
    "content": "I find the manager and explain I have called the store number times without anyone picking up and the situation with chuck.",
    "id": "7b0ed163-2bef-4158-827e-0afddc512879"
  },
  {
    "content": "MONTEVIDEO, Uruguay, Jan. 20, 2021 (GLOBE NEWSWIRE) -- Navios South American Logistics Inc. (“Navios Logistics” or the “Company”) announces it has confidentially submitted a draft Registration Statement on Form F-1 to the United States Securities and Exchange Commission  (the \"SEC\") relating to the proposed initial public offering of its common stock.",
    "id": "01ccfb48-b499-4054-bb27-c4bd56ebd4aa"
  },
  {
    "content": "Joe hid in the tallest tree he could find.",
    "id": "5f274da7-f006-4565-bd94-0b2f484a91b0"
  },
  {
    "content": "As a matter of fact, I nearly cried when I found out Nashville was getting one.",
    "id": "a66ddaf0-44ae-48e2-86b1-1a9a03214e53"
  },
  {
    "content": "- **Motivators**: Factors that drive satisfaction and motivation (e.g., brand innovation, customer experience).",
    "id": "9e261b69-cae9-41b8-bf9a-41c1c727a1f0"
  },
  {
    "content": "Just one more thing though, where was Ice T?",
    "id": "3125a5d1-c5cc-4253-a65f-f9abe1313ffd"
  },
  {
    "content": "His mom made him separate from the music.",
    "id": "64297f50-2512-4192-b625-81b9e8aac397"
  },
  {
    "content": "Analyze customer behavior data, identifying how long active customers continue engaging with the brand.",
    "id": "947e446b-e249-4b2b-a4d4-804accf7ffe7"
  },
  {
    "content": "I, of course, had to end my meal with a shake & that was obviously the best decision.",
    "id": "3ecd0e96-411f-4e23-8c53-d5463b9f9c23"
  },
  {
    "content": "Take away the fact that the movie has no historical truth it, and it is still the worse movie ever found in a video store.",
    "id": "a8e1c30a-69b6-4d91-b69a-37dc67e453cf"
  },
  {
    "content": "great idea!",
    "id": "312acc5e-f367-4430-a9c7-ca9589ce74ae"
  },
  {
    "content": "Remember, for instance, the conversations between Mastroianni and the \"wicked capitalistic\" that wants sing up him in \"La notte\", or Monica Vitti laughing at the peasants flirting in the train in \"La aventura\", or Ferzetti dropping the glass of ink at the end of the same film.",
    "id": "d737e55b-11e1-4dc2-9a77-258ebcc8710d"
  },
  {
    "content": "This fast food burger joint has the Same burger king fare as the others.",
    "id": "d17ef40d-3fae-4d29-a615-00a3116ff18f"
  },
  {
    "content": "Navios Maritime Partners LP (NMM) made it through our \"Recent Price Strength\" screen and could be a great choice for investors looking to make a profit from stocks that are currently on the move.",
    "id": "3d1a1f9d-fd22-436a-8915-960a79cd511b"
  },
  {
    "content": "Not only was the food sub-par for a Panda Express, which I recognize as not authentic already as it is, but it came in very disappointing proportions, they were cooking a fresh pot of chow-mein as I ordered and instead of waiting 30 seconds, or even dishing my meat up first, the server took a spoon out from under the counter to scrape the scraps out of the bowl, into my tray.",
    "id": "c91cbfaf-4400-4e91-a7ec-5e47bea6dc76"
  },
  {
    "content": "He put on his backpack and skipped all the way to the classroom.",
    "id": "ec834096-5bdd-4e46-9bf1-6c6931840872"
  },
  {
    "content": "It's shot -- in execrably ugly digital video with no talent behind the camera-work -- mostly in a barren-looking poor suburb rather than in one of the teeming \"favelas\" or village-like Brazilian city slums where such wonderful films as \"Black Orpheus\", \"Pixote,\" and \"City of God\" were made, and not in Rio this time, but São Paulo.<br /><br />The hit man with family problems is Teodoro ( Giulio Lopez) and his partner with a drug problem is Waldomiro (Ailtan Graça).",
    "id": "09d7d08f-f5ff-4c58-b6bb-66d663790d5f"
  },
  {
    "content": "The service is always efficient and quick, and friendly.",
    "id": "d87ffe13-b4db-4965-9a53-b1d4e91d61d9"
  },
  {
    "content": "We believe hedge fund sentiment should serve as a crucial tool of an individual investor's stock selection process, as it may offer great insights of how the brightest minds of the finance industry feel about specific stocks.",
    "id": "21c5b75c-c4a5-4b96-a027-c4bae0aa3a29"
  },
  {
    "content": "**Enhancing Public Goods**\n   - **Definition**: Public goods are services provided without profit to all members of society.",
    "id": "5fa7ff8c-e454-4d3d-a1e0-797dac07b736"
  },
  {
    "content": "GRAND CAYMAN, Cayman Islands, Sept. 14, 2021 (GLOBE NEWSWIRE) -- Navios Maritime Holdings Inc. (“Navios Holdings” or the “Company”) (NYSE: NM), a global seaborne shipping and logistics company, announced that on September 14, 2021, the Company issued a notice of redemption with respect to an aggregate principal amount of $20,000,000 of its 11.25% Senior Secured Notes due 2022 (the “Notes”) at a redemption price equal to 100.00% of the aggregate principal amount thereof, plus accrued and unpaid interest to, but excluding, the redemption date of September 24, 2021.",
    "id": "d0ad9d7d-d1ed-4483-ac70-aaf6af0d7846"
  },
  {
    "content": "Once upon a time there was an ancient spot in the forest.",
    "id": "6757b0b4-0b39-41d2-87cb-3667ef057530"
  },
  {
    "content": "She stepped up on the scale and it moved all the way up.",
    "id": "965ae4e1-7bac-4876-bac0-d93b95502349"
  },
  {
    "content": "**4.",
    "id": "5c78aebb-80ff-4c17-8c50-b97a7256f092"
  },
  {
    "content": "I don't like it when these places are filthy",
    "id": "a7ee3bbe-4b35-49a7-8e8a-d6bc00b2c31f"
  },
  {
    "content": "Conference Call & Webcast: Monday, November 23, 2020 at 8:30 am ET Conference Call & Webcast: Monday, November 23, 2020 at 8:30 am ET",
    "id": "bc70332a-774e-42f3-80e9-a4237bf185ff"
  },
  {
    "content": "You need to put on your dress now!\"",
    "id": "49984f7b-17e6-41d0-8f29-600dc395c14b"
  },
  {
    "content": "That is quite a feat, however negative.<br /><br />Trick or Treat = so bad you will be angry at yourself for having watched it.",
    "id": "91bce652-619d-49c9-8e79-2edafc4961bb"
  },
  {
    "content": "**Monitoring and Evaluation**\n\n**A.",
    "id": "20c93fd2-b6c4-4bc0-b1e9-8e85d62d96cc"
  },
  {
    "content": "It didn't even have the \"grill\" marks that they boast in the commercial - just looked like sad little whitish-grey plops of crap.",
    "id": "70624e49-0cd7-479e-8b69-f0c8a89d79b7"
  },
  {
    "content": "Q1 2020 Navios Maritime Holdings Inc Earnings Call",
    "id": "7ba8c265-d1b9-4f4e-8195-bd675323258e"
  },
  {
    "content": "We had to actually point at the pictures in the menu to get him to understand what we wanted.",
    "id": "a18283fe-65b1-4d87-ac46-3989f2d9c0a7"
  },
  {
    "content": "Extremely friendly and helpful staff.",
    "id": "67128577-e908-4638-aa8a-c26913a67ef4"
  },
  {
    "content": "#### 2.2.",
    "id": "4ab8a981-d510-4b8c-a027-4ae428d457c0"
  },
  {
    "content": "The latest trend in earnings estimate revisions might not help the stock continue moving higher in the near term.",
    "id": "334e43ff-5cf8-4a3e-b9d7-ffc8b586e389"
  },
  {
    "content": "John pointed to the corner of his room and said, \"It's hidden there, under the blanket.",
    "id": "dead5654-51fc-42d8-93be-eedeaa3eac6e"
  },
  {
    "content": "The teacher replied, \"If you don't get this pose right, then you can't do yoga anymore.\"",
    "id": "fe04ce40-79e8-4a3e-8a7d-20ae8036824a"
  },
  {
    "content": "That opens up the Fed to an estimated $1.7 trillion worth of eligible corporate debt, versus a $256 billion universe of exchange-traded funds that the central bank has only dabbled in so far, according to Bank of America Corp. strategists led by Hans Mikkelsen.“When you have someone who goes in in size and across the board, it’s very, very powerful,” Mikkelsen said.While the Fed won’t be able to buy today’s offerings mentioned above, as well as other debt that’s rated too low or otherwise doesn’t meet its criteria, high-yield managers nonetheless are upping their bets.",
    "id": "d9e11a8e-7f3f-425a-a92a-978e1d6499ef"
  },
  {
    "content": "While exploring the property Pamela meets another young girl named Emma (Jianna Ballard) who warns her that evil lurks within her new home, she tells a tale of an evil old witch known as the Tooth Fairy who takes baby teeth from children & then kills them.",
    "id": "b4b72ffd-9e72-43d5-b05c-a1fb825e96e2"
  },
  {
    "content": "- **Examples**: Executives making decisions behind closed doors with no documentation or rationale available to employees.",
    "id": "7b5b1586-91f0-46cc-b895-0671c521dd6a"
  },
  {
    "content": "**Public Investment Strategy**:\n   - Create a robust investment strategy that includes funding for infrastructure, education, and technology, which can yield economic returns.",
    "id": "0fd4f587-de13-4a3a-b2df-f768ccbe5f93"
  },
  {
    "content": "The two people working there told me there was a colts \"daily double\" special going on, where you paid double the normal price and it went to the colts.",
    "id": "8a1326d6-d936-49e4-8efe-cecb0a5c8d6e"
  },
  {
    "content": "### Actionable Steps for Customer Development\n\n1.",
    "id": "e6fd2b33-b966-4890-baad-b7ef185bb0f8"
  },
  {
    "content": "There was a set of woods, suddenly its gone cause you can see right through, then next it is deep and animals are dying.",
    "id": "7b1ff865-71a2-4a47-9a63-6ade2efa10ec"
  },
  {
    "content": "**Feedback Mechanism**: Implement systems to gather feedback from channel partners and customers for continuous improvement.",
    "id": "0a110441-287b-493e-887b-5f78e6052ad3"
  },
  {
    "content": "The host - William Shatner, at his obnoxious smarmiest - asks the contestant if he wants to \"lock into the answer\" and when the contestant says yes, he picks a 'dancer', to whom he yells \"Show me the money!\"",
    "id": "e9e8dea6-8cdb-4c4f-8d96-cd077004c1e0"
  },
  {
    "content": "Eventually, the man left, but Kin was left so scared and upset.",
    "id": "dfbdbbdf-6b8a-4eab-a9ef-bf10b649fef1"
  },
  {
    "content": "Mission Alignment Assessment:**\n   - **Conduct a Mission Review:** Start by evaluating the alignment of potential revenue-generating activities with your organization's mission.",
    "id": "934086ea-d876-45c9-b5be-39fa41f84901"
  },
  {
    "content": "The mouse finally replied, \"I'm trying to escape the arrow!\"",
    "id": "aa1969e7-0777-4448-bb0d-4555dc88fae4"
  },
  {
    "content": "and, like many an action movie before this, she straps on her guns ONE LAST TIME and vows to avenge her sisters death.",
    "id": "ff75ca9f-87b0-45fa-b2d2-4a5c795226b2"
  },
  {
    "content": "Jimmy kept his head down and walked home.",
    "id": "17216b3c-fcfb-4878-9eba-c8469b737fde"
  },
  {
    "content": "I got passed the fact that Lil Kim was blasting some cannons and her arms or hands weren't moving, I got passed the weaves, I got passed the colored contacts.<br /><br />This is what killed it for me: In the scene where the four roses were sitting at the table arguing.",
    "id": "9496fe77-cdad-4e27-bc15-89abd850e41b"
  },
  {
    "content": "#### B.",
    "id": "a866d81d-a791-44ab-97e3-20d56a6e62b5"
  },
  {
    "content": "Everywhere that the hunter looked, he could not find any prey.",
    "id": "6de9f0c3-1ff2-4022-8e8b-16b4a3439112"
  }
]