[
  {
    "content": "Amerant Bancorp (AMTB) has seen solid earnings estimate revision activity over the past month, and belongs to a strong industry as well.",
    "id": "f49bf3d7-f19f-4f00-a4eb-eed7c447e954"
  },
  {
    "content": "There were big waves and lots of colourful fish swimming around.",
    "id": "a0213081-aff5-4dd3-97d1-8394836c8de6"
  },
  {
    "content": "The terms and conditions of any particular offering of securities under the shelf registration statement will be determined at the time of such offering and will be set forth in the applicable prospectus supplement.",
    "id": "ea907574-0808-4417-bab1-875aadf2fab4"
  },
  {
    "content": "Amerant Bancorp Inc. (AMTB) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report.",
    "id": "5085f0d6-24f2-4b28-a87c-d753b9bb7153"
  },
  {
    "content": "- **ROI Calculations:** Calculate expected returns on investment for each strategy over a defined timeline.",
    "id": "1384cebe-1fd3-417e-bfa2-af60361828ad"
  },
  {
    "content": "- **Competitive Environment**: \n  - Review competitor strategies to understand if they are also facing similar pressures and how they have responded.",
    "id": "55876946-f5c5-45e5-a184-24f080d9bef4"
  },
  {
    "content": "The combination of the two platforms makes opening new accounts and switching direct deposits and automatic payments a faster, safer and more efficient process.",
    "id": "98f234fc-0aea-4a65-90db-ed334dcdabba"
  },
  {
    "content": "3.",
    "id": "338322e7-282e-4a79-a78a-8a868a1f6ee9"
  },
  {
    "content": "But when they cut it open, they noticed that it was rotten inside.",
    "id": "e7b9a377-b0da-4695-bc9d-8982ed492359"
  },
  {
    "content": "Film is a powerful medium; it can be educational as well as entertaining, and perhaps in the future more filmmakers, like Ang Lee, will embrace and promote a sense of unity through the sensitive depiction of the events and attitudes that make us what we are.",
    "id": "2717d379-21e3-4460-8ee4-e8f01585a26a"
  },
  {
    "content": "The Company continues to closely monitor the performance of its loan portfolio estimated to be impacted by the decline in business activity associated with the COVID-19 pandemic, and continues refining its estimated probable loss assumptions.",
    "id": "cb6af736-8c5f-41d2-ba6b-a6a5bfa5d48b"
  },
  {
    "content": "I'm not a fan of the fact that you need a key to use the restroom, but I suppose they have their reasons.",
    "id": "cc76c400-c86a-478b-b9f7-aa9d5479cf6e"
  },
  {
    "content": "A very engaging, intelligent, and well-made film.",
    "id": "5c1ce99b-3b2b-4b01-9c44-c0d3ef13052d"
  },
  {
    "content": "Lily noticed a great big potato on the shelf, and she asked her mom to buy it.",
    "id": "a8a9cf1a-5de6-4c75-a646-2120d0542e4a"
  },
  {
    "content": "These people were raised on Shakespeare and the King James version of the Bible.",
    "id": "dfc1e545-668a-4446-a1dd-a84614bb6074"
  },
  {
    "content": "The second character to find herself pregnant is Mary, Rob's wife, after a rape by Roth's character (and at least one sex scene with her husband, Rob).",
    "id": "988db9b1-93e1-4f93-a3af-c69dc4167236"
  },
  {
    "content": "Another issue happened.",
    "id": "bb2961b6-dcc6-4c16-a25e-a93b4728cd2f"
  },
  {
    "content": "The wheels come off and the battery pops out.",
    "id": "a36c7720-b77a-45f0-b0ac-1755b5ca0bc4"
  },
  {
    "content": "2.",
    "id": "e4ccc9a7-ddd9-466b-8b99-afb5ef316b5f"
  },
  {
    "content": "He was very curious about what was inside, so he opened it up.",
    "id": "5b909825-a6eb-4db4-8d71-ffb1352971ad"
  },
  {
    "content": "She went to the forest to look for it.",
    "id": "5cea02ef-a76f-4122-84f7-55313fd3061b"
  },
  {
    "content": "For a film with such an anti-violent message Gojoe wastes way too much energy and screen time to depict the endless battle scenes.",
    "id": "4916215c-302f-414e-9a3e-3c2ccb150a6c"
  },
  {
    "content": "The results included:",
    "id": "9b989c5e-d5c8-49fa-ae41-c666e9a02e87"
  },
  {
    "content": "The passengers on the train were happy and thanked the engine for being so smart.",
    "id": "698e9a29-628d-4ef1-9219-dddd2b79a16b"
  },
  {
    "content": "Starting with a basket of freshly baked bread served with.",
    "id": "f4ba17b1-c4d8-4411-b236-3dd6d81a87f0"
  },
  {
    "content": "Literally too cold in this place too eat.",
    "id": "ea5ac188-e500-42fe-8875-9262584c9905"
  },
  {
    "content": "They continued to swim and play in the ocean together, enjoying the beautiful blue water and all the creatures that lived there.",
    "id": "030defb4-6e39-4298-9806-48873eb052ab"
  },
  {
    "content": "I will be back for more tasty goodness.",
    "id": "cf8dba45-7c22-4650-9c81-1cf08861c47c"
  },
  {
    "content": "Sound anything like Braveheart?",
    "id": "6e0913ed-884a-4616-9a56-f2337cd3bdeb"
  },
  {
    "content": "MIAMI, Oct. 18, 2021 /PRNewswire/ -- Amerant Bank, one of the largest community banks headquartered in Florida, announces that it has selected leading fintechs, Alloy and Q2 to further enhance its digital offerings.",
    "id": "169eca90-fc39-43cd-9bc9-5409f55c8474"
  },
  {
    "content": "To be fair, he's now in his fifties and one would expect some slowdown.",
    "id": "7866d678-6839-4ef6-b74f-37bc5ea8f7df"
  },
  {
    "content": "She loved to jog in the sunshine and enjoy the outdoors.",
    "id": "4a9e6727-2119-49dd-85a7-3bc137dd2f5f"
  },
  {
    "content": "They played together and had fun.",
    "id": "f4296498-1b99-488a-b31d-1829645fd41e"
  },
  {
    "content": "3.",
    "id": "c9d4c2d9-88d6-4105-8028-dcf2de50a74e"
  },
  {
    "content": "- Implement cross-training initiatives to allow individuals from each organization to understand their counterpart’s roles and practices.",
    "id": "ab1c534b-62b1-4a7f-86a4-609c93f46afc"
  },
  {
    "content": "Shares of Watford Holdings Ltd. dropped 4.1% in morning trading, after Arch Capital Group Ltd.",
    "id": "7e0dcfc0-d6b9-4e57-b7af-4810111eaf48"
  },
  {
    "content": "I sometimes work weird hours & sometimes forget to get my meds.",
    "id": "f9fc44ec-f0b1-4a27-b960-d8ea6ee987c4"
  },
  {
    "content": "They worked together and carried the cake to their home.",
    "id": "ac6dc567-469f-4409-a127-1915b8512e11"
  },
  {
    "content": "Amerant Bancorp Inc. (NASDAQ:AMTB) Q1 2020 Results Earnings Conference Call April 28, 2020, 9:30 am ET Company Participants Laura Rossi - Investor Relations Off",
    "id": "afc90c97-41d8-41b8-81c2-7a3cdeda5c70"
  },
  {
    "content": "Net loss for the full-year 2020 was primarily driven by $88.6 million in provision for loan losses during the period.",
    "id": "83d311f9-c840-4420-a14f-9c27d5353db5"
  },
  {
    "content": "Once upon a time, there was a team of animals who lived in the forest.",
    "id": "a111f934-fd1b-40bc-9ce1-c71debdf606f"
  },
  {
    "content": "The latest 13F reporting period has come and gone, and Insider Monkey is again at the forefront when it comes to making use of this gold mine of data.",
    "id": "88653233-9438-4cce-912b-b5e38d40ec3a"
  },
  {
    "content": "It was a chocolate bar, and Lily was so happy she forgot all about the scary earthquake.",
    "id": "30511f9e-2735-44eb-baf5-4c49823bc1a4"
  },
  {
    "content": "The latest rate cut also represented the fourth consecutive interest rate cut by the Fed.Throughout history, every single time the Fed has",
    "id": "1ebfe769-0c3f-4962-9fc2-8a2052d3827e"
  },
  {
    "content": "The teacher was so happy to see how far Amy had come, that she gave her a bright red star sticker.",
    "id": "6a29d0c6-c801-40aa-bcbf-aa845b8d7ad9"
  },
  {
    "content": "- **Understanding Diversity**: Different backgrounds can be shared in informal settings, promoting inclusiveness and understanding.",
    "id": "23227c4c-ea32-428b-9901-a540d07e637d"
  },
  {
    "content": "During the first quarter of 2020, the Baron Asset Fund returned -16.63% (institutional shares).",
    "id": "a8eab933-91e7-4428-9e38-0233a79d6e3f"
  },
  {
    "content": "She makes a good contribution as the fleeing mother.",
    "id": "c48cdef1-5ed9-46c6-85a1-d19c59b3d05e"
  },
  {
    "content": "**1.3 Prioritize Communication**\n   - Develop tailored communication strategies that consider each stakeholder's level of concern and potential opposition.",
    "id": "dc6debf9-43d4-4537-8dcf-3b041977b1a3"
  },
  {
    "content": "You're paying for a good meal not a great one so if you can keep your Peter Lugar steakhouse fantasies in check, an enjoyable few hours paced by excellent service will be had.",
    "id": "72247b28-7dd5-4737-b544-bfb3134e6f8d"
  },
  {
    "content": "She mixed them all together and watched in amazement as the diamond began to grow bigger and bigger.",
    "id": "6007985f-b632-4533-82e8-7b3ebf847adb"
  },
  {
    "content": "### 9.",
    "id": "c0d51ce3-1190-491d-80ad-f49e5c2d3ac9"
  },
  {
    "content": "CORAL GABLES, Fla., March 10, 2021 (GLOBE NEWSWIRE) -- Amerant Bancorp Inc. (NASDAQ: AMTB and AMTBB) (the “Company” or “Amerant”) today announced that on March 10, 2021, the Company's Board of Directors (the “Board”) authorized a new share repurchase program (the “Repurchase Program”) authorizing the Company to purchase, from time to time, up to an aggregate amount of $40 million of its shares of Class B common stock (the “Class B Stock”).",
    "id": "9e1c586b-2c01-4a01-964f-5e251760b977"
  },
  {
    "content": "The action is unglamorised and admirably candid, recognising that both sides committed a great number of atrocities.<br /><br />The performances are superb, with Maguire and Wright both courageous and dignified.",
    "id": "4da3c201-32b9-45fd-a6fc-587e9d14ed5c"
  },
  {
    "content": "Arch Capital (ACGL) displays prudence by issuing senior notes amid a low interest rate environment to procure funds.",
    "id": "6d51224e-e571-4434-87c8-c54cb3e91022"
  },
  {
    "content": "He is a true nobleman, and his values of honesty and courtesy are in direct contrast to the Marquis.",
    "id": "e6f8c25e-9860-41b0-824b-16b0d4df50af"
  },
  {
    "content": "#### B.",
    "id": "623b7cce-84ab-418c-beb0-5307077b15de"
  },
  {
    "content": "In the poster the names of Diana Bracho and Cecilia Suares does not appear.",
    "id": "53e9b3fd-1068-45eb-96fb-b69a30b923c7"
  },
  {
    "content": "**Performance Monitoring**: Establish a dashboard to monitor KPIs specific to customer interactions across all channels.",
    "id": "e313e36e-aec9-4a1a-8a59-b1b88b79ec59"
  },
  {
    "content": "The Notes will mature on June 30, 2025.",
    "id": "55133830-bb36-4492-914f-319ce9561af4"
  },
  {
    "content": "You should check out Baron […]",
    "id": "2239efd6-bf6d-4dbc-a0b8-950b38a01765"
  },
  {
    "content": "It looks yucky.\"",
    "id": "30171327-4c1f-43f0-a3b7-b91f2a711f5b"
  },
  {
    "content": "I ordered the Shanghai Angus Steak, Orange Chicken and the Sweetfired Chicken.",
    "id": "d241efbc-8eba-443e-8696-87860fd8dbbc"
  },
  {
    "content": "They were loaded with cheese and bacon.",
    "id": "a6ee37c2-1c56-47d2-bebd-e25df50c9c84"
  },
  {
    "content": "We each chose a bowl for $6.90, included either super veggies, chow mein, fried rice, etc.",
    "id": "a41d719b-1f53-4917-91d9-5a88dd4c4b60"
  },
  {
    "content": "While the instinct may be to appease the hackers to alleviate immediate fears, every action must consider the long-term integrity and security of your organization.",
    "id": "a90e12c1-53de-4ff7-b38a-1505d5344490"
  },
  {
    "content": "However, all the rest is O.K.",
    "id": "fe30da06-a2bb-4899-88c2-37e9ce8c7297"
  },
  {
    "content": "This place is insanely bad.",
    "id": "3a945202-7dda-4922-ae72-973ff1cba5bf"
  },
  {
    "content": "The bartender that was helping me was very fast with drink refills and bread",
    "id": "2a3a9d55-1329-484c-bfad-e281b5797c21"
  },
  {
    "content": "Lila and Tom are playing with their toys in the living room.",
    "id": "b0dd7ffa-ca64-4bf6-a650-a41c65795cb5"
  },
  {
    "content": "It was the most intense fight I have ever seen Jackie do and climaxes in a slide down a pole amidst exploding lights.",
    "id": "d8710db3-18b6-4ed8-8f11-4f3af67894c4"
  },
  {
    "content": "It will make you strong.\"",
    "id": "156a55e9-1dd4-4ab8-8765-4486fe6e850b"
  },
  {
    "content": "I do think the mac n cheese side is nice.",
    "id": "bfe73493-1458-48f7-b8bb-134dad479827"
  },
  {
    "content": "M.",
    "id": "e46d3da2-9206-46d1-aea3-17ba908682cd"
  },
  {
    "content": "Mr. Iafigliola has served as interim CFO since March 16, 2020 and has been with Amerant since 2004.",
    "id": "f5f69040-6d74-47a9-b083-fb0d67ed83ec"
  },
  {
    "content": "After the disappointing U.S made 'The Protector' directed by James Glickenhaus, Jackie took the concept and placed it slap bang into Hong Kong.",
    "id": "4120c385-340d-4e75-8028-b8db44e1fc61"
  },
  {
    "content": "Its brilliant bravery paid off and it got to stay safe with its friends for many more fun games of hide and seek.",
    "id": "789244cc-3254-4c7f-9533-73bd09f9232e"
  },
  {
    "content": "He gives the world hope for the people of power.",
    "id": "e29a37e0-eb81-4051-a708-e45e5ee563d7"
  },
  {
    "content": "- **Competitive Analysis:** Analyze competitors’ products to determine why consumers are turning to them.",
    "id": "6987873a-a9a4-444f-b17b-aff0da104e0a"
  },
  {
    "content": "Compared to the second quarter 2019, lower NII in the second quarter of 2020 is attributed to a decline in average yields on interest-earning assets, partially offset by higher average interest-earning asset balances and lower deposit and professional funding costs.",
    "id": "2f361d77-28f0-4c3b-a5c8-5348f3d3582d"
  },
  {
    "content": "On February 27th we published an article with the title Recession is Imminent: We Need A Travel Ban NOW and predicted a US recession when the S&P 500 Index was trading at the 3150 level.",
    "id": "d42a3aa3-9970-4899-bb8b-1c319e0c51b7"
  },
  {
    "content": "**Actionable Steps:**\n- Conduct demographic research to identify high-potential areas.",
    "id": "6632a6bf-6520-4b76-9e16-130fdff61cdf"
  },
  {
    "content": "You get two choices either white or wheat.",
    "id": "e470bf14-4071-4402-b2e6-782db407281a"
  },
  {
    "content": "**Evaluate Sector Performance**: Focus on identifying sectors that gain strength despite economic downturns.",
    "id": "23e13b4d-7739-4114-9f3c-b6605f9833d4"
  },
  {
    "content": "- Threats: Assess market threats including competitor innovations and market saturation.",
    "id": "9c074742-a7e4-4551-95da-17a61edbd51f"
  },
  {
    "content": "Her brother felt sad and went to their mom.",
    "id": "7bdfce87-1b44-4984-aeca-a90485f78c99"
  },
  {
    "content": "He quickly ran towards the cat and bit her foot.",
    "id": "5b935166-e089-432c-9473-4e08231f97ff"
  },
  {
    "content": "The light was so magical that the princess could not resist playing with it.",
    "id": "3cc47f12-ee85-4c66-8640-0dc3d62b2c49"
  },
  {
    "content": "Two of those wings together still wouldn't have amounted to a regular sized wing.",
    "id": "74e64544-02df-497c-9043-affcb8bd6b59"
  },
  {
    "content": "Lily thought about it and decided to spread her love of music.",
    "id": "ee7c1739-a934-4092-9461-94b4a85372d8"
  },
  {
    "content": "**Incident Response Plan Development**:\n   - Develop or refine an Incident Response Plan that includes playbooks for potential future incidents, regular training, and simulations.",
    "id": "e3446b80-2445-43a6-ac60-99f258109342"
  },
  {
    "content": "Cuervo will lead all HR initiatives and strategies for the organization.",
    "id": "281f5b49-be65-4b2e-9664-a496ca141ac0"
  },
  {
    "content": "Scottland is still run by English nobles, and the highlanders never can seem to catch a break when dealing with them.",
    "id": "a53811e9-0b7f-4ff8-8f59-0629c4944d51"
  },
  {
    "content": "Mom said it made people lazy.",
    "id": "efd202c5-0db5-4890-ad6a-a7e6965d5166"
  },
  {
    "content": "Hogwash I say.",
    "id": "c07f8947-9c02-451e-b2b9-d436c51e9773"
  },
  {
    "content": "- May also incur costs of coaching and monitoring, along with potential future legal risks.",
    "id": "764336a6-f65f-4091-a71b-82f1ed779b24"
  },
  {
    "content": "- **Actionable Step**: Create a budget forecast for hiring with a focus on long-term ROI analysis.",
    "id": "c71294eb-cf57-458d-80f0-47ee08ececd6"
  },
  {
    "content": "Jerry Plush, Chief Executive Officer, and Carlos Iafigliola, Chief Financial Officer, will host a conference call that morning at 9:00 AM ET to discuss the Company's financial and operating results for the quarter.",
    "id": "a7e8a06b-8ec9-48ed-8b8d-e3f37719c489"
  },
  {
    "content": "CORAL GABLES, Fla., April 10, 2020 -- Amerant Bancorp Inc. (NASDAQ: AMTB and AMTBB) (the “Company”), today announced it will report first quarter 2020 earnings results before.",
    "id": "6146a9f9-58ae-4a96-93bb-733757f48405"
  },
  {
    "content": "ACGL earnings call for the period ending June 30, 2019.",
    "id": "01d09c85-8ffe-4ab8-824b-b8b4b31bf17e"
  }
]