[
  {
    "content": "This call feature often becomes active after a specific period following the issuance of the convertible securities, typically at a price that includes a premium over the par value.",
    "id": "b22f1686-7ff8-4db7-bbf5-124ea61aa19c"
  },
  {
    "content": "Why, I ask, why?<br /><br />The episodes all fall flat whenever the female guest star or recurring character comes on screen.",
    "id": "7ccc9cd8-cdc4-4fa3-a172-d63a7d471b86"
  },
  {
    "content": "The food was great.",
    "id": "e6f46621-8256-4569-bf33-f52af46c7a24"
  },
  {
    "content": "She opened the door and saw a man playing the guitar.",
    "id": "363f42c9-152f-4d3b-888d-e906a83e83cc"
  },
  {
    "content": "One day, she saw a bird flying in the sky.",
    "id": "50fe3eac-faea-4250-94c6-3237594ffcca"
  },
  {
    "content": "Los primeros pasos de Odegaard como titular en el Real Madrid no están siendo fáciles y comprueba que el nivel de exigencia es superior a cualquier equipo en el que haya estado",
    "id": "cff3a272-e0cd-459b-9931-0df64e6d7b45"
  },
  {
    "content": "The worker complimented me on my lady bug coloring page.",
    "id": "e9a46638-55d7-4869-ba1a-c077af147d0e"
  },
  {
    "content": "**Consider the Application Domain**: Different sectors have varying balances of acceptable explainability versus accuracy.",
    "id": "c2cecfdd-bc50-418f-8877-f4cf3e64a6d7"
  },
  {
    "content": "The bosses are spying on their workers, the unseen eye regarding his faceless minions.",
    "id": "e4914f16-d239-479e-9d24-3feaf839d100"
  },
  {
    "content": "Here is how American Vanguard (AVD) and Southern Copper (SCCO) have performed compared to their sector so far this year.",
    "id": "3a055945-471d-40ca-8e61-4653025f4990"
  },
  {
    "content": "Their choice is the initial evidence of their curiosity about all of the world's people, a quality that makes viewing their experiments immensely rewarding and fascinating today.<br /><br />Rating: 8",
    "id": "452fa343-59ac-41ca-b2e2-d732eb4331ec"
  },
  {
    "content": "She gathered all the things she needed and started to make the net.",
    "id": "6e482bbf-3829-49dd-929c-11adfc02f941"
  },
  {
    "content": "**Building Your Portfolio**:\n   - Construct a diversified futures portfolio based on your research, risk tolerance, and strategy.",
    "id": "92c21770-fbd5-4da2-b0c1-cddf88e74ec3"
  },
  {
    "content": "**2.",
    "id": "17462238-de2c-486b-ba9b-2f086318cde6"
  },
  {
    "content": "They kept running and searching.",
    "id": "f3812cf8-9ba4-4e17-a21a-42a668158575"
  },
  {
    "content": "Hands-down, one of the best meals I've ever had from a fast food restaurant.",
    "id": "210d8eae-4795-404b-a322-2689c9b62a98"
  },
  {
    "content": "I often wish that Academy Award winning documentaries were easier to find, and this one from more than 50 years ago is still as interesting and informative as I am sure it was when it was first released.",
    "id": "07582568-3506-443b-9994-d9f6124ba6bf"
  },
  {
    "content": "**Financing Options**\n   - **Conservative Financing**: Opt for fixed-rate mortgages to reduce the risk of rising interest rates affecting cash flow.",
    "id": "65072b07-5bdd-47ea-9c82-007ba8d7af6d"
  },
  {
    "content": "$15.50 for a tiny sliver of \"grilled\" (read: bland) salmon presented on a cedarwood plank (not sure what that was about, maybe some sort of pirate allusion), frozen broccoli semi-revived (though inedibly bland) by hot water and nothing else (this is the reason Americans hate vegetables), and a meh serving of rice pilaf.",
    "id": "48345424-2bfa-4d4a-aa52-68cfc5886933"
  },
  {
    "content": "She was so happy and grateful that she gave her mom a big hug.",
    "id": "371b35d6-7f70-4280-9303-76859a215055"
  },
  {
    "content": "Ugh.",
    "id": "3697e687-f180-4940-a254-aa360e6fc043"
  },
  {
    "content": "John's response , \" Sorry you had to see that \" !",
    "id": "1d1951f6-d029-4bd3-820a-c1d24206944c"
  },
  {
    "content": "Interested parties may participate",
    "id": "ceb51ccf-6fdd-43c2-8af9-498acdd505d1"
  },
  {
    "content": "Then she said goodnight to the nosy little bird and hopped back into bed.",
    "id": "b8c0965c-238d-45a2-81bd-b00c6db60399"
  },
  {
    "content": "Before long, it was time for Amy to go home.",
    "id": "ab47f110-2256-4598-bf02-4f805c0d6697"
  },
  {
    "content": "- **Best Practice**: Use tools such as SWOT Analysis (Strengths, Weaknesses, Opportunities, Threats) to provide a balanced perspective on risk and uncertainty.",
    "id": "c547c1d0-9a0a-4e12-8c51-b6a549801be0"
  },
  {
    "content": "Muchas gracias por haberlo seguido con nosotros.",
    "id": "92c0caac-dd4a-46db-838e-cbcfb2d7ac5f"
  },
  {
    "content": "Great customer-service follow up!",
    "id": "39295a51-cc05-446d-8623-fe143ef894c9"
  },
  {
    "content": "The toddler came over and smiled at the person.",
    "id": "04456089-e26a-443a-88f8-e299005e651b"
  },
  {
    "content": "Again, he made a lame excuse that because he didn't have an order for over an hour, blah, blah blah.",
    "id": "8137d975-1206-4f4c-a11b-f5e880d3ae18"
  },
  {
    "content": "Gauge Cultural Alignment and Ethical Standards\n\n**Action Steps:**\n\n- **Assess Cultural Fit:** Attend seminars or events hosted by the adviser.",
    "id": "8e271a4a-43b3-4a70-bde2-8d32ec9454c3"
  },
  {
    "content": "Due Diligence and Authenticity\n\n1.",
    "id": "d34840eb-919a-4ac8-af20-827db69696ea"
  },
  {
    "content": "Then he stopped - apparently warned by his friends at Scotland Yard that the murder did not bare looking into.",
    "id": "a7752ec3-97ef-4d2e-a0f2-2bf6576c787f"
  },
  {
    "content": "- **Step 2: Identify Patterns and Anomalies**  \n     Look for repeating patterns in history and also be vigilant for anomalies that do not fit typical narratives.",
    "id": "1ab21148-7cce-40fc-8f0b-d53a42e48830"
  },
  {
    "content": "When the child got close, the person realized that it was a 3 year old toddler.",
    "id": "f3d950bf-861d-4a18-b149-b6ad722c91cb"
  },
  {
    "content": "In 1898 one of the heroes of the various imperial wars, and the leader of the last victorious charge at the battle of Omdurman that destroyed the Mahdist army (see FOUR FEATHERS) was Sir Hector MacDonald.",
    "id": "ff2847c4-524d-47f9-bf74-1bd639621b6c"
  },
  {
    "content": "Narrative Engagement:**\n   - **Create Inclusive Narratives:** Encourage narratives that encompass diverse perspectives to foster inclusivity and understanding.",
    "id": "69e737b1-44f8-49e9-b493-71a7a7f48eca"
  },
  {
    "content": "The storyline is intelligent, never boring and has some nice little twists.",
    "id": "0379112a-e104-463c-af8a-8befa756e385"
  },
  {
    "content": "Arden Trust Co increased its position in shares of Sociedad Química y Minera de Chile S.A. (NYSE:SQM) by 8.5% during the third quarter, according to its most recent filing with the Securities and Exchange Commission.",
    "id": "650ccf78-ae80-42c4-a0a1-52cae87456c4"
  },
  {
    "content": "I mean as far as graphical violence is concerned.",
    "id": "403d16d9-2058-4113-9c07-8c78e66356e5"
  },
  {
    "content": "They not only provide the necessary credibility and resources but also embody the values of transparency, accountability, and engagement that are essential for a thriving OKR culture.",
    "id": "10ee0c1f-5436-44d1-9810-9bee4c76a577"
  },
  {
    "content": "Tras finiquitar la marcha del galés, Zidane se estrena en la liga 2020/21 con Odegaard recuperado y con posibilidad de debutar ante la Real Sociedad, con el que jugó la pasada temporada",
    "id": "0dd88698-d233-4079-9cba-a12e6e696386"
  },
  {
    "content": "Lithium market news - EU sounds alarm on critical raw materials shortages - Needs 18x more lithium by 2030, 60x by 2050.",
    "id": "741e9bd7-4766-46ef-8ef8-ed98735f537c"
  },
  {
    "content": "Yep!",
    "id": "493439a4-59b7-41bd-95c2-2b0ebdffdc48"
  },
  {
    "content": "Clearly inspired by some comic books, such as the ones from F. Miller.",
    "id": "251ea193-6b67-4046-849f-dbf41fe79cae"
  },
  {
    "content": "The special side that was a sweet potato nuts and marshmallow bake with bourbon  casserole was a instant potato tasteless waste of money.",
    "id": "cb40dc06-730a-47a5-a636-7df399de0a61"
  },
  {
    "content": "The Company sells its products in […]",
    "id": "ceb28215-3986-4dce-b5f9-752d54b45f1a"
  },
  {
    "content": "When the puppy woke up, it was already dark outside.",
    "id": "35ced467-da6e-462e-aad8-85e8bf11e1e1"
  },
  {
    "content": "Days and days went by and Joe thought he was safe.",
    "id": "9ca7df54-b5c3-4803-b475-470caf942ffa"
  },
  {
    "content": "Between the rudeness, the mistakes, the cold food, and sandwiched that look thrown together from across the room... You can do better.",
    "id": "299df348-8746-487e-aa25-7521110afb3a"
  },
  {
    "content": "They certainly come from different places, but as they get to know each other, both turn out to be Men Of Honor.<br /><br />Other good performances to note are Charlize Theron as DeNiro's wife and Hal Holbrook as the head of the diving school, a guy the Navy just wish would retire for reasons you'll see.<br /><br />Men Of Honor is an inspiring story about people with courage to spare and the ability to change.",
    "id": "0840551d-99b4-4651-894c-b62c51a80702"
  },
  {
    "content": "Andrea Rizzi, nuevo subdirector de Opinión y Javier Lafuente, de América",
    "id": "2ee4166c-ed5f-4f0b-9fc7-a9be50c8a274"
  },
  {
    "content": "This review is more about the straight up ignorant people that I was seated next to...",
    "id": "c3083851-20cf-4f70-ac72-88afded0de32"
  },
  {
    "content": "#### 2.5 Personal Investments\n\n- Advisers might have personal investments in funds or products they recommend, leading to a conflict if they stand to benefit from client investments in those same areas.",
    "id": "80d53cf0-c962-4af4-9a9c-4b2a29509038"
  },
  {
    "content": "Despite a wavering English accent, Romola Garai does great work as the frantic sister in question, and Jonathan Pryce is suitably menacing as the shady head of ominous mega-corporation Avalon.",
    "id": "46668c5f-8c2b-49d3-bdc7-53b4f5c7baf4"
  },
  {
    "content": "Several psychological experiments have elucidated this phenomenon, illustrating how our brains make snap judgments and interpretations in daily life.",
    "id": "045a8c58-4f9b-4677-ac9d-93e9fcd13c12"
  },
  {
    "content": "I had ordered us the drinks and they didn't except the rewards from the app of Starbucks.",
    "id": "fbf39886-b76b-480a-95f2-9b314301f6c5"
  },
  {
    "content": "Let's find out.",
    "id": "d5ea25d5-201a-42df-957f-325e1fe606cf"
  },
  {
    "content": "The truth.",
    "id": "7b0b45a7-ff92-4733-b2b4-b155f75e1f8f"
  },
  {
    "content": "Justo empate en el Reale Arena.",
    "id": "fda7b168-eadd-4cc6-a641-0dd5577c350c"
  },
  {
    "content": "It immerses you into the world of a future Paris.",
    "id": "0511547c-6ed3-44dd-bcc4-e04805bf8229"
  },
  {
    "content": "The story of Brashear's work to become a Navy Diver, and his life as a Navy Diver beyond his graduation, is not the only story that is presented.",
    "id": "3ad62970-f33a-4509-beb2-e94c7885b430"
  },
  {
    "content": "**Heuristics and Biases**: This experiment underscores that individuals frequently rely on heuristics (mental shortcuts) to make judgments under uncertainty.",
    "id": "27e59d2a-0407-47a1-826a-c4daf3470233"
  },
  {
    "content": "I thought DeNiro was perhaps a bit over the top in his portrayal of Sunday (although, who knows, Sunday might well have been this extreme kind of loose cannon) and the portrayal of Sunday's wife Gwen (by Charlize Theron) also made me question whether these parts were \"jazzed up\" to provide entertainment value.<br /><br />A good movie, though.",
    "id": "76648f0c-ad7d-41a2-be4f-ff21c0c8d78f"
  },
  {
    "content": "I couldn't believe the price, two for a dollar.",
    "id": "014504c3-22b5-471d-b9df-4e148cc57990"
  },
  {
    "content": "**Recognize and Reward Contributions**\n   - Acknowledge and reward individual and team efforts regularly, regardless of immediate outcomes.",
    "id": "734ae3fe-ce88-4d55-b88a-9e0ac8f745d4"
  },
  {
    "content": "My salmon was perfectly cooked.",
    "id": "a0b3f9ab-55ea-4e8c-a84a-e107fcd48f1f"
  },
  {
    "content": "AMVAC announces two tools it considers the “next generation in weed resistance management.”",
    "id": "0aced6ce-1219-478c-add5-0a9625d8b4e2"
  },
  {
    "content": "I'd just like to decide when I'm gonna be hanging with the drunk crowd...lol.",
    "id": "7647960d-3d9d-4fab-b70b-710a6b7c7aaf"
  },
  {
    "content": "The \"helpful\" young man then read me a total with no chance to add anything else to my order.",
    "id": "4cfc55af-4f40-4c28-a180-3f61a6b914bc"
  },
  {
    "content": "**Recognize**: Identify and acknowledge instances where narratives could be influencing decisions.",
    "id": "abbd24ab-986e-4a52-82dc-912d74359c30"
  },
  {
    "content": "American Vanguard's (AVD) buyback program will offset the increase of outstanding shares stemming from equity awards made to the company's employees.",
    "id": "702a8b1f-5780-49d6-a264-34cd843703e2"
  },
  {
    "content": "Allison (ALSN) sees year-over-year growth in its top and bottom lines in third-quarter 2022.",
    "id": "e7f244c2-d7ce-43c9-8e2c-f06eb5593673"
  },
  {
    "content": "The 3D Dental Scanners Market will grow by USD 622.29 mn during 2020-2024",
    "id": "3fc3bf83-2c05-406a-b821-8bb6723271f7"
  },
  {
    "content": "### Conclusion\n\nUnderstanding call provisions on convertibles is essential to navigating the associated risks effectively.",
    "id": "06bbfd3f-bad9-4046-978c-56bbcdc7e928"
  },
  {
    "content": "Ok... get ready...for the ratchedness that is the Popeyes of Smyrna.",
    "id": "bf987537-5197-41cc-90f3-9760db52f3cc"
  },
  {
    "content": "El nuevo curso arranca este sábado tras siete meses de parón, con las blaugranas como favoritas y con un Real Madrid-Barcelona el domingo como gran gancho",
    "id": "baa06547-846d-467f-8a2b-7eaef38d42f8"
  },
  {
    "content": "Few signings, illness and empty stadiums have led to a flat pre-season – but there is cause for optimism with Manuel Pelligrini back, the Deyverson show and Lionel Messi still around",
    "id": "a56494d4-4afe-49ba-98ab-545a1be2349e"
  },
  {
    "content": "It is a gorgeous science fiction triumph on the surface, but scratch it or even poke it a little and its unnecessarily complex plot becomes glaringly apparent, as do the flat characters.",
    "id": "6c36156d-6626-4fa1-86b1-330f26e837b1"
  },
  {
    "content": "Anna was very sad, but then her mom said, \"That's OK. We can still bring a piece of the sky with us!",
    "id": "54f71ab4-26b4-416a-98ff-2b3f96d84e9e"
  },
  {
    "content": "By following best practices and adopting a strategic framework, organizations can leverage OKRs to transform their strategic visions into tangible results, ensuring optimal use of resources and sustained growth.",
    "id": "4d99fab2-74b3-4c9c-bf1f-6e19e4544d49"
  },
  {
    "content": "More<br /><br />than a novelty, this film is funny, frank and fascinating, yet moody,<br /><br />mysterious and morose.",
    "id": "8af19b98-0514-4a52-a551-6baa2e257f3b"
  },
  {
    "content": "Based on my observation from visiting every CFA, management and/or owners must care for their staff well for them to continue to have that constant high-level performance of customer service.",
    "id": "1db34b57-9575-45ab-a958-42305b2edc4b"
  },
  {
    "content": "The story is inspiring without being overly manipulative or fake.",
    "id": "fb277a9e-1f74-41d1-bad9-ad1f93ad943c"
  },
  {
    "content": "Rather incredibly, Contra Todos (Against Everybody) (original title, which the producers discarded: God Against Everybody) got very low GPA (grade point average) in this website.",
    "id": "7b35439c-307e-4ca4-9d0a-013e3101b680"
  },
  {
    "content": "Competitive Moats\n- **Identify Competitive Moats:** Determine if the company has any sustainable competitive advantages (network effects, brand loyalty, patents, economies of scale).",
    "id": "cd42c46f-4c22-4c28-a046-2de2e8c319f6"
  },
  {
    "content": "So, I chilled.",
    "id": "832ad449-dd1a-4794-a87b-e58b5c602505"
  },
  {
    "content": "Their numerous Oscar winning films are endless from the charming Toy Story to the mystifying Wall-E and so any company or director has a real challenge to knock them of their perch.",
    "id": "db736d6c-1855-4db1-bb57-40100d6ac3fa"
  },
  {
    "content": "!Here's a message to all those brave sainik(soldier)-sons please respect the father of the nation!Please Obey and happiness shall be bestowed or else it's a disaster in waiting,isn't it?",
    "id": "78ebbe8a-18f7-418f-b576-e56b37fb38c1"
  },
  {
    "content": "But then the crank on the camera/projector was turned and movement began.",
    "id": "dae970f5-9bf3-41b8-9051-1dd7c5aa28e7"
  },
  {
    "content": "### 1.",
    "id": "f7a0e251-e4b6-47dd-9e94-b43c2f72aaba"
  },
  {
    "content": "Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.",
    "id": "2be4f7fe-608b-4194-970f-b197372caa07"
  },
  {
    "content": "If you can do that, it _really_is_ good.<br /><br />The story of Carl Brashear, a true-to-life hero, is inspirational enough to last a lifetime.",
    "id": "a14251e2-e4b1-477e-bfa9-eefcd3ec6a15"
  },
  {
    "content": "After a while, Jane saw a beautiful shell.",
    "id": "2c2659ec-86e7-43bb-ae41-bb11c935f2c0"
  },
  {
    "content": "**2.",
    "id": "30df368c-279d-4942-9c57-b5653103289b"
  },
  {
    "content": "He ran up to it and kicked a ball right in the middle.",
    "id": "778b1b85-be89-4220-b97d-1841642792f8"
  },
  {
    "content": "Finally, the little girl decided to get a big cookie.",
    "id": "fa483d8d-3712-4c04-8a93-e8df2b7c7528"
  },
  {
    "content": "WTF are your hours????",
    "id": "780a9a61-29aa-4c8d-afc7-c3087b4a2e06"
  },
  {
    "content": "Actually, one of the most disturbing scenes involves an abstract painting of the house by its next-door amateur-artist neighbor who is trying to visualize its corruption on canvas.<br /><br />Be sure to read the great novel.",
    "id": "31dda182-0887-43bc-891e-b0706d38d61b"
  },
  {
    "content": "Why he<br /><br />has not made more films like this, I have no idea.",
    "id": "e03d545e-2d9e-4198-a347-9b092c0126f7"
  }
]