[
  {
    "content": "PROG Holdings, Inc. (NYSE:PRG ) Q3 2022 Results Conference Call October 26, 2022 8:30 AM ET Company Participants John Baugh - VP, IR Steve Michaels - President and CEO Brian Garner - CFO Conference Call Participants Kyle Joseph - Jefferies Jason Haas - Bank of America Anthony Chukumba - Loop Capital Brad Thomas - KeyBanc Bobby Griffin - Raymond James Vincent Caintic - Stephens Hal Goetsch - Loop Capital Operator Good day, and thank you for standing by.",
    "id": "34ffaafd-996c-4052-9b88-d3200f08e540"
  },
  {
    "content": "Conference call and webcast to be held the same day at 8:00 AM ET Conference call and webcast to be held the same day at 8:00 AM ET",
    "id": "d53e7e41-aad0-4dc0-9266-1f23d52e8d14"
  },
  {
    "content": "This mess is FOUR HOURS LONG.",
    "id": "d860d48b-99df-4533-8717-276a22ba85d9"
  },
  {
    "content": "2.",
    "id": "d8feccc4-f913-4015-b235-80aa309225ff"
  },
  {
    "content": "It was super easy dropping off a package that I had and they put the label I had printed out on it for me.",
    "id": "5cc9a6b9-7875-475c-b92f-099440b5505e"
  },
  {
    "content": "From then on, she was very careful to never repeat the same mistake again!",
    "id": "290cdd77-c3db-46ac-bdc0-5b625f89e165"
  },
  {
    "content": "Although some excellent players take part, including Jon Tenney, Timothy Olyphant, and Cynthia Nixon, they are grounded by a puerile script which relies nearly totally upon clever dialogue; which isn't.",
    "id": "529eb84a-1e66-40b5-a6ac-d74675960c66"
  },
  {
    "content": "He filled the sink with more water and kept scrubbing, but the dirt didn't go away.",
    "id": "f421ece8-243d-4550-a996-5925df9c36ea"
  },
  {
    "content": "\"This is perfect!",
    "id": "727639d9-740d-4061-adcf-4a51d7d4acf3"
  },
  {
    "content": "I truly cant think of any realistic scenario that would lead to that other than killing someone to steal their clothes so you can fill up your jumble sale stall!",
    "id": "7ab6fd7e-5659-47c7-a2a8-00e9a925e073"
  },
  {
    "content": "Drinks are usually ready by the time you drive to the window.",
    "id": "b1261bf7-d0f0-4ca8-8337-e5adec0b8d1a"
  },
  {
    "content": "First Watch Restaurant Group went public in September 2021, raising approximately $170 million in a U.S. IPO.",
    "id": "b58e7a6b-9bce-47c7-800d-00b805a0af71"
  },
  {
    "content": "\"Pulp Fiction\" was robbed for \"Best Picture.\"",
    "id": "96832c2c-d2b6-4897-841e-aa8c6591ad58"
  },
  {
    "content": "ACER, PRG, and ALX have been added to the Zacks Rank #5 (Strong Sell) List on June 23, 2022.",
    "id": "7098dcd3-fe4c-40da-8488-426bf7099b77"
  },
  {
    "content": "**Enhancing Public Goods**\n   - **Definition**: Public goods are services provided without profit to all members of society.",
    "id": "07a4b32e-6272-417a-93fd-82a09f65abf7"
  },
  {
    "content": "It was a big frog.",
    "id": "5fc21ab7-8cc0-4ea3-a524-faa8d5f0dfe2"
  },
  {
    "content": "BRADENTON, Fla., Oct. 05, 2021 (GLOBE NEWSWIRE) -- First Watch Restaurant Group, Inc. (“First Watch” or the “Company”) (Nasdaq: FWRG), the Daytime Dining concept serving breakfast, brunch and lunch, today announced the closing of its initial public offering of 10,877,850 shares of its common stock including the full exercise by the underwriters of their option to purchase an additional 1,418,850 shares of common stock at the initial public offering price of $18.00 per share, less underwriting discounts and commissions.",
    "id": "a6a03823-ef06-42dd-93ca-187ad4669bae"
  },
  {
    "content": "First Watch Restaurant Group, Inc. (FWRG) might move higher on growing optimism about its earnings prospects, which is reflected by its upgrade to a Zacks Rank #2 (Buy).",
    "id": "b50bcbef-1949-4e8e-aa77-8ae7a16c5b7b"
  },
  {
    "content": "To this day, Pete still remembers his old friend Jingle, the reindeer.",
    "id": "9cbe0abd-6d5a-4720-b6c1-4a8814541162"
  },
  {
    "content": "The other cars they were bringing up were pretty well cleaned off.",
    "id": "369122ae-d60d-4f69-972f-6a913bb9884e"
  },
  {
    "content": "ET to discuss its financial results for the first quarter of 2022.",
    "id": "1457eb8f-515d-457a-8716-f7b77d7769b4"
  },
  {
    "content": "The two friends cheered, and they were no longer anxious.",
    "id": "33d99efc-4399-4759-b3dc-509a6a3f0bfb"
  },
  {
    "content": "*******END OF SPOILERS<br /><br />It remains unclear what vision this director wants us to see us because there are so many other stories here: Illegal immigrants want to enter Europe, there are frequent radio broadcasts about the overthrow of Iraq's former regime.",
    "id": "a4b78526-0deb-45ba-8c7e-b4c57392472a"
  },
  {
    "content": "But flat out, you can't go from watching Saving Private Ryan to LOC.",
    "id": "07b0a193-c1e4-4261-9f41-274bb761182b"
  },
  {
    "content": "She forgot all about acting responsibly.",
    "id": "f3e3896e-2c89-40d0-8939-3f478fd60583"
  },
  {
    "content": "Harry's issues all started when he witnessed Santa \u0096 his daddy in a costume obviously \u0096 caress his mommy's naked legs at a tenderly young age.",
    "id": "f9e4de34-61b7-4391-a2ac-ddec8a8653f8"
  },
  {
    "content": "Bioventus Inc. (BVS) CEO Ken Reali on Q2 2021 Results - Earnings Call Transcript",
    "id": "2608266f-ca66-4e95-b68f-0468a598e0a9"
  },
  {
    "content": "I was curious as to how the pieces were going to look and they  basically are drastically deformed Chicken Tenders.",
    "id": "0f544899-98af-487a-a7c5-a9aed6d3ede1"
  },
  {
    "content": "He literally couldn't take an order as simple as a strawberries and cream frappuchino and 2 cake pops.",
    "id": "9428f0f1-8d0a-409f-aadd-7de254ccf85f"
  },
  {
    "content": "3.",
    "id": "1b7ab39f-c47e-4654-892e-4f88d9ad7147"
  },
  {
    "content": "YOU GUYS: the strawberry butter that comes on the waffles tastes like strawberry ice cream.",
    "id": "c5df5b00-bd2d-46b0-8127-7024b04167ef"
  },
  {
    "content": "A corrupt cop tying the authority, the criminals and the police together - check.<br /><br />Slow motion and/or jerky frame rates for showing what the actor's reaction can't - check.",
    "id": "66562eb0-9574-490f-8647-0ea7211cfc4e"
  },
  {
    "content": "Frankie Darro had a sometimes abrasive screen presence but in this he was playing a good kid.",
    "id": "2d973dab-ffd7-4b7a-8847-f86b0bec1a78"
  },
  {
    "content": "SALT LAKE CITY--(BUSINESS WIRE)--PROG Holdings, Inc. (NYSE:PRG), the fintech holding company for Progressive Leasing, Vive Financial, and Four Technologies, is scheduled to release financial results for the third quarter of 2022 on Wednesday, October 26, 2022, prior to market open.",
    "id": "2de17a21-03a1-4df0-bb09-4e45c99cbde8"
  },
  {
    "content": "Her copper coin had been stolen!",
    "id": "20e40b30-efcd-4f71-9193-48e37426f965"
  },
  {
    "content": "PROG Holdings (PRG) delivered earnings and revenue surprises of 26.74% and 0.74%, respectively, for the quarter ended June 2021.",
    "id": "7b2a59b9-9b12-4132-96bc-1860d917cfa0"
  },
  {
    "content": "4.",
    "id": "1eaf50e1-0bf5-41a9-b6d0-b2f6ea7706f7"
  },
  {
    "content": "Come on, let's have a race!\"",
    "id": "56e9f5b8-4ce1-4f6f-b372-14ba6ce7e09d"
  },
  {
    "content": "This press release presents historical results, for the periods presented, of Bioventus, LLC, the predecessor of Bioventus Inc. for financial reporting purposes.",
    "id": "2d526a52-b81c-4287-bf90-439f6c3888a6"
  },
  {
    "content": "ET.",
    "id": "c8ddbfbb-4ff6-4766-9831-4085e47f4874"
  },
  {
    "content": "**Create a Communication Timeline**:\n   - Establish a timeline that outlines when and how different communications will occur.",
    "id": "9c809f3b-a602-49ba-98c8-4bcd12a46813"
  },
  {
    "content": "Do the numbers hold clues to what lies ahead for the stock?",
    "id": "fd3cf515-3add-406b-a97b-5a3fbc84b5f3"
  },
  {
    "content": "- **Craft a Vision Statement:** Develop a clear vision statement that encapsulates the desired culture and aligns with business goals.",
    "id": "02ba6005-9cd7-465b-918b-486dd8fd1aa9"
  },
  {
    "content": "DURHAM, N.C., March 11, 2021 (GLOBE NEWSWIRE) -- Bioventus Inc. (Nasdaq: BVS) (“Bioventus” or the “Company”), a leader in solutions for innovative healing, reported that the first patients have been enrolled and dosed in its Phase 1 open-label, dose-escalation study of MOTYS (PTP-001) with Dr. Shailesh Patel, M.D.",
    "id": "b3cd8d65-1554-4808-a9fc-10004443ab92"
  },
  {
    "content": "Stephens analyst Vincent Caintic downgraded PROG Holdings Inc (NYSE:PRG) to Equal Weight from Overweight and lowered the price target to $57 (an upside of 21%), from $59.",
    "id": "e5e7e7b5-ff76-4b1f-8702-9c1f88c6b84f"
  },
  {
    "content": "The service was atrocious.",
    "id": "3268fe44-dcac-4ba0-9a42-3c528bc349af"
  },
  {
    "content": "After all, Kyser and his band mates are incredibly obnoxious and their humor is very, very broad (i.e., unsophisticated and cheesy).",
    "id": "18de92b4-a70c-484a-a1a6-3bcdea906a0d"
  },
  {
    "content": "ET.",
    "id": "36e2fab0-2980-42a7-b54e-fbfc511b1711"
  },
  {
    "content": "Just the way I like them.",
    "id": "c0eaf229-652e-4831-87ec-104af9a5d4ff"
  },
  {
    "content": "PROG Holdings (PRG) delivered earnings and revenue surprises of -2.90% and 2.31%, respectively, for the quarter ended December 2021.",
    "id": "f12838b4-0480-48a9-b5ff-56f0b29235b3"
  },
  {
    "content": "But when Stewart discovers an aboriginal woman's body floating face-down in a river, things appear to have turned out for the worst.",
    "id": "b063c82e-e05a-4fbc-a0f5-7a88605da43f"
  },
  {
    "content": "- **Actions**:\n  - **Policy Framework**: Create clear policies and procedures, but gradually introduce flexibility for innovation.",
    "id": "ce6845d0-fc2e-4a16-b218-6d65f5a72cba"
  },
  {
    "content": "**Recognition and Growth:**\n   - Implement rewards and recognition programs that celebrate achievements, both big and small.",
    "id": "74432221-1f3c-4f6c-8750-aa96e79827b9"
  },
  {
    "content": "I may enjoy it every other Blue Moon and since the 23rd was going to be a Full Moon, I thought that was close enough for me to enjoy some Original Recipe.",
    "id": "87df7c8c-c217-4fb7-88f2-8e89da7247e8"
  },
  {
    "content": "First Watch Restaurant Group, Inc. (NASDAQ:FWRG ) Q3 2022 Earnings Conference Call November 7, 2022 8:00 AM ET Company Participants Raphael Gross - Investor Relations, ICR Chris Tomasso - Chief Executive Officer and President Mel Hope - Chief Financial Officer Conference Call Participants Jared Garber - Goldman Sachs Andy Barish - Jefferies Andrew Charles - Cowen Jeffrey Bernstein - Barclays Brian Vaccaro - Raymond James Nicole Miller - Piper Sandler Chris O'Cull - Stifel Gregory Francfort - Guggenheim Sara Senatore - Bank of America Jon Tower - Citigroup Operator Thank you for standing by and welcome to the First Watch Restaurant Group Inc. Third Quarter 2022 Earnings Conference Call.",
    "id": "222cea6b-b6e3-4647-88c9-633d95100873"
  },
  {
    "content": "Furthermore, it is one of the lesser expensive lunch options in the area.",
    "id": "85c77469-743c-4532-816f-da7e40281e38"
  },
  {
    "content": "Gotta say, not usually a huge fan of the 'marts, but this store has been there for me and keeping things going despite the crazy times of 2020.",
    "id": "e636c15d-82c4-4b5b-9ebf-ac59ab01a4e4"
  },
  {
    "content": "3.",
    "id": "38ce6d57-a5db-46fd-b5fc-425dd2dacb2f"
  },
  {
    "content": "5.",
    "id": "951175ee-cd8e-44ed-9515-bc8cf29fa708"
  },
  {
    "content": "Sammy was relieved but he still felt scared and his body was still shivering with fear.",
    "id": "e2176139-b6e8-479f-9a84-c29db7312a80"
  },
  {
    "content": "Then, suddenly, the dependable rocket stopped.",
    "id": "5da97e42-5007-4dfc-bc7e-061baeabbc5c"
  },
  {
    "content": "He asked them to close their eyes and think of something, then he guessed.",
    "id": "becaab88-fc7f-46ad-9b5e-b03ec6e275e6"
  },
  {
    "content": "7.",
    "id": "185bcd19-5871-4ca1-973f-f8b6aa09c393"
  },
  {
    "content": "Setting Clear Policies\n\n**A.",
    "id": "5434464f-f856-4999-8c5f-bbf02e3bdf4c"
  },
  {
    "content": "### Step 2: Gather Inputs\n   - Use tools like surveys or expert panels to gain insights from both individuals and groups to inform the decision.",
    "id": "0f931ef0-da81-40c9-b9c5-1c1583dcaa12"
  },
  {
    "content": "He said, \"Let's ask the sun for help.\"",
    "id": "d84d73b9-d211-493f-99f4-a46cd9510e36"
  },
  {
    "content": "So after the third time, I called them back and politely asked for an exchange.",
    "id": "6bbd37dc-8897-45fa-a9f5-62b3d3643cce"
  },
  {
    "content": "From that day on, the bush became a famous spot for all of Hop-Hop's friends.",
    "id": "d9e160f0-af6d-4b92-9642-e9d3a66e1606"
  },
  {
    "content": "It is rare that I eat KFC.",
    "id": "51d6617d-2f0d-4505-a9c2-6debe2fd9737"
  },
  {
    "content": "and THANKFUL my experience today would have been perfect...",
    "id": "bb812df1-a120-459a-b1aa-ed2fd86e6c86"
  },
  {
    "content": "Mailbox rental at this location.",
    "id": "0440fa55-e082-437f-914d-7e514d22954f"
  },
  {
    "content": "I hope so.",
    "id": "185b0b6e-9e5d-4247-8489-6c1607b7ed5f"
  },
  {
    "content": "Six months ago I loved ordering from here but in the past two months I've had regularly over cooked dry pizza.",
    "id": "3335f58b-1a0b-4397-a90c-f008cb89840e"
  },
  {
    "content": "Their happy day was ruined by the town bully.",
    "id": "88afc175-c8bf-4ae4-a87a-de0889114240"
  },
  {
    "content": "**Definitions**\n   - **Individual Decision Making**: A process where a single person assesses a situation and makes a decision based on their judgment, experience, and reasoning.",
    "id": "b58584ec-396b-439a-a613-19257185e03e"
  },
  {
    "content": "The moral of the story is that it's important to listen to the advice of other people, even if it means not being quite as competitive.",
    "id": "4814f75a-5f16-478b-a214-a2116b8a67db"
  },
  {
    "content": "### Best Practices\n\n#### 1.",
    "id": "62e2a1c3-b378-4b6d-9dab-1f208db3a939"
  },
  {
    "content": "**Effective Global Leaders: Characteristics, Behaviors, and Development Strategies**\n\nGlobal leadership has become increasingly vital as organizations expand into international markets and seek to operate across diverse cultures and environments.",
    "id": "6af19065-44c8-4e6b-af7d-9523909a9b00"
  },
  {
    "content": "It posits that a government that issues its own currency (like the United States) can spend freely to achieve full employment and productive capacity utilization without the immediate need to balance budgets.",
    "id": "b62841e8-4d27-4673-b656-f48b14385778"
  },
  {
    "content": "i think they should definitely sick to singing and only watch this movie if you have nothing better to do (which sadly I didn't)",
    "id": "469ce13d-a282-40f6-97ce-a6fa38b9346e"
  },
  {
    "content": "MOTYS is a placental tissue particulate comprised of amnion, chorion and umbilical cord tissue from full-term, healthy births and is provided sterile in micronized form.",
    "id": "5ec08ee1-6f5f-43bb-aa18-fa752255f60a"
  },
  {
    "content": "Now I do miss cow meat and fried chicken (only).",
    "id": "0e7156b6-4cb0-4adb-a720-d6b8b64bd46d"
  },
  {
    "content": "Gross proceeds from the offering were approximately $195.8 million, before underwriting discounts and commissions and estimated offering expenses.",
    "id": "7b1a36e8-9f5e-428a-8fb8-f6ceb5b93c99"
  },
  {
    "content": "**Innovation and Diversification**\n   - **Product Lines:** Encourage the development of product lines that cater to lower-end markets, possibly through a separate brand or subsidiary that can operate with more flexibility.",
    "id": "d13eb0a0-e47c-4ef2-aa95-4c265d35aaae"
  },
  {
    "content": "So they moved the blocks and tried again.",
    "id": "4bc29f17-798d-4cf7-9cc1-7924ec7edd65"
  },
  {
    "content": "He p***es blood and punches through a wall, but who he is or what is wrong with him is neither explained nor even tied in to the story.<br /><br />There is no action, no special effects, no story.",
    "id": "f5e86e6a-c861-45c7-bd2d-58a90ec70580"
  },
  {
    "content": "Soon Molly wasn't nervous anymore.",
    "id": "b6af2e5a-87bb-428f-9f42-b4f416362a44"
  },
  {
    "content": "The company's revised consolidated annual outlook for 2022 is as follows cutting forward-year 2022 adjusted earnings-per-share.",
    "id": "3dcd4728-95b2-4188-94db-8accf409f0f5"
  },
  {
    "content": "The shirt was gone in a flash.",
    "id": "e50bc59f-3571-4f49-b8fa-6790d5d21c18"
  },
  {
    "content": "It looked like it was stranded!",
    "id": "d0429977-4021-45c6-83bf-3d88bdccb5a0"
  },
  {
    "content": "The brunch-style restaurant chain posted solid results this morning, but that's not the whole story.",
    "id": "ab8f1f3e-94c5-46a5-ad39-b5d2a99ba2cb"
  },
  {
    "content": "He carried one of his most favorite books with him, but he could not find it inside the library.",
    "id": "b37d2129-44f1-423a-938c-4e7e6f084b01"
  },
  {
    "content": "PROG Holdings, Inc. (PRG) CEO Steve Michaels on Q4 2020 Results - Earnings Call Transcript",
    "id": "65f29ac3-fe17-4eec-bbba-4d41d84ae53c"
  },
  {
    "content": "**Encouraging Time Off**: Encourage employees to take their allocated vacation days and offer a mandatory minimum vacation policy.",
    "id": "f6c0bfbe-b8f6-43df-9f5b-232688f14b99"
  },
  {
    "content": "<br /><br />This is crap that other crap won't even deign to be in company with because it's beneath them!",
    "id": "23372320-e910-40be-b34d-bedc0df8a779"
  },
  {
    "content": "at Coastal Carolina Research Center, South Carolina.",
    "id": "a0d22886-1377-4112-b7ed-7cebbd865c1d"
  },
  {
    "content": "Let's just start off by saying I only get my scripts filled here because they are close to my house.",
    "id": "cd7daa54-a823-4a1c-97cb-6d327b0073b5"
  },
  {
    "content": "It wanted to find a way home.",
    "id": "677825fe-259f-4868-91f0-12057f293fd6"
  },
  {
    "content": "The bird handed her a magical seed.",
    "id": "bee37bdf-13dc-441d-8aef-d120ce035879"
  },
  {
    "content": "Kudos to the patience of Paul Muni, who spent hours and hours in the makeup room each day to look the part of Zola.",
    "id": "266c18f6-d0f2-4603-a7bb-3c7d662d6fc6"
  }
]