[
  {
    "content": "Alamos announced bonanza gold grades at the Island Gold Mine.",
    "id": "8b6bb86d-f58d-480b-99af-38d007651e4f"
  },
  {
    "content": "He was so proud that he had managed to do it.",
    "id": "d4d02ea0-d660-41b5-93e1-cee24377aa1c"
  },
  {
    "content": "Figure 1: Island Gold Mine Longitudinal Figure 1: Island Gold Mine Longitudinal Figure 2: Island Gold Mine Longitudinal Main and East Areas - Surface Directional Drilling Results Figure 2: Island Gold Mine Longitudinal Main and East Areas - Surface Directional Drilling Results Figure 3: Island Gold Mine Longitudinal Main and East Areas - Underground Exploration Drilling Results Figure 3: Island Gold Mine Longitudinal Main and East Areas - Underground Exploration Drilling Results Figure 4: Island Gold Mine Cross Section - Main and East Areas Figure 4: Island Gold Mine Cross Section - Main and East AreasTORONTO, July 13, 2020 (GLOBE NEWSWIRE) -- Alamos Gold Inc. (TSX:AGI; NYSE:AGI) (“Alamos” or the “Company”) today reported new results from surface and underground exploration drilling at the Island Gold Mine, further extending high-grade gold mineralization in all three areas of focus.",
    "id": "dc4e06fd-636b-4f38-ab1f-ea6b47dbc41a"
  },
  {
    "content": "She shouts out \"Joe!\"",
    "id": "02afce5c-a65d-4bb8-ad39-994b8530362a"
  },
  {
    "content": "You can find articles about an individual hedge fund's trades on numerous financial […]",
    "id": "c5568a92-bbdc-4f2a-a9bd-e21506911afd"
  },
  {
    "content": "You should enter the balance competition next week.\"",
    "id": "507714e2-5be9-474c-bfca-8080f9c75a69"
  },
  {
    "content": "Opt out of the quest for riches & you'll find true happiness and inner peace.",
    "id": "738c3796-8d00-487e-8b84-f18344d5a22e"
  },
  {
    "content": "- Ensure these values are communicated and visible throughout the organization.",
    "id": "7ffbf2e4-1bb0-4308-a182-4ba00ffea72b"
  },
  {
    "content": "It manifests through various forms such as authority, expertise, personal influence, and the ability to mobilize others.",
    "id": "9f38f027-c9bb-42d7-adca-7144fb61854b"
  },
  {
    "content": "He was three years old and he loved going to the park.",
    "id": "ade62f9b-5ab3-457b-a85b-0dcc131f5e83"
  },
  {
    "content": "This made Jack sad, so he decided to go on a journey.",
    "id": "842c3cbc-0acc-4e0c-90a5-0e94bf840f5b"
  },
  {
    "content": "Is Starbucks losing consistency?",
    "id": "1c02c7e8-5c54-44c8-b295-78bdf49d21b9"
  },
  {
    "content": "#### 6.",
    "id": "78113d10-53c2-4dd0-bb66-2530f6609792"
  },
  {
    "content": "I placed a rather large order online for a work lunch over the weekend and went to pick it up at the set time.",
    "id": "7508e92b-0516-487d-8a3e-03cb5fc12b03"
  },
  {
    "content": "Several people thought they were joking but there security guard literally followed one person out.",
    "id": "450d0b88-b05a-401b-90ca-5983cc3b7a2b"
  },
  {
    "content": "There are no working telephones inside Hill House and the nearest town is several miles away.",
    "id": "61dd947f-4b9d-4f65-8cc9-c500edac108d"
  },
  {
    "content": "this is the best McDonalds around.",
    "id": "1c3ed67e-e81a-4e77-a974-e70951bdeacc"
  },
  {
    "content": "He lived in the woods on a bright, sunny day.",
    "id": "8e1fbc80-663c-4898-bd36-e41c9ce486c7"
  },
  {
    "content": "But soon the sun was rising and it was time for the bear to get up.",
    "id": "f7b7ccd3-827c-4d48-bea9-40d873851371"
  },
  {
    "content": "Common KPIs might include employee retention rates, productivity metrics, or engagement scores.",
    "id": "7546ec78-8965-483a-9d8b-3920322a2baa"
  },
  {
    "content": "This may involve businesses providing funding or resources in exchange for visibility and engagement.",
    "id": "34e2bf5b-03f9-4462-8dd2-19e550174d8e"
  },
  {
    "content": "One day he went on a walk and found something strange.",
    "id": "37d550c0-9efa-43d0-a65c-5ecc3988d58f"
  },
  {
    "content": "My name is Daniel and I will be your operator for today.",
    "id": "7322d303-b34a-4666-8b09-cc53bdb36455"
  },
  {
    "content": "It was bright red and made of metal.",
    "id": "2485ba04-40e9-4c78-a586-ee56988447e3"
  },
  {
    "content": "Alamos Gold Inc. (AGI) CEO John McCluskey on Q4 2020 Results - Earnings Call Transcript",
    "id": "e0acd897-90c8-4b0b-bc4b-ad774b660c9c"
  },
  {
    "content": "The acting seems to become somewhat wooden as the film goes on, with Owen Wilson's character being particularly irritating (so it's such a relief when he's decapitated by the flue).<br /><br />The special effects practically make this movie,, which is a shame, because most of them are incredibly cheesy and look very dated.",
    "id": "b8e03a7d-ad2b-4584-9e3b-9b195f4ea684"
  },
  {
    "content": "<br /><br />For some reason, they decide they have to kill the kids and the teacher (Dolph Lundgren) even though when the villains take over the school nobody is remotely aware of it because it is after school hours.",
    "id": "843ab7b0-d4a0-4055-8dfa-9cff1bdeff04"
  },
  {
    "content": "The interview was filmed before the movie was released.",
    "id": "8dca469d-6745-4392-82b6-0de3fd3c9f9c"
  },
  {
    "content": "Everything I had was good.",
    "id": "27419c19-75df-4658-8e48-5c3ae380f9e2"
  },
  {
    "content": "### II.",
    "id": "833fbb8d-1f6c-48ae-b9ca-87cb677e469e"
  },
  {
    "content": "6.",
    "id": "8ece157e-235b-434d-b440-a9c72cee64df"
  },
  {
    "content": "He loved to chase butterflies and find new things to explore.",
    "id": "21ade20b-a405-41b3-b52f-bad238d96a4b"
  },
  {
    "content": "Uniti continues to disappoint investors, and returns have been extremely poor since the spin-off.",
    "id": "c1c8416e-8422-40ed-b4c5-8d541adc0b16"
  },
  {
    "content": "Always have a good delivery experience from this location.",
    "id": "3dff55dd-9d39-4992-a5e9-aa64d28f3b59"
  },
  {
    "content": "This is a review of the Starbucks kiosk located inside Giant Supermarket at the Wynnewood Shopping Center.",
    "id": "f0efee83-4c6c-4345-9d41-f11e6c4abb82"
  },
  {
    "content": "**Risk Analysis and Management**\n   - **Identify Risks**: Potential risks include workforce attrition, skills mismatch, operational disruptions, among others.",
    "id": "6cdcee79-bd53-4683-bfc4-54ba017d52ca"
  },
  {
    "content": "Do the numbers hold clues to what lies ahead for the stock?",
    "id": "2b24af0b-fbf2-492f-8044-0266f4b01b41"
  },
  {
    "content": "Spot loved to explore the ground and play with his friends.",
    "id": "206aa83c-fb89-4c07-b89f-43fba7d86adb"
  },
  {
    "content": "Uniti Group Inc.'s new fiber business does not reach the hurdle rate yet.",
    "id": "f577adc4-0e58-4652-8adf-a6afaa25f478"
  },
  {
    "content": "TORONTO, Jan. 20, 2021 (GLOBE NEWSWIRE) -- Alamos Gold Inc. (TSX:AGI; NYSE:AGI) (“Alamos” or the “Company”) plans to release its fourth quarter and year-end 2020 financial results after market close on Wednesday, February 24, 2021.",
    "id": "d8ecb1a0-8a41-487e-a8d2-7bc5364870de"
  },
  {
    "content": "### 4.",
    "id": "e548f914-5e8d-4c38-a8bd-c312766a5963"
  },
  {
    "content": "- **Actionable Steps:**\n  - Managers typically focus on metrics and deliverable outputs rather than communicating vision.",
    "id": "81036a50-69ac-4215-a5af-4b074e515205"
  },
  {
    "content": "LITTLE ROCK, Ark., Sept. 07, 2022 (GLOBE NEWSWIRE) -- Uniti Group Inc. (“Uniti”) (Nasdaq: UNIT) announced today that its Senior Vice President, Chief Financial Officer and Treasurer, Paul Bullington, and Vice President, Finance and Investor Relations, Bill DiTullio, are scheduled to participate at the Deutsche Bank 30th Annual Leveraged Finance Conference.",
    "id": "efe0b214-d09a-4e4e-a9bd-812df87e0543"
  },
  {
    "content": "3.",
    "id": "10623bac-9bed-4fd9-b83e-319fe2edf2a7"
  },
  {
    "content": "It's like they cut our benefits!",
    "id": "e9af7d2f-320e-4c21-8c48-4040af69ee63"
  },
  {
    "content": "La Yaqui Grade Project HighlightsLife of Mine1  Production    Mine life (years)5      Total gold production (000 ounces)616  Total silver production (000 ounces)1,471      Average annual gold production (000 ounces)123      Total ore mined (000 tonnes)19,205      Average tonnes of ore mined & stacked (tonnes per day (“tpd”))10,000      Average gold grade (grams per tonne)1.17      Gold recovery (%)85%  Silver recovery (%)15%      Waste-to-ore ratio (Life of Mine including pre-strip)5.50  Waste-to-ore ratio (post pre-strip)4.04      Operating Costs    Mining costs per tonne of material (life of mine, including pre-stripping)$2.42  Processing costs per tonne of ore$5.05      G&A costs per tonne of ore$2.34      Total cash cost (per ounce sold)2$539  Mine-site all-in sustaining cost (per ounce sold)2$578      Capital Costs (millions) 1   Initial capital expenditure3$137  Sustaining capital expenditure$24  Reclamation$35  Total capital expenditure, including reclamation$196      Base Case Economic Analysis1   IRR (after-tax)41%      NPV @ 0% discount rate (millions, after-tax)$226  NPV @ 5% discount rate (millions, after-tax)$165      Gold & silver price assumption (average, per ounce sold)$1,450 / $18  Exchange Rate (Mexican Peso/US Dollar)21      Economic Analysis at $1,750 per ounce Gold Price1   IRR (after-tax)58%      NPV @ 0% discount rate (millions, after-tax)$345  NPV @ 5% discount rate (millions, after-tax)$260      Gold & silver price assumption (average, per ounce sold)$1,750 / $18  Exchange Rate (Mexican Peso/US Dollar)21          1.",
    "id": "721a2220-9747-485f-97ac-fa9f2c03ad5b"
  },
  {
    "content": "TORONTO, June 03, 2021 (GLOBE NEWSWIRE) -- Alamos Gold Inc. (TSX:AGI; NYSE:AGI) (“Alamos” or the “Company”) has released its 2020 Environmental, Social, and Corporate Governance (ESG) Report (“ESG Report”), which outlines the Company's progress on its ESG performance in 2020 across its operations, projects and offices, and provides direction on planned initiatives for 2021.",
    "id": "0022a51d-e542-4c84-8e75-c0b427ef9077"
  },
  {
    "content": "Tommy's face lit up.",
    "id": "95ff03c5-5142-42d5-ab3a-d9b2383aa824"
  },
  {
    "content": "\"A Chorus Line\" takes place on stage in a theatre with no real sets and limited costume changes.",
    "id": "f190bf12-c63b-4131-ac44-d8d4ee301394"
  },
  {
    "content": "### II.",
    "id": "95d7f908-441b-46ef-b569-6a3c16d3fa7c"
  },
  {
    "content": "Despite having my order repeated back to me several times, the cajun rice I ordered was replaced with cajun fries, which were cold, limp and flavorless.",
    "id": "747c4284-d74c-41b5-9d05-c65c27b1b327"
  },
  {
    "content": "by Sydney J Furie, a really good director who made films like The Boys in Company C. Has his ability failed him, or was this hopeless from the get go and he didn't even bother?",
    "id": "81b58611-b3bc-4305-8b2a-684559cfcf51"
  },
  {
    "content": "6.",
    "id": "b057ad9e-1379-4ff0-9721-467314f1f0e5"
  },
  {
    "content": "**Feedback Loops**\n   - **Conduct Surveys and Focus Groups**: Utilize periodic surveys to gauge employee sentiment regarding the transition, gather qualitative feedback, and reveal areas of concern.",
    "id": "f305b0c7-2292-45a6-9b48-6c1ec49335f5"
  },
  {
    "content": "**5.2.",
    "id": "6d6b99a9-24c3-40ef-bd3d-7557afaba69e"
  },
  {
    "content": "It's a shame when you ask for ketchup and they hand you one packet of ketchup.",
    "id": "70b92125-cd27-4ec2-a4a2-c2d0906bdff2"
  },
  {
    "content": "- Introduce 5 new health-focused product lines within 18 months.",
    "id": "5251e4fa-d71d-4f90-9db0-e0f34b209c15"
  },
  {
    "content": "The bossy child chased after the first child, but the first child was faster.",
    "id": "6a99c194-45ff-4301-829b-cf644755e5a0"
  },
  {
    "content": "The \"breakdown\" scene alone will have you giggling, and after seeing the climatic \"I'm not the only one who had to **** her way to the top\" scene at the \"Awards\" (all done in the usual bargain-basement acting level we expect from such quality thespians as Pia), I sincerely hope that our dear Pia actually reused that speech when she \"won\" her Golden Globe.",
    "id": "0ef6ea5d-5a44-49ac-aa67-fa6189562778"
  },
  {
    "content": "New highlights include:    •  52.10 g/t Au (22.54 g/t cut) over 10.31 m (840-566-01);   •  21.01 g/t Au (21.01 g/t cut) over 4.26 m (840-566-06); and  •  31.19 g/t Au (31.19 g/t cut) over 2.22 m (840-572-02).",
    "id": "f28239f3-0f23-483c-9da3-c2c69c838d0e"
  },
  {
    "content": "Research-based stock selection guides our investment approach, with our strategies reflecting the highest-conviction ideas of our portfolio managers.",
    "id": "a45f3497-07dd-497e-a441-dda710041a11"
  },
  {
    "content": "(And not even then) But, there were things in this movie that were never by any means ever mentioned or even hinted at, in the movie.",
    "id": "5e6405a3-64a8-49da-a377-73c9e77cd3ba"
  },
  {
    "content": "I don't think he changes expression once during the entire film.<br /><br />(SPOILERS AHEAD)<br /><br />The reason the first movie worked so well is because we were never sure whether the house was truly haunted or whether the manifestations were a result of Eleanor's precarious mental state.",
    "id": "6fd7dce8-3c74-44ce-986e-5425271ec87e"
  },
  {
    "content": "Anyone who complains that there isnt enough fries or even orders the large is out of their mind.",
    "id": "7569d584-9a7d-48b5-99be-420cbdf1d633"
  },
  {
    "content": "Shares of gold and silver miners took off today as market uncertainty has investors looking for safe-haven investments.",
    "id": "844b73b6-740e-47d5-8996-ee94350efef8"
  },
  {
    "content": "Why would anyone in his or her right mind ask an epic director to direct a musical that takes place in a fairly constricted place?<br /><br />Which brings us to the next problem.",
    "id": "0d0d3e76-9932-4388-b1eb-87c267321f0c"
  },
  {
    "content": "), it took 15 full minutes before I realized that what I was seeing was the feature, not a sick joke!",
    "id": "ccdfa7eb-8a45-4ed7-84e9-9ac6fd9bcc31"
  },
  {
    "content": "The guy who took our money wasn't clear for us or the people before us about whether we had to sign the receipt, so we had to ask to make sure we were all set to go.",
    "id": "0751676b-c036-4651-84f6-077c9488f0da"
  },
  {
    "content": "3.",
    "id": "75f7716c-33a1-4d74-b516-ac6fe77e5f0c"
  },
  {
    "content": "Ethical leadership is crucial for maintaining trust, employee morale, and organizational reputation.",
    "id": "fc971879-6e93-4909-862d-f766a6c79735"
  },
  {
    "content": "### Key Differences Between Bounded Rationality Model and Rational Decision-Making Model\n\nIn the realm of decision-making theories, the rational decision-making model and the bounded rationality model serve as two contrasting frameworks that explain how individuals and organizations make choices.",
    "id": "ed0ce651-bc48-4b7d-99c7-e917c9b44b03"
  },
  {
    "content": "### 2.",
    "id": "4a5ae0f1-3318-42ba-8c17-1a0072ac9ee2"
  },
  {
    "content": "From a technical perspective, a correction in major market averages is likely approaching.",
    "id": "84b8fc3d-30d0-463f-a65c-ecfe17d4a5ec"
  },
  {
    "content": "Fortunately, both staff and customers seemed to be in good spirits and the long wait was made more pleasurable by generally friendly people.",
    "id": "7b793aba-9629-411a-bdda-eb46adf59599"
  },
  {
    "content": "So Jenny and her mother went around to all the gardens and picked some of the flowers.",
    "id": "aa45f598-f047-48b4-ae94-fb228c26d8c3"
  },
  {
    "content": "Mr. Fitzgerald will lead all engineering, procurement and construction activities for the Company's development projects.",
    "id": "fee93ac7-fa50-465e-af11-f7b48ddda72c"
  },
  {
    "content": "He was so brave and strong!",
    "id": "29a33875-0e0d-463d-bb7d-a8457e8f8a15"
  },
  {
    "content": "Are outflows increasing, stagnating, or decreasing, and what does this trend signal to investors and analysts?",
    "id": "7ea1c14c-0bd4-4fc5-875e-bbb406ce60bb"
  },
  {
    "content": "When I saw the movie I figured maybe Lundgren had done it as some kind of charity work for some film school where he is the teacher.",
    "id": "b31523f8-9c41-44e7-8740-debabaa3f653"
  },
  {
    "content": "Great service.",
    "id": "86999270-ccb1-4fd6-8b34-0d4987ba4488"
  },
  {
    "content": "She was scared and sad, so she shut the door to her bedroom and stayed inside.",
    "id": "ed532029-75db-4ffe-926c-44f65e5aeb99"
  },
  {
    "content": "When Grandma answered the telephone, she and Therese had a plan.",
    "id": "374f4303-75d1-4630-b535-ef9e5c16b049"
  },
  {
    "content": "It's really a disgrace.",
    "id": "2c9da0af-f82f-40e4-81ff-63f9d268abb2"
  },
  {
    "content": "Tight drive through..be careful not to scrape your vehicle.",
    "id": "e09f4cd2-aede-4175-85f9-49cbb67c91ed"
  },
  {
    "content": "The little girl was scared, but also excited.",
    "id": "f36b03ea-4de7-4a55-8769-40028c7723e8"
  },
  {
    "content": "This includes the addition of nearly one million ounces of Mineral Reserves and Resources through our 2019 exploration program to now total 3.7 million ounces.",
    "id": "f6f93ac0-e139-4b6d-9fde-54e6ba8791e4"
  },
  {
    "content": "It was a test to watch it, but I passed.",
    "id": "72ffedc6-b18f-43d7-952e-64f26c679076"
  },
  {
    "content": "Owen Wilson truly turns in one of the worst performances in recent horror-movie history.",
    "id": "b1a53160-6563-4025-85c3-0d723f20fcef"
  },
  {
    "content": "This continues to confirm the E1E Zone extends vertically over 1.2 km, between a depth of 300 m and 1,500 m in the eastern part of the deposit.Island East UpperUnderground exploration drilling is being conducted from the 620 level exploration drift.",
    "id": "64c38ade-cba6-4e6a-b390-c629891b1c70"
  },
  {
    "content": "So if you're missing your mail on Georges Lane in Philly, its probably here on 66th and Malvern avenue.",
    "id": "589ec25e-b440-46b1-a61c-80cfa2dc6105"
  },
  {
    "content": "When you buy shares in a company, it's worth keeping in mind the possibility that it could fail, and you could lose...",
    "id": "c6f996ed-7a6c-48b5-b06c-63f86efce037"
  },
  {
    "content": "The presentation is scheduled for 8:50 AM EST on November 30, 2022 in Boca Raton, FL.",
    "id": "f5fb11bb-d1f1-437d-9016-36f5f5722bbb"
  },
  {
    "content": "In addition to myself, we have on the line today both John McCluskey, President and CEO; and Peter MacPhail, COO.",
    "id": "88757032-cc8e-4057-b832-6bb03aedc97f"
  },
  {
    "content": "**4.",
    "id": "0e532ec9-b0df-41ee-8b2c-5e2768166304"
  },
  {
    "content": "Additionally, the project hosts Measured and Indicated Mineral Resources which total 1.3 Mt, grading 1.01 g/t Au and 8.0 g/t Ag, containing 43,000 ounces of gold and 340,000 ounces of silver.",
    "id": "98d634a7-6866-4e48-afa4-a6fbe04ced1b"
  },
  {
    "content": "Denise Crosby, particularly, delivers her lines like she's cold reading them off a cue card.",
    "id": "427d1da4-f4e5-410a-ae98-d6062eaf65d4"
  },
  {
    "content": "**Cultivate Human Capital:** Foster a culture of continuous learning and skill development among employees to enhance the company’s intellectual capital.",
    "id": "ee192ff6-36e7-4d0f-ba84-5f4d0660cd2a"
  },
  {
    "content": "We actually get some satisfaction in this scene, as seconds after his attack, Blond Guy is dragged over to the fireplace by the ghost of the old guy and promptly gets his head cut off by the flue.",
    "id": "390123d6-7cf6-4379-9711-631b60b39b59"
  },
  {
    "content": "Rationale for Emphasizing Collective Results\n\n**1.1 Enhanced Collaboration and Trust**\n- **Explanation**: When teams prioritize collective results, members are encouraged to collaborate, share knowledge, and support each other, fostering trust.",
    "id": "ec80c84a-c155-42d0-8513-4df0761b6e64"
  },
  {
    "content": "Fireplace was beautiful.",
    "id": "f50b5ac3-5f34-4a24-9450-90153dbda7e8"
  }
]