[
  {
    "content": "DALLAS, Sept. 23, 2021 (GLOBE NEWSWIRE) -- Texas Capital Bancshares, Inc. (NASDAQ: TCBI), the parent company of Texas Capital Bank (“the Bank”), today announced that Anna M. Alvarado has been appointed Executive Vice President, Chief Legal Officer and Corporate Secretary, effective October 15, 2021.",
    "id": "350f90dd-6e60-41ec-a01f-8691fc0d764d"
  },
  {
    "content": "Timmy laughed and reached out his hand.",
    "id": "68c0b098-16d5-43ff-81b3-752b4f5159e7"
  },
  {
    "content": "But I admired the film's vision of a complex, corrupt, and highly stratified society, and I was so pleased to see that Edward G. Robinson had such a moving, funny final role.",
    "id": "c742bd53-c626-4d8c-ad19-995f018c4ea1"
  },
  {
    "content": "This is an underrated, and excellent sci-fi flick, and recommended for anyone who wants a second visit to the universe of Blade Runner--David Webb Peoples wrote both screenplays.",
    "id": "eaadcf9e-7f84-43e4-91df-6c2cf373bb51"
  },
  {
    "content": "The dividend will be paid on or about April 26, 2021 to stockholders of record as of the close of business on April 12, 2021.",
    "id": "d5248484-80b0-44fe-9212-9c30d46eed22"
  },
  {
    "content": "Stopped here on the way back to Orlando to grab a drink and use the restroom after a Buccaneers game.",
    "id": "53dca1c1-2dea-4430-9e91-d194db24a7ae"
  },
  {
    "content": "Kurt Russel did what I though was a remarkable role in showing the emotionless soldier that he was.",
    "id": "061f87e8-7488-4e60-bc16-c7637163a371"
  },
  {
    "content": "**Regular Check-Ins**\n   - **Scheduled Meetings:** Establish weekly or biweekly team meetings to discuss updates and address concerns.",
    "id": "0b670ea1-166b-4af0-8234-a0c4615ed691"
  },
  {
    "content": "Interest rates are set to go parabolic in the coming months as the Federal Reserve moves to lower inflation.",
    "id": "d987b058-b8e5-45e8-ba0e-0d4078551c49"
  },
  {
    "content": "There were maybe 4 people in the store and EVERY table was dirty with dishes and hadn't been cleaned.",
    "id": "f843756c-77b3-490e-979b-3ec44970e919"
  },
  {
    "content": "I found the batter soggy on a lot of the chicken and incredibly salty.",
    "id": "2eaa8730-9f19-494c-bd5b-57aebaa246e6"
  },
  {
    "content": "#Starbucks continually pushes using the app, but there systems have been down at this location for a week now.",
    "id": "207e5564-c25a-4c68-aa10-e3503e56ddad"
  },
  {
    "content": "It is a comedy with a capital C and a brilliant satire on trailer park living and small time crooks with small time ideas but big time dreams.",
    "id": "8bf96989-697c-4e0d-b2b1-2096fa0833b9"
  },
  {
    "content": "The Dow Jones Industrial Average (DJIA) reached a record high of 381.17 in September 1929, driven by speculative investments and a booming economy.",
    "id": "a1ca694c-980c-4025-a21f-aeed5a58ff7d"
  },
  {
    "content": "Jimmy is a banking veteran and currently serves as President of Community Bank of the Chesapeake.",
    "id": "635c0716-0ec2-4a0d-9700-be0059a50bcc"
  },
  {
    "content": "With minimal special effects, it manages to be a psychological study of sorts, with a simple yet existential theme - who gets hit by the bus, and why her?",
    "id": "a2e2a17c-0fbc-4ab8-b14c-7cb010e19d0a"
  },
  {
    "content": "Understanding Effective Leadership\n\nEffective leadership encompasses a range of behaviors and abilities that inspire, influence, and guide individuals and teams toward goal attainment.",
    "id": "79d91a87-1657-4c69-a598-8b9d1d7bc97c"
  },
  {
    "content": "Texas Capital Bancshares, Inc. is still on its way to a strategic transformation.",
    "id": "20ab70f6-9b4b-4ef1-a608-1e4c6a8550c5"
  },
  {
    "content": "Wouldn't come back.",
    "id": "114568b3-92b5-4303-8e5e-39f7a5c44d59"
  },
  {
    "content": "An increase in revenue and higher rates support Texas Capital's (TCBI) Q4 earnings.",
    "id": "3db29567-1230-4e50-9f4a-8014da7efedb"
  },
  {
    "content": "Management is making good decisions to shift toward a relationship-based model, and building up service offerings like treasury and investment banking should support stickier, deeper customer relationships.",
    "id": "ce3e4c12-2e80-4f7e-82fa-c22504bf5a19"
  },
  {
    "content": "Texas Capital's (TCBI) strategic plan to expand its product offerings and digitalize operations will likely boost financials.",
    "id": "1890f5d3-7d8b-477c-bf71-e5ebd1272f3c"
  },
  {
    "content": "- Recognize and reward both individual and team accomplishments.",
    "id": "f52de19f-833b-45b8-a0fb-f26e4fdb18d9"
  },
  {
    "content": "Top Ranked Value Stocks to Buy for June 10th",
    "id": "d6fccc91-b4df-4b3f-b633-0a793f3aba07"
  },
  {
    "content": "And even when she does appear, she is often filmed from behind, her voice calling out to her husband, whose voice calls out to her in conversation.",
    "id": "a9987326-948f-4b84-bab7-88d09f196388"
  },
  {
    "content": "I loved it!",
    "id": "3482e15a-71be-42de-9ead-f4776febfa34"
  },
  {
    "content": "I'm a big fan of Starbucks breakfast sandwiches when I'm on the go, and this was as good as those, maybe a bit better and fresher tasting.",
    "id": "571ea6c0-0e5f-4d51-8e17-6eed8cfb40ec"
  },
  {
    "content": "When Mama felt strong enough, she got up and took a few steps on the rug.",
    "id": "81e83704-c24e-42fa-b75c-1d89a09b2c26"
  },
  {
    "content": "The little duck opened the gate and discovered a beautiful garden.",
    "id": "6a0cbab0-7d1d-4db6-a49b-da8f1f692ef8"
  },
  {
    "content": "The cone felt special and filled with joy.",
    "id": "07fd5762-3bad-47f9-8398-0803b5364de9"
  },
  {
    "content": "But one day she felt very helpless, because she had forgotten her mommy's birthday!",
    "id": "2eb7cfa1-3f99-46e9-9b41-dc55314305d8"
  },
  {
    "content": "Robert Acosta, Paul Rieckhoff, Sean Huze, and Herold Noel, all veterans of the war in Iraq and featured in the film, were present.",
    "id": "c1d374ab-ef1c-4c88-be49-2aa464cc7f24"
  },
  {
    "content": "They are proud to be part of the team and are likely to invest more effort in contributing to team goals.",
    "id": "e2fcbccb-604c-43b3-93f8-cbbdc6fa5206"
  },
  {
    "content": "By implementing a strategic framework focused on assessment, policy development, training, and ongoing review, organizations can cultivate an environment that prioritizes their employees’ wellness, ultimately leading to increased productivity, reduced turnover, and greater overall satisfaction among staff.",
    "id": "537c3480-213d-499b-9a45-541347fcb101"
  },
  {
    "content": "**Agile Improvement Processes**\n   - **Implement PDCA Cycle (Plan-Do-Check-Act)**: Utilize iterative processes to promote continuous improvement, ensuring that feedback leads to actionable steps.",
    "id": "eeebf338-4d94-4441-b468-dad18ec70260"
  },
  {
    "content": "Damn should of checked it before I left with it to go.",
    "id": "6c5f95a6-b624-421c-9f2c-2730fea4beb1"
  },
  {
    "content": "Texas Capital (TCBI) reported earnings 30 days ago.",
    "id": "3eb883d8-d3ff-4ae8-b438-97e8d59cda74"
  },
  {
    "content": "I won't waste your time and please do not waste mind.",
    "id": "048401c5-22fb-4dfb-bf59-919f0ebda855"
  },
  {
    "content": "It had big antlers and was looking right at her!",
    "id": "b07d5911-52dc-4fdd-a527-06b30681ef1c"
  },
  {
    "content": "DALLAS, June 21, 2021 (GLOBE NEWSWIRE) -- Texas Capital Bank, N.A., and its parent company Texas Capital Bancshares, Inc. (NASDAQ: TCBI), collectively referred to herein as “Texas Capital Bank,” today announced that it has committed $100,000 as part of its partnership with the Texas Bankers Association to support the Future Bankers Leadership Program (FBLP) at Texas Southern University.",
    "id": "f1c73169-11b8-45f9-a6e8-a456c657f629"
  },
  {
    "content": "Decreases in charge-offs, recapture of provisions and declining costs drive Texas Capital's (TCBI) Q2 earnings.",
    "id": "c5f602e3-2bee-4098-a228-092ca4958087"
  },
  {
    "content": "- Fosters resilience by allowing teams to learn from failures.",
    "id": "0ffaf324-1270-4641-8b11-d24dced77312"
  },
  {
    "content": "When the daily rushes showed Boyer's face had burned a bright tomato red, producer David O. Selznick finally gave in.",
    "id": "d4286e85-a5ed-4903-a2ec-faed1be5ba5d"
  },
  {
    "content": "Everyone cheered when they saw how good the stars were.",
    "id": "b49574fd-cfff-4eb0-be2b-98ed8177e127"
  },
  {
    "content": "How once in action soldiers don't care what they are ordered to do, as they are ingrained with the idea that as soon as they carry out an order, whatever it may be, they are one step closer to going home.",
    "id": "3c69ee39-f5b1-40e9-91ac-4069b21b1400"
  },
  {
    "content": "DALLAS, July 26, 2021 (GLOBE NEWSWIRE) -- Texas Capital Bancshares, Inc. (NASDAQ: TCBI), the parent company of Texas Capital Bank, and its board of directors declared a cash dividend of $14.375 per share of the 5.75% Fixed Rate Non-Cumulative Perpetual Preferred Stock, Series B (the “Series B Preferred Stock”), equivalent to $0.359375 per depositary share, each representing a 1/40th interest in a share of the Series B Preferred Stock.",
    "id": "015ebbe1-413f-4963-aefb-8140f60e1ebc"
  },
  {
    "content": "I will not be going to this McDonald's again.",
    "id": "dfd4769e-e738-481e-8bd3-76c4b88a6feb"
  },
  {
    "content": "DALLAS, July 08, 2021 (GLOBE NEWSWIRE) -- Texas Capital Bancshares, Inc. (NASDAQ: TCBI), the parent company of Texas Capital Bank, announced today that executive management will host a conference call and webcast to discuss second quarter 2021 operating results on Wednesday, July 21, 2021 at 4:30 p.m. EDT.",
    "id": "dc80aca2-8ea1-4a18-9200-9f7a9704fb4f"
  },
  {
    "content": "- **Role**: This team is responsible for coordinating all crisis activities, ensuring communication and strategic alignment.",
    "id": "db54931a-879f-452c-8d8a-5e053e2c9c7b"
  },
  {
    "content": "This could include regular surveys, performance reviews, or a digital feedback platform.",
    "id": "c1f2b58d-69e6-4866-9fbd-25be4e0f2758"
  },
  {
    "content": "I should have taken it back but thought it was just one large piece but it was that way till the end.",
    "id": "d682aae8-4fc7-4683-9547-041e326feac0"
  },
  {
    "content": "4.",
    "id": "a94bba68-dc95-4624-ab5c-23944c6498a9"
  },
  {
    "content": "Texas Capital Bancshares (NASDAQ:TCBI) is set to give its latest quarterly earnings report on Wednesday, 2021-10-20.",
    "id": "e4abaa48-f219-4cc8-9562-1b857dd40185"
  },
  {
    "content": "Why they think it's sooooo bad etc.",
    "id": "b54853bf-24de-48e6-bcb1-ab1aaf54999f"
  },
  {
    "content": "Get the app & order through it for great deals.",
    "id": "dd19cebd-a364-4d67-b860-9ab750ea6d45"
  },
  {
    "content": "Coffee wasn't correct, frappucino wasn't correct, ah well.",
    "id": "8d680b29-b3eb-4aae-a26a-27c3ac2e8878"
  },
  {
    "content": "- **Loyalty Programs**: Introduce incentive programs for loyal customers that include special offers, discounts, or free services for those affected.",
    "id": "65d5e271-6106-4a5b-8817-1be879cc840e"
  },
  {
    "content": "This store goes through its pains of staffing and sometimes does not always read notes in full.",
    "id": "8be1c7da-6d45-436d-85e0-f48107f1f988"
  },
  {
    "content": "These vets vividly describe the physical and mental pain and torment that most veterans experience and that ordinary people need to understand because the horrors of ALL wars are so traumatic and disturbing.",
    "id": "e70ae5fe-1d28-4721-a93d-1507990fa00f"
  },
  {
    "content": "Little Wings knew it would always remember the great wings that had taken it on its first adventure.",
    "id": "3a0c3fcf-fbbb-4e11-beda-7c9a1da357e2"
  },
  {
    "content": "It followed it around, flying close by to show that it wanted to be friends.",
    "id": "9754d358-0797-48ae-936b-deed84cfc7ec"
  },
  {
    "content": "Quarterly Results Earnings per share decreased 4.32% year over year to $1.33, which beat the estimate of $1.10.",
    "id": "4f803717-038a-4317-bc61-0b93bab2b4bd"
  },
  {
    "content": "How does one not cool a hotdog faster or at equivalent time to two all beef patties?",
    "id": "cf546b91-5ef9-436f-a619-82320f0e7c77"
  },
  {
    "content": "The polluted air outside looks disgusting and very nasty.",
    "id": "919ebfc1-a11a-4951-80ba-3e0dec39a05b"
  },
  {
    "content": "4.",
    "id": "3deeef13-1091-40be-a593-959196f761fb"
  },
  {
    "content": "Now that he has died she is free--but doesn't know what she wants.",
    "id": "d15138c4-f2b1-442f-8d26-e7d87f28ef83"
  },
  {
    "content": "Interest on these Notes will accrue at a rate equal to (i) 4.000% per annum from the original issue date to, but excluding, May 6, 2026, the reset date, and (ii) a fixed rate per annum equal to the five-year U.S. Treasury rate as of the reset date, plus 3.150% per annum, from the reset date, to and including, May 6, 2031.",
    "id": "1edae155-1ff7-41e5-bb65-ac1954afd240"
  },
  {
    "content": "In terms of visual beauty this movie is outstanding!",
    "id": "a84cb60b-a2ff-4bae-88ea-2667ef838d9d"
  },
  {
    "content": "If you focus on that, you'll end up with (as others have noted) a bad \"Aliens\" clone.",
    "id": "854c8707-10f7-4066-889b-808f929ddb1c"
  },
  {
    "content": "Thank you for attending today's TCBI Q1 2022 Earnings Call.",
    "id": "5d148d83-28aa-4a17-93eb-27d14283e9bc"
  },
  {
    "content": "She wanted to run away, but the monster was too quick.",
    "id": "b3f50b47-60d9-4b24-bd30-5856416b0834"
  },
  {
    "content": "3.",
    "id": "ff700997-c6de-4e17-a473-bf412c9f5763"
  },
  {
    "content": "**Encourage Accountability**: Encourage teams to own their feedback processes and outcomes.",
    "id": "8a3f9fe7-a65e-4252-a11d-5b76079ffeae"
  },
  {
    "content": "I caught this at a screening at the Sundance Film Festival and was in Awe over the absolute power this film has.",
    "id": "7f74d617-5215-4a11-aeae-0beeb36a2c3e"
  },
  {
    "content": "Dory Wiley, Commerce Street Holdings, joins ‘Closing Bell Overtime' to discuss his stock picks in Friday's Two-Minute Drill.",
    "id": "dedec036-8a64-4c67-ad18-a50af30bff2c"
  },
  {
    "content": "Utilize portfolio management tools and analytics software to consolidate and evaluate your investments effectively.",
    "id": "5e7156c1-55d3-4141-9383-194de96e1976"
  },
  {
    "content": "I normally a fan of the Wa, but this one had a filthy women's room.",
    "id": "3b66aa2d-10c7-47f2-b15b-157243e0191c"
  },
  {
    "content": "The two friends stopped and looked up at the sky.",
    "id": "1f0dad58-9109-4b7b-9de8-a08d0c587bab"
  },
  {
    "content": "My husband and I ended up going with the regular sized salads.",
    "id": "b41f52d4-3323-427b-b426-5f4a7c423b26"
  },
  {
    "content": "This in-depth analysis outlines why leader visibility and approachability are crucial during such periods, detailing actionable steps, best practices, and a strategic framework to enhance these attributes.",
    "id": "e91257d4-5b0d-4ccf-9b39-a104c4fb3798"
  },
  {
    "content": "**Model Emotional Intelligence**:\n   - Leaders should demonstrate EI in their interactions, setting a standard for team members to follow.",
    "id": "999a3714-0354-46f7-b607-f0d0855d2b43"
  },
  {
    "content": "Often times, much like the films \"aimed at teens\" mentioned in the prior comment, the effects of rape are displayed as either extremely manic and impulsive or terribly depressed, isolated and lifeless.",
    "id": "a376b321-96de-45ea-8c3d-31c9bb28d3f9"
  },
  {
    "content": "Descent is a film.",
    "id": "fc14c4f1-7a94-4cf2-8bcc-22f3e1216496"
  },
  {
    "content": "- Ensure that employees are trained to adhere to standardized procedures.",
    "id": "4849e0ff-251a-4700-8962-aec760c7e851"
  },
  {
    "content": "### Conclusion\n\nManaging organizational change is not a one-time event but an ongoing process that requires commitment, flexibility, and strategic thinking.",
    "id": "6259c58a-fab8-40f2-9ded-e82e62293d39"
  },
  {
    "content": "Decided it's not worth the trouble, thanks Burger King for encouraging me to prepare my own breakfast instead of consuming your products.",
    "id": "d26cd0c7-cf58-4c73-a85e-2814828da2ba"
  },
  {
    "content": "2.",
    "id": "d579aa68-c9c4-4c43-98fc-048692191a90"
  },
  {
    "content": "Here, Alice manages to land a job in hope of finding her lost father.",
    "id": "70369e75-d9f1-4fd3-baf4-beae9fe3fafc"
  },
  {
    "content": "Hadn't been to this location in years.",
    "id": "18028465-cc2e-484f-8500-a596a2b26685"
  },
  {
    "content": "In regards to size, KFC gives some large chicken pieces, larger than a lot of other places.",
    "id": "b3a933b6-c4c5-46d8-bf8c-72306171bed7"
  },
  {
    "content": "We set a timed order for 7:30pm at 5:30pm and it is 8:30 and we have still not received our pizza... there's really no good excuse for this.",
    "id": "c75e3df9-37e5-4bb4-83e5-7b0069923a0c"
  },
  {
    "content": "He worked hard and soon the ashtray looked shiny and new.",
    "id": "bd5b18e1-ba76-48a1-a714-8d37b9987733"
  },
  {
    "content": "So the brave boy walked back to the bush and said, \"What is your question, bear?\"",
    "id": "e5fce35d-505f-41b1-be4a-a9fd9cf6af9e"
  },
  {
    "content": "Once upon a time, there was a very thoughtful girl.",
    "id": "5bde7329-eb81-41cf-acf3-5f82b8d0fb71"
  },
  {
    "content": "One day, at the park she saw something special - a coffee cup!",
    "id": "f9956a61-7a99-4e2d-bfc0-eb64f3902847"
  },
  {
    "content": "She went closer to have a better look.",
    "id": "90730a65-8459-42af-a947-93adec3db9f2"
  },
  {
    "content": "The soldiers mainly spoke of their awareness of toxicity in their training in boot camp, and how hard it was once they returned to civilian life.",
    "id": "90ce1e31-5b4b-4dd9-b684-e496c30c1e77"
  },
  {
    "content": "Do the numbers hold clues to what lies ahead for the stock?",
    "id": "608c0308-67d1-4680-bd9d-e9ffb8a95a73"
  },
  {
    "content": "But then something unexpected happened.",
    "id": "28c8b4a5-be6b-4560-8f67-fc086820ec3d"
  },
  {
    "content": "This is so very rare for a 'guy's action flick' that even I [who thinks most A/A is violent pap] liked the film and have recommended it to every guy I know.....it's a shame this one was overlooked because by rights it should have been one of the biggest action-adventure box office hits -- it has something for everyone without straining credulity or losing the nearly non-stop action moments.",
    "id": "1174ae87-a871-4d03-82b7-ca715062c846"
  }
]