[
  {
    "content": "3.",
    "id": "3e4dcb8b-cc1c-4afb-90fa-b2c8e984df3f"
  },
  {
    "content": "I don't know where to begin, so I'll begin with a snippet from the back of the cover of this movie.",
    "id": "dcb4bee8-1966-4618-b406-baff80e31c0f"
  },
  {
    "content": "I wish I had a mustache too.\"",
    "id": "97f2780d-1ad2-4fbd-a280-ac4b51d22cd6"
  },
  {
    "content": "- Disclose significant risks and uncertainties related to the transaction in the management discussion and analysis section of annual reports.",
    "id": "e8a57784-2260-4676-9025-27280e43c86e"
  },
  {
    "content": "**2.3.",
    "id": "bbf6845c-e763-41e3-82c5-abc819333de6"
  },
  {
    "content": "TPVG yields 8.42%.",
    "id": "e17942ec-b210-43d0-af1a-ba82cf6f840f"
  },
  {
    "content": "I lost interest less then a third of the way in and had to struggle to get to the end.",
    "id": "940d4a51-798d-4d66-b626-c5115a5e6a95"
  },
  {
    "content": "Oh no!",
    "id": "e7c3ecb5-135f-4992-8bd6-a7729e20a490"
  },
  {
    "content": "Given how good the authentic Central American restaurants in the region are, Taco Bell will remain far down the list of choices, but at least their stuff is okay.",
    "id": "8285ada5-6775-47b2-9ef2-4ed51b2fe38a"
  },
  {
    "content": "They make one drink at a time!",
    "id": "52c8e5fe-e5ea-4a92-aed2-3742abd8029a"
  },
  {
    "content": "As interest rates go up, REITs go down.",
    "id": "2b114fe7-0fea-4d5d-b00d-fa57c92636c4"
  },
  {
    "content": "#### 4.",
    "id": "8b7f49b5-5972-4ac4-b0c5-6953b8a517bb"
  },
  {
    "content": "But the best way she protected her little girl was with hugs and kisses.",
    "id": "12c32e94-8ab0-49e6-80e7-591ea69fab84"
  },
  {
    "content": "With your help, the boss and I found a phenomenal breakfast in Center City.",
    "id": "5479c293-c602-470f-8cc0-ae5f07beb19d"
  },
  {
    "content": "**Feedback Loops**\n   - **Definition**: Implementing mechanisms for continuous feedback can refine decision-making processes and improve outcomes.",
    "id": "86ad9545-634a-4416-8436-7374d265053c"
  },
  {
    "content": "After losing some value lately, a hammer chart pattern has been formed for Whitestone (WSR), indicating that the stock has found support.",
    "id": "77ab3e78-0003-4b2f-b44a-b90d21d47c55"
  },
  {
    "content": "- **Cash Flow Effect**: Decreasing inventory can release cash back into the business, improving cash flow.",
    "id": "b9c8c5bc-878a-4131-9273-5384137b5ac0"
  },
  {
    "content": "At the end of the day, Joy was proud of herself for completing the task.",
    "id": "22eb944d-b4a4-40ea-83d8-5627ec41e7e1"
  },
  {
    "content": "As written, the characters played by Mackintosh and Bradshaw are in fact so utterly selfish and cold-hearted that one begins to wonder what exactly was Kureishi trying to say.",
    "id": "bba570aa-b5be-42a4-b5d0-13068c1f30f9"
  },
  {
    "content": "Once there was a house.",
    "id": "ed855015-bc6f-4493-83fd-5cc5fa272497"
  },
  {
    "content": "Do the numbers hold clues to what lies ahead for the stock?",
    "id": "11952b84-a61c-457a-a0f4-13448ade174a"
  },
  {
    "content": "Holding stocks may seem risky in the short run, but it is much safer if you keep a long-term outlook.",
    "id": "b0b749b4-aedd-4ad5-b3e6-13be7b93b587"
  },
  {
    "content": "Whitestone REIT's (WSR) recent dispositions come as part of its ongoing asset management strategy, aiming at balance sheet improvement and growth in earnings.",
    "id": "6bdca964-287a-4045-8a9d-16ce70112c1c"
  },
  {
    "content": "Unfortunately, for LA BETE, now that you can more easily see the film, the notoriety of something once 'forbidden' has been lifted.",
    "id": "f7dd096c-5e35-47c9-94bd-fa80bf87ee61"
  },
  {
    "content": "HOUSTON, Jan. 10, 2023 (GLOBE NEWSWIRE) -- Whitestone REIT (NYSE:WSR) (“Whitestone” or the “Company”) today announced that it will release its financial results for the fourth quarter ended December 31, 2022 after the market close on Tuesday, February 28, 2023.",
    "id": "71908113-6907-40d7-8628-bcd53be859a9"
  },
  {
    "content": "- **Best Practices:**\n    - Use feedback loops to refine educational content and ensure relevance.",
    "id": "c70bc145-4d7d-4322-879b-47493ac1505d"
  },
  {
    "content": "In addition, your car can be up to 45 minutes away at any one of their Tampa locations.",
    "id": "e8f28ecc-0b18-4ee1-bec7-c11ed4799615"
  },
  {
    "content": "I would assume Lloyd Bridges never dove there.",
    "id": "62fc5521-1df3-4135-a0d6-d4bbed8daf70"
  },
  {
    "content": "Well the walmart workers who came in after us got their breadsticks first.",
    "id": "a3817ad9-73b3-4827-9e23-3f6b207daa9e"
  },
  {
    "content": "The animals had all different types of hurts and bruises.",
    "id": "98a77826-05f3-476d-936b-6dc5bdff3aab"
  },
  {
    "content": "- **Encourage Questions**: Create a culture where questioning is welcomed, allowing team members to challenge assumptions constructively.",
    "id": "891bdd8f-6833-43f0-84df-820dc8ddbd69"
  },
  {
    "content": "Enhanced Data-Driven Decision Making:**\n   - Organizations can shift from intuition-based decisions to data-driven approaches, leading to higher accuracy and reliability in outcomes.",
    "id": "315067c0-6b70-4d5b-899b-d952b7eabf09"
  },
  {
    "content": "Perhaps if I order from\nThem again I could maybe ask them to add the veg on after it is cooked.",
    "id": "f857bfe9-de46-43df-bbf2-d796f3c1d93d"
  },
  {
    "content": "Let's hope his next one will be great.",
    "id": "2be872ae-124c-489e-aae4-5083d97483f4"
  },
  {
    "content": "When she was finished, she felt much better!",
    "id": "50971bd2-7a08-4649-830f-90944cc8db8e"
  },
  {
    "content": "<br /><br />Once the sex and nudity begins, it is a nonstop sequence involving masturbation, a looooooooong flashback to an alleged 'beauty and the beast' encounter, and a naked woman running around the mansion (nobody, even her supposedly protective Aunt, seems to even think of putting some clothes on her!).",
    "id": "d71c5438-53f4-4627-9165-3aaeda5fe533"
  },
  {
    "content": "The expensive underlying G&A has been significantly mitigated.",
    "id": "be4798e5-6a69-4d18-a02e-e04ec8c967ff"
  },
  {
    "content": "However with the inclusion of a Joy Division song, it made me grab a couple of their albums for a listen.",
    "id": "20714173-8b1b-4771-8c86-55f6f2cdb292"
  },
  {
    "content": "The moral of the scene is - beauty can and will defeat the monster.",
    "id": "3f1bc801-5b78-4959-9e6e-ee2a3b83c60c"
  },
  {
    "content": "Making his directorial debut, Jack Nicholson--who also co-wrote the screenplay with Jeremy Larner, based upon Larner's book--doesn't introduce us to the characters with any clarity, nor he does shape the scenes to help us identify with anyone on the screen.",
    "id": "a07320d2-615c-4d90-991c-0eab22e51439"
  },
  {
    "content": "Jane loved helping her mom, so she got a small brush and she scrubbed too.",
    "id": "7f63bdb0-c0df-4910-948c-9250e5604645"
  },
  {
    "content": "But it seemed like no matter how much he searched, he could never find something to make him happy.",
    "id": "9fae26b2-0ce8-4000-b504-e6b6cda6f514"
  },
  {
    "content": "Once upon a time there was a little girl called Emily.",
    "id": "35c64b7f-f095-4cd4-9b7f-8e9492793cf2"
  },
  {
    "content": "It had all disappeared.",
    "id": "cc074343-a9d1-452d-9751-7835d7d97225"
  },
  {
    "content": "This is the 3rd time we have tried to dine in at this Pizza Hut!",
    "id": "d9a4b5e5-63d5-4963-8e5e-e5642564c9ff"
  },
  {
    "content": "Whitestone REIT (NYSE:WSR ) Q3 2022 Earnings Conference Call November 2, 2022 8:00 AM ET Company Participants David Mordy - Director, Investor Relations David Holeman - Chief Executive Officer Christine Mastandrea - Chief Operating Officer Scott Hogan - Chief Financial Officer Conference Call Participants Mitchell Germain - JMP Securities LLC Gaurav Mehta - EF Hutton Craig Kucera - B. Riley FBR Inc. Michael Diana - Maxim Group Operator Greetings and welcome to Whitestone REIT Third Quarter 2022 Earnings Call.",
    "id": "a2d1ce6a-ca94-41d4-9d8b-5ca0fbd9bb17"
  },
  {
    "content": "And their take on a PSL is actually pretty interesting, very sweet though.",
    "id": "52029905-dd79-462d-aa11-3fa34454c702"
  },
  {
    "content": "She looked around the tunnel, but it was very dark.",
    "id": "9378b1ad-d942-4274-b9ad-ef9d59234b20"
  },
  {
    "content": "- **Prioritize Jobs for Improvement**: Rank jobs based on their current motivational potential and categorize them as high priority for improvement if they fall below a certain threshold.",
    "id": "23c994b7-e2d5-49d8-94dc-081fef551c94"
  },
  {
    "content": "It has plenty of dry powder and its overall portfolio remains healthy.",
    "id": "f266ac43-163c-499a-9bfe-e374c59a6f47"
  },
  {
    "content": "Welcome to the TriplePoint Venture Growth, BDC Corp., First Quarter 2022 Earnings Conference Call.",
    "id": "7d6d0cd5-f15c-49f2-8dcb-323909222ffd"
  },
  {
    "content": "But then, something wonderful happened!",
    "id": "d59595da-5235-4b6c-b775-41613963c817"
  },
  {
    "content": "The stalks were hidden and the corn was hidden too.",
    "id": "4e3d0b98-6029-4210-8873-202e8ada9cfa"
  },
  {
    "content": "With a smile, the fox said, \"It's a special treat.",
    "id": "b1d0a3c9-fa82-4da8-afb4-11613298e3d2"
  },
  {
    "content": "All the workers in the factory were so nice, but they were getting tired from working so hard.",
    "id": "e8bc93c5-9341-4ba8-8e18-e01bb0b32e5d"
  },
  {
    "content": "3.",
    "id": "7a8dbdeb-246a-41ff-b0ce-d93a114705e1"
  },
  {
    "content": "### III.",
    "id": "cb4967de-78ff-46d8-b93d-b3a910de6708"
  },
  {
    "content": "Many REITs are priced at large discounts to their net asset value.",
    "id": "4c8d31fa-98c2-4197-bd44-4d924de53867"
  },
  {
    "content": "**Nike:**\n   - Nike expanded from being solely a footwear brand to include performance apparel, sports equipment, and wearable technology.",
    "id": "67a973ee-7953-40b0-8983-4e5a1965b695"
  },
  {
    "content": "Don't order curbside.",
    "id": "a119912a-4bcb-4b1e-b211-bcbfc2ef2d9e"
  },
  {
    "content": "uuummmm.",
    "id": "73045d88-8b6d-4f86-8e61-7c7810c70a80"
  },
  {
    "content": "I don't know if I'm willing to go back to try any other entrées there, but who could blame me.",
    "id": "1a486bb9-ab1b-42f6-9ccf-4180bbd14d52"
  },
  {
    "content": "Eric Rohmer's 'The Lady and the Duke' is based on the journals of an English aristocrat who lived through the French revolution.",
    "id": "1fbe73e8-90d2-41b6-b864-f8c3a75fe50b"
  },
  {
    "content": "Investors may be focused on cash flows or operational profitability, while management may want to communicate adjusted metrics that reflect their strategic imperatives.",
    "id": "9cbbc73d-42ca-4e71-a99d-c2dcd78413ea"
  },
  {
    "content": "We look at yields over 10% with dividends that are being raised higher!",
    "id": "aac35cfb-8a94-49ed-afec-a3ed7c9d6273"
  },
  {
    "content": "But her family was very kind and talked to her gently.",
    "id": "a001fe06-ef99-4de6-b211-b8ad48a53516"
  },
  {
    "content": "In typical fashion she does everything she can to allow her followers to easily track her.",
    "id": "6800ce18-5e56-47cd-969e-575441416a95"
  },
  {
    "content": "She seemed to think it was a special board.",
    "id": "ada2e6fb-c32a-472a-877f-e81af6bcfbb8"
  },
  {
    "content": "MENLO PARK, Calif.--(BUSINESS WIRE)--TriplePoint Venture Growth BDC Corp. (NYSE: TPVG) (the “Company,” “TPVG,” “we,” “us,” or “our”), the leading financing provider to venture growth stage companies backed by a select group of venture capital firms in technology and other high growth industries, today announced its financial results for the second quarter ended June 30, 2021 and the declaration by its Board of Directors of its third quarter 2021 distribution of $0.36 per share.",
    "id": "5250bd81-0e3f-45c7-8995-12fd7aa28a5c"
  },
  {
    "content": "The place was very clean.",
    "id": "5282690a-0aef-4c61-9ce9-128e2c96d432"
  },
  {
    "content": "TPVG is a technology-focused BDC with a stabilizing NAV and improving portfolio yield.",
    "id": "9c7a201a-023b-42ed-b6d0-1f7a1968d9b7"
  },
  {
    "content": "3.",
    "id": "8085b7c0-4da0-4f8f-93c8-6f019566be04"
  },
  {
    "content": "TriplePoint Venture Growth (TPVG) CEO Jim Labe on Q4 2021 Results - Earnings Call Transcript",
    "id": "1d19bd73-b3d6-457c-9ff0-464f094b4880"
  },
  {
    "content": "I am not the only one to say this,  my friend actually brought up her experience there and it the same thing.",
    "id": "8f684a46-b464-4143-bce0-45f14c2290ae"
  },
  {
    "content": "I threw most of it away.",
    "id": "754cd22d-20be-4970-9b5d-f246cb3238c8"
  },
  {
    "content": "Silly on the shape I know.",
    "id": "aa5cfdfe-ff48-4d45-a406-cd72ee30224a"
  },
  {
    "content": "Everyone was really scared.",
    "id": "ad4d33b9-aaee-412c-b6d9-cb4dfaf978ac"
  },
  {
    "content": "(Again, Harry Groener did a better dance number with this song in \"Crazy For You.\")",
    "id": "636ad359-f33c-48c3-8a60-3d0c58754668"
  },
  {
    "content": "- A high net profit can indicate overall business success but may be influenced by factors like interest rates and tax strategies beyond operational efficiency.",
    "id": "ae2e2e19-d428-422d-aa11-4274236c92e7"
  },
  {
    "content": "Striking the right balance between the two is not only beneficial; it is essential.",
    "id": "02efc62e-0382-40f4-9891-4c2f17b6c054"
  },
  {
    "content": "Emphasis should be placed on public investment in infrastructure, education, and health care as pathways to increase output and employment.",
    "id": "ca7dada5-24b0-47e6-a0f7-4c5162f80bc7"
  },
  {
    "content": "Yep, just Shiraki.",
    "id": "6ac977fa-cd87-459e-975a-d7f92dab7a0e"
  },
  {
    "content": "Also, we see a guy almost put his hand into a lawn mower.",
    "id": "034bb11d-4f6e-4c99-bef7-b344e433b484"
  },
  {
    "content": "- **Impairment Testing**: Conduct annual impairment tests for goodwill and intangible assets, applying the requirements of relevant accounting standards.",
    "id": "7a0382a6-e2bc-4791-8b35-5943dd4cf0f2"
  },
  {
    "content": "Ordered online, a medium pan pizza w fresh diced tomatoes and light sauce.",
    "id": "241c9f5c-9026-468d-bc7f-1a528f3d92f3"
  },
  {
    "content": "Do the numbers hold clues to what lies ahead for the stock?",
    "id": "b2855e55-0871-4d98-b3a0-2b3bce11d3ab"
  },
  {
    "content": "TriplePoint Venture has been focusing on deploying more capital to companies via direct equity.",
    "id": "10943cfe-370e-4ae3-959b-5560851c6c78"
  },
  {
    "content": "Soon I was at two Darwin awards (if that's even possible) for her immense stupidity.<br /><br />And, hey: Produced by Kim Basinger?",
    "id": "f3ee77b1-51e6-409e-a73a-f7a53fda5cc4"
  },
  {
    "content": "I can't even describe how silly it is seeing this woman fleeing from 4 retarded thugs, carrying a red toolbox, screaming for God to come help her, and then having sex with one of them after brutally killing the others.",
    "id": "8bd5d7be-c4dd-491c-acff-21498bcbd8da"
  },
  {
    "content": "Yet, so many of them stick with low yields or passive ETFs due to a lack of knowledge and experience.",
    "id": "7ac6dc08-c3d0-47cd-8a8f-d26e3d1a666c"
  },
  {
    "content": "He was itching to go outside and explore.",
    "id": "256e7e80-c3f6-484b-a4e8-56c0c4cea4dc"
  },
  {
    "content": "### Conclusion\n\nAn effective organizational decision-making culture is fundamental for not only achieving high performance but cultivating a resilient and innovative workforce.",
    "id": "891ea285-5dee-405e-a457-91a9fbec47c1"
  },
  {
    "content": "About 30 minutes into the movie, my friends started asking me to turn it off.",
    "id": "d88345ae-7aac-43b5-8986-56f22892a7fb"
  },
  {
    "content": "If you own this trio of REITs, it might be time to find better alternatives.",
    "id": "dcc063a5-8771-4fa2-8ddf-910c46bc2adf"
  },
  {
    "content": "Love them!!",
    "id": "d2ab9ee1-5aed-432b-a32a-410ac5ff3fb6"
  },
  {
    "content": "**Inflation Control Mechanism**: MMT proponents argue that the government can control inflation through taxation and appropriate fiscal policies.",
    "id": "f06a8185-7665-493f-ab87-4a924be8301a"
  },
  {
    "content": "The sock smiled.",
    "id": "bbee9f5d-2cd9-49d2-b75b-217c9a59c839"
  },
  {
    "content": "The staff doesn't even know how to multi-task.",
    "id": "f0b68332-98e5-4366-8040-91e53870b38e"
  },
  {
    "content": "One day he decided to go find a new home.",
    "id": "b2df789c-fcb0-4aad-8ae5-5227f2fa539a"
  },
  {
    "content": "Together, they cleaned the thread.",
    "id": "84bdc8cc-995f-4c9d-aeb9-3a2466e9d7c7"
  }
]