[
  {
    "content": "Well, first, there are many more horrid marital arts films (such as many of those from Hong Kong in the 1970s)--including one with guys dressed up in gorilla suits doing kung fu and their handlers with 3 foot long tongues they used for fighting (now THAT'S bad).",
    "id": "44cbb41b-7de8-4ec3-a79b-f025c34d7150"
  },
  {
    "content": "I watched this only because my wife wanted to see it, and found exactly what I expected: a stupid story without any real humour.",
    "id": "d7e217f4-7e1a-416a-b689-0cabc6f3044d"
  },
  {
    "content": "Currently, 3.2% of the company’s shares are sold short.",
    "id": "d0f85a7e-a972-44cf-9bd8-5ba75d3cfe9b"
  },
  {
    "content": "#### B.",
    "id": "1b7f56c8-75c3-4332-a7b4-5915f0bb6a1c"
  },
  {
    "content": "Bioventus Inc. (BVS) CEO Ken Reali on Q3 2021 Results - Earnings Call Transcript",
    "id": "6b75ea0f-4e2c-4c66-bb16-ce4faa2673b4"
  },
  {
    "content": "umm... why.",
    "id": "03409493-4209-4864-bc79-e8480c0ee555"
  },
  {
    "content": "AUSTIN, TX / ACCESSWIRE / March 19, 2021 / Apollo Endosurgery, Inc. (\"Apollo\") (NASDAQ:APEN), a global leader in minimally invasive medical devices for gastrointestinal and bariatric procedures, announced the terms of equity awards granted to Chas McKhann in connection with his appointment as the company's CEO in March 2021.",
    "id": "39e3f58a-cf8e-4cf6-b67a-38f273dcc531"
  },
  {
    "content": "DURHAM, N.C., Sept. 20, 2021 (GLOBE NEWSWIRE) -- Bioventus Inc., (Nasdaq: BVS) (“Bioventus” or the “Company”), a leader in innovations for active healing, announced that the American Academy of Orthopaedic Surgeons (AAOS) recently released updated clinical practice guidelines (CPG) indicating that high molecular weight cross-linked hyaluronic treatments, including Bioventus treatment DUROLANE, showed statistically significant improvement in certain knee osteoarthritis (OA) patients.",
    "id": "8806e333-873a-4e6f-9d2e-743105f69a54"
  },
  {
    "content": "Bioventus Inc. (BVS) CEO Ken Reali on Q4 2021 Results - Earnings Call Transcript",
    "id": "27a11c6f-3985-42b5-a60f-78d348de9801"
  },
  {
    "content": "From that day on, Tim and Lily became best friends and played together every day, but they were careful not to break the fence again.",
    "id": "7d9f1fc4-5b88-40ea-a8ee-5dea9d2198d4"
  },
  {
    "content": "You would even get roles with Bob Vila more often.",
    "id": "b724951e-7c0f-451b-bdf1-c8d5182cbd75"
  },
  {
    "content": "Physicists have measured the flight times of electrons emitted from a specific atom in a molecule upon excitation with laser light.",
    "id": "bcbf698d-60b0-4ea3-b0b7-ee2af8824b32"
  },
  {
    "content": "**Price Controls and Wage Policies**: As a last resort, MMT acknowledges the utility of temporary price controls and wage policies to dampen inflation.",
    "id": "8c6345b6-96f3-47a8-829e-41468c7de645"
  },
  {
    "content": "Ekin Cheng is the name draw, here, but he spends most of the film just grinning idiotically and flipping a coin.",
    "id": "c39aef57-4986-4e9a-ab8d-1169131b586c"
  },
  {
    "content": "I asked him to throw his trash in a trash can, and he ignored me then rolled up his window.",
    "id": "fa67f5d2-4457-421c-bde7-677bcadcab4b"
  },
  {
    "content": "3.",
    "id": "79217222-547e-4fc4-928c-376619176ca7"
  },
  {
    "content": "But he only told the bunny if he gave him some carrots.",
    "id": "a33b58ab-3325-4f13-99d0-8244fbbfa0b2"
  },
  {
    "content": "Billed as a kind of sequel to The Full Monty, about unemployed men in Sheffield, this movie is a fake.<br /><br />As someone born in Sheffield, and still with links to the city, I was extremely disappointed by this film.",
    "id": "31e0fcbc-a055-483d-a847-04ec971f54fd"
  },
  {
    "content": "And then, Violet enters the scene, looking all weird and annoying.",
    "id": "f93fb982-4d13-4ff9-971b-269420ba06c1"
  },
  {
    "content": "**Monitor Inflationary Pressures**:\n   - **Economic Indicators**: Implement a framework for continuous monitoring of inflation metrics (Consumer Price Index, wage growth, etc.)",
    "id": "c6a8b7d1-ecdb-4d9f-864d-6f5a08cddf22"
  },
  {
    "content": "The Company's management will host a conference call at 8:30 a.m. Eastern Time that same day to discuss the results and provide a business update.",
    "id": "68cc0a30-c910-42fc-a95f-abf8a53212bc"
  },
  {
    "content": "Last week, you might have seen that Apollo Endosurgery, Inc. (NASDAQ:APEN) released its annual result to the market...",
    "id": "e7e82488-d7a6-4258-9c28-819a751b0fa6"
  },
  {
    "content": "The tomato salsa here is spicier than at other locations, which I really like.",
    "id": "b5b6d710-fb91-49ee-a109-84ffdc4febb2"
  },
  {
    "content": "Every morning, Lulu would march outside to get some sunshine.",
    "id": "1f27b853-883f-491d-a8a3-9ac201c6ced5"
  },
  {
    "content": "From that day on, they all stayed together and were very happy.",
    "id": "3030da11-b08e-44ce-9bd4-e48a13e2ac0a"
  },
  {
    "content": "I'm not sure the way he was killed would really have worked.<br /><br />Anyway, the horror elements get in through: a gory autopsy, the recurring dream of the man killing the boy, a nightmare in which a plate of eggs turn into eyes which are then cut, and several shots of the decomposing man both in nightmares and actually in his grave.<br /><br />I was a little surprised to see a dedication in the end by Fulci to Clive Barker!",
    "id": "3f80273a-49fb-4825-8e8c-1019921ba956"
  },
  {
    "content": "**Effective Spending Mechanisms**\n\n   - **Productive Investment**: Emphasize investments that yield long-term social and economic benefits—like infrastructure, education, and healthcare—that increase the economy's productive capacity.",
    "id": "b9356782-bf3f-4caf-b36b-21d407a20f42"
  },
  {
    "content": "Inquire about past experiences where their passion propelled them to go above and beyond.",
    "id": "543b9b6d-69f3-4892-a54e-451e19985e39"
  },
  {
    "content": "Veteran Executive Brings 30 Years of Financial and Operational Leadership Experience AUSTIN, TX / ACCESSWIRE / July 16, 2021 / Apollo Endosurgery, Inc. (\"Apollo\") (NASDAQ:APEN), a global leader in minimally invasive medical devices for gastrointestinal and bariatric procedures, today announced the hiring of Jeffrey G. Black as Chief Financial Officer.",
    "id": "cc23bf0e-d49f-4754-8758-ab083fb4dc2c"
  },
  {
    "content": "Tony felt guilty and took out a lime from his pocket which he had picked when Sarah was busy playing.",
    "id": "f6437e3f-c471-4c56-92a7-13e968c04991"
  },
  {
    "content": "AUSTIN, TX / ACCESSWIRE / January 5, 2021 / Apollo Endosurgery, Inc. (\"Apollo\") (NASDAQ:APEN), a global leader in less invasive medical devices for gastrointestinal and bariatric procedures today announced that it will participate in the H.C. Wainwright Bioconnect 2021 Conference taking place virtually January 11-14, 2021.",
    "id": "78e9d274-ce56-4a00-bd34-273feaec06b7"
  },
  {
    "content": "### IV.",
    "id": "e9950943-14b0-46a0-a7c2-8c6900d44607"
  },
  {
    "content": "Among them, Facebook and Microsoft ranked among the top 3 picks and these stocks gained 54% and 51% respectively.",
    "id": "f6276787-c033-47d9-a024-7ed1cf2e0729"
  },
  {
    "content": "The process of adapting a book to a movie too often ruins the world the author has established.",
    "id": "c8b90cc7-9bf1-4d53-a31a-bdd21c7538ea"
  },
  {
    "content": "- Energy auditors for building efficiency projects.",
    "id": "9cbf6650-f144-4657-ab6d-65ee34c60945"
  },
  {
    "content": "What if I were to create a really really cheap and crappy looking Dino and crocodile polygon model in Maya and then proceed to cut and paste that into an amateur video clip having people scream and getting eaten by the same thing?",
    "id": "c17eeba4-31e3-4968-b9eb-18c3dfe2d3df"
  },
  {
    "content": "**Actionable Steps**:\n   - **Vision Setting**: Develop a compelling vision for the change that articulates why the transformation is necessary and what success looks like.",
    "id": "03cd0d5b-8477-4426-a651-7ba7d751c841"
  },
  {
    "content": "Disparities can lead to issues such as cognitive dissonance, dissatisfaction, and reduced trust within teams or between leadership and followers.",
    "id": "1e5f001b-fae9-4994-9aa0-2b81a690771c"
  },
  {
    "content": "Not sure I'll be ordering for a while.",
    "id": "b5c67e38-1eb2-482b-9dad-dd4135b81469"
  },
  {
    "content": "Grandma was disappointed and asked Sarah why she had not picked the lime.",
    "id": "a340f392-e354-4a4d-aad3-d4d27d46a8db"
  },
  {
    "content": "The annual U.S. inflation for the month of November beat expectations and put these ETFs and stocks in focus.",
    "id": "ceab9295-11f1-4439-8113-4381cbfccbd4"
  },
  {
    "content": "Please please please check your order.",
    "id": "b13ac0b8-1813-4525-8cf1-8d63bdddb233"
  },
  {
    "content": "Ella pretended to be a butterfly and a tree.",
    "id": "39a0b5ef-770e-433f-81f4-48fbf1f07e71"
  },
  {
    "content": "She loved to play with her toys and take naps in the sun.",
    "id": "9610c675-b4c3-40e9-bfce-8a87f98b194d"
  },
  {
    "content": "This sports a nice, deep cast but for a thriller you better deliver more than name actors and talk.",
    "id": "3a839e6a-ec15-49ab-981a-3ebdb05d0a61"
  },
  {
    "content": "Apollo Endosurgery, Inc. (APEN) CEO Chas McCallen on Q2 2021 Results - Earnings Call Transcript",
    "id": "59fb8be8-b9a7-45b3-99ed-c848573bbc1d"
  },
  {
    "content": "Apparently so.",
    "id": "565c5810-e048-4fcd-bdd1-5e264bd5f59e"
  },
  {
    "content": "Consider segmentation factors such as department, tenure, performance level, and voluntary vs. involuntary turnover.",
    "id": "73fb4839-d6ac-42a7-9fe5-d1e912dd23bd"
  },
  {
    "content": "8.",
    "id": "73da5ec0-9ad8-4078-8175-7fc4518e9752"
  },
  {
    "content": "she asked the flower.",
    "id": "cb72b9a6-a94b-4066-8d00-0bcb5bdeab94"
  },
  {
    "content": "He had a box full of crayons.",
    "id": "be13205a-554d-4388-80d7-1a5bb0984988"
  },
  {
    "content": "He installed a new speed sensor and an engine mount for under $500.00 to correct the ABS light issue.",
    "id": "c362352b-7432-4cf6-8c6e-f785f89e0d1c"
  },
  {
    "content": "Moral of the story: It is important to not break promises and always do your important tasks.",
    "id": "cfcd0c9a-619e-4f14-97fa-fc61bdc34c83"
  },
  {
    "content": "DURHAM, N.C., Aug. 23, 2021 (GLOBE NEWSWIRE) -- Bioventus Inc. (Nasdaq: BVS) (“Bioventus” or the “Company”), a global leader in innovations for active healing, has appointed Dave Crawford as its Vice President, Investor Relations and Treasurer.",
    "id": "e01812b4-50fa-44fb-9fde-ff0f3bcb5df0"
  },
  {
    "content": "Welcome to Bioventus First Quarter 2022 Earnings Conference Call.",
    "id": "65fd0d73-c3b8-4010-946d-70cd5b581a00"
  },
  {
    "content": "I never ever had this kind of arrogant experience before.",
    "id": "3fd91037-d7cb-42fb-9151-f723cb193c8b"
  },
  {
    "content": "He cried and said, \"No, Mom!",
    "id": "36db4ad1-526d-4827-8205-4010a78470d4"
  },
  {
    "content": "There's merely one very brief shot at the beginning.",
    "id": "7c6df4f6-808c-491d-ae44-ed6516809237"
  },
  {
    "content": "Took them 10 minutes to get me one of the refreshers and took them 20 minutes to get me my other drinks and I had to remind them.",
    "id": "475bb82f-6321-4aba-b555-1c6b2b96c4ab"
  },
  {
    "content": "### Actionable Steps and Best Practices\n\n#### Policy Implementation\n\n1.",
    "id": "cae5763e-5460-4ba8-95a3-90d3214589bf"
  },
  {
    "content": "It was pretty damn good with a delicate flavor profile, though I think adding some fresh pico to the mix would of set it off even better.",
    "id": "8e404c3d-e90d-4243-941e-8793bf21dc9f"
  },
  {
    "content": "But then they saw a cheap toy.",
    "id": "97c57fad-ce38-47f4-b8ee-46a8ea1a99d2"
  },
  {
    "content": "As the beautiful yarn started to make different shapes, she began to dream of the wonderful things she could do.",
    "id": "c96db8e7-f85e-4ae5-a254-6a60eb542596"
  },
  {
    "content": "All you really need to know about this movie comes after the opening scene, where a guy falls into a lake and gets eaten.",
    "id": "67c2fc4e-ab94-4fd4-89f7-6f58feb5fb84"
  },
  {
    "content": "In short, \"Watching the Detectives\" is pleasant if forgettable motion picture that you might have a chance to catch it on cable TV so quick that you couldn't imagine.<br /><br />BloodyMonday Rating: 1.5/4",
    "id": "2956204e-f91e-4e0a-9833-05e140947ca8"
  },
  {
    "content": "**Monitor and Evaluate Progress**\n\n   - **Performance Metrics:**\n     - Establish metrics that can measure the effectiveness and impact of implemented changes.",
    "id": "6f0694ec-ea84-42ff-8722-018350ab2cf0"
  },
  {
    "content": "That's why she lied and said that she hadn't seen anything at all.",
    "id": "5329da84-4a90-4895-b217-37b1e2655b28"
  },
  {
    "content": "The only complaint about this convenience store is the lack of a restroom.",
    "id": "2cc660b5-f4af-48f6-94b6-09b125eb9796"
  },
  {
    "content": "Control Over Monetary Policy**\n1.",
    "id": "c11b8980-552b-430e-b21f-2f2e23fc0bbd"
  },
  {
    "content": "**Development and Training**\n   - **Actionable Steps**:\n     - Design customized training programs based on personality profiles to enhance soft skills (for example, communication, conflict resolution).",
    "id": "3dad21ad-6f28-4cb7-adac-e3c879ef89e3"
  },
  {
    "content": "DeJon does a great job making the pizzas.",
    "id": "fd4f731c-9121-40c6-b134-e7466932a8f3"
  },
  {
    "content": "Understanding the mechanisms of self-monitoring and its influence will enable organizations to leverage it for better workplace outcomes.",
    "id": "e8efd8e9-b0be-4acd-b593-5e30172102b0"
  },
  {
    "content": "At checkout, the clerk asked if I had a CVS card.",
    "id": "f9433c67-3b01-4121-9361-72bc12bb73d5"
  },
  {
    "content": "Yeah, I do like Wawa and for years I lived near this location.",
    "id": "5727d492-b516-4d83-b79c-2832c08e3e0c"
  },
  {
    "content": "AUSTIN, TX / ACCESSWIRE / March 3, 2021 / Apollo Endosurgery, Inc. (\"Apollo\") (NASDAQ:APEN), a global leader in less invasive medical devices for gastrointestinal and bariatric procedures, today announced that it will participate in the H.C. Wainwright Global Life Sciences Conference taking place virtually March 9-10, 2021.",
    "id": "d5797df5-a73c-4e65-87f1-4e0d830e31e9"
  },
  {
    "content": "Look at this bowl!?",
    "id": "2363792d-93ab-4681-acfc-68781d957628"
  },
  {
    "content": "This should align with community needs (e.g., environmental cleanup, teaching assistance, infrastructure maintenance).",
    "id": "e9d60e46-9a12-4600-aa0a-7312d3ba8ecc"
  },
  {
    "content": "Tim's mom said, \"Yes, Tim.",
    "id": "1be4d106-f3f2-44fc-9cf8-c7c291ed4540"
  },
  {
    "content": "Also, the store is very bright so it feels nice and clean :) good for quick late night grab",
    "id": "c7e06ee1-2823-4408-ade8-963cf97a5962"
  },
  {
    "content": "I mean, this film is centered around MOVIES, yet is itself incredibly uncinematic!",
    "id": "637a8366-92fc-4cb2-ac32-0fe8482b4fbe"
  },
  {
    "content": "I was taught if you have time to lean, you have time to clean.",
    "id": "0f125fec-fe15-4c08-a31d-1f70f1cf1f55"
  },
  {
    "content": "#### III.",
    "id": "b1ada24f-a8d6-40aa-85ce-8cf4d0ff7c8b"
  },
  {
    "content": "Once upon a time there was a happy little girl.",
    "id": "073c542e-02bf-477e-80ff-14bbbedee596"
  },
  {
    "content": "Promote Organizational Justice\n\n- **Training for Managers**: Train managers on the principles of equity and justice to help them maintain fairness in their interactions with employees and team dynamics.",
    "id": "58862b72-4f54-4a0b-9916-9bd20832f826"
  },
  {
    "content": "The ORBERA Post Approval Study was a requirement following the US FDA's approval of ORBERA in August of 2015.",
    "id": "708592c9-7dba-4381-a747-867f186324c8"
  },
  {
    "content": "Each day he went to school and each day he was very happy.",
    "id": "7114157e-fd32-4d24-a085-42b03cbbe877"
  },
  {
    "content": "Bioventus Inc. (NASDAQ:BVS ) Q2 2022 Earnings Conference Call August 11, 2022 8:30 AM ET Company Participants Dave Crawford - VP of IR Ken Reali - CEO Mark Singleton - SVP and CFO Conference Call Participants Alex Nowak - Craig-Hallum Capital Group Robbie Marcus - JPMorgan Drew Ranieri - Morgan Stanley Phil Coover - Goldman Sachs Operator Good morning, and welcome to the Bioventus Incorporated Second Quarter 2022 Earnings Conference Call.",
    "id": "8c0adf98-5e2b-446a-a8d2-ec308fd6cc3d"
  },
  {
    "content": "### Best Practices to Sustain Low Turnover\n\n**1.",
    "id": "6a7c51a4-0be2-4523-8ba9-555c1f1d4ef1"
  },
  {
    "content": "The worm wanted to help her.",
    "id": "162c3722-2531-4f83-aebd-0ec02243f2d0"
  },
  {
    "content": "- **Cost Implications**: Although voluntary turnover can bring fresh talent, it carries costs related to recruiting and training new employees.",
    "id": "e9b65788-5aab-4dba-9e9f-1824b2ee4cd5"
  },
  {
    "content": "sigh..",
    "id": "ecc47cc7-41a9-4756-9f7a-8c22f513f0b2"
  },
  {
    "content": "We ordered a pizza tonight and had to wait a few minutes to eat it because it was so hot and fresh.",
    "id": "16934e72-729c-4506-bab2-dbf6434f154c"
  },
  {
    "content": "But a movie still lives or dies on its plot--the story it is telling.",
    "id": "98b2adec-10aa-4172-a6d6-9b55eca1cad0"
  },
  {
    "content": "2.",
    "id": "e5bc117f-a73b-4a6e-bcaf-6f6908cc208e"
  },
  {
    "content": "Very cute item!",
    "id": "c06f4a80-3f54-4b2a-a857-e5dbc3eb8c75"
  },
  {
    "content": "- **Resource Availability**: If there are sufficient resources (time, funding, personnel) to support a structured change process.",
    "id": "326ab959-4928-4a91-863d-01bc29d9cea3"
  },
  {
    "content": "Hubby and I ate here on the 4th of July.",
    "id": "0f65b8ad-d894-4087-887a-54845dfd8e07"
  },
  {
    "content": "Just kidding!",
    "id": "eab0292c-523c-428c-8cdc-cc97754abf6f"
  },
  {
    "content": "- **Work-Life Balance**: Offer flexibility in work arrangements and benefits that address employees’ personal needs, such as remote work options or wellness programs.",
    "id": "815ca7c9-e23b-4cea-9247-d83a14611a8e"
  },
  {
    "content": "I wouldn't believe it, yet here I am in a burrito less nightmare- sure I could get a bowl, but I live on carbs, and go eat a pizza no dough and tell me it's just as good.",
    "id": "acf9a34a-cf67-4368-9650-4c238a29ec56"
  }
]