[
  {
    "content": "Willis gives his best performance here, but he's outdone by Pitt's incredibly frenetic turn that's unlike anything he's done before or since.",
    "id": "ff4bc2af-499f-41af-9714-685886efaff8"
  },
  {
    "content": "The food is always freshly made.",
    "id": "96ac13d3-bc6b-4c8f-892a-6be14772b362"
  },
  {
    "content": "Tim saw a squirrel and wanted to play with it.",
    "id": "6924eb84-f1f4-4145-8d87-a3b583ed899d"
  },
  {
    "content": "- **Risk Assessment Tools**: Implement formal risk evaluation tools to quantify risk tolerance and potential drawdowns.",
    "id": "972e9420-3095-4d33-ae00-f3661322aa76"
  },
  {
    "content": "Tom wanted to say hello to the bird.",
    "id": "3789d929-2b8d-4a66-bc84-78e7ac7677a7"
  },
  {
    "content": "Today, we'll discuss the results announced in our press release issued after the market closed.",
    "id": "57e51165-fa78-447e-82c0-1afbb5239b77"
  },
  {
    "content": "3.",
    "id": "a2a7a2f0-f5fc-4e11-832a-a742d5885db1"
  },
  {
    "content": "Legal & General Group Plc trimmed its stake in shares of Brightcove Inc (NASDAQ:BCOV) by 13.3% in the 1st quarter, according to its most recent disclosure with the Securities & Exchange Commission.",
    "id": "fae3f1a9-606f-48b3-8c54-021bf3f5059e"
  },
  {
    "content": "Well I wrote that movie and filmed my goldfish in their fish tanks!",
    "id": "236ff074-e00d-4397-8422-ec32eacfd3f7"
  },
  {
    "content": "Your milk is in the refrigerator.",
    "id": "bb714eb2-363d-4927-ae7d-dd0bdbd37950"
  },
  {
    "content": "Jimmy Johns is a fast service type place and they make your sandwich faster than any other fast food place that I have ever seen.",
    "id": "47edeb9b-9c79-44e6-8304-bba3fe2f4ab5"
  },
  {
    "content": "We live in Arizona, but if we lived locally we'd be at Firebirds every week.",
    "id": "993a2ad4-dbc7-4103-ae0a-629a553b4c39"
  },
  {
    "content": "Toward the end of trading Thursday, the Dow traded down 1.49% to 26604.41 while the NASDAQ fell 2.37% to 10,452.62.",
    "id": "c26eada2-04a0-4626-8e4a-cadee953293e"
  },
  {
    "content": "**Diversify Across Types**: Consider allocating funds across various categories of bonds to balance yield and risk, and to mitigate exposure to any single sector.",
    "id": "38313692-a164-4476-b75e-3be484d78c15"
  },
  {
    "content": "One day, the pants told Sue they wanted to marry.",
    "id": "0aca1e52-3ba7-495d-bd09-6a68fbb8f41b"
  },
  {
    "content": "They get out of the car and look around.",
    "id": "9d8934ae-6776-467c-aaec-1d261a416476"
  },
  {
    "content": "Mencia even discusses whether or one should have the right to speak out and tell a joke.<br /><br />Carlos Mencia is not afraid to offend, which at many times gets him trouble with his critics.",
    "id": "fad1fc14-d815-49d9-b38e-c7adf12b8907"
  },
  {
    "content": "Typical experience for fast food in Bridgeton.",
    "id": "560f59f3-3166-4f56-ad43-c03101b9ec02"
  },
  {
    "content": "Tim saw a branch that was low.",
    "id": "c171fd7d-7f2d-412d-8290-f90b74553d45"
  },
  {
    "content": "**Risk Identification**: Project managers may overlook potential risks or challenges, failing to factor them into their planning processes, which can lead to unanticipated setbacks.",
    "id": "b9183bd6-d751-4010-82e3-bf8bea6c62f3"
  },
  {
    "content": "Here's what investors need to know about the announcement.",
    "id": "7e2c3ecc-ac31-48f0-bf66-c0b659794f90"
  },
  {
    "content": "Each individual's circumstances and preferences are unique, leading to varying responses to economic stimuli.",
    "id": "f910be68-84e9-4a78-b4bd-718e1ec8bea6"
  },
  {
    "content": "<br /><br />These questions are formulated in a masterful sequence which includes key scenes of Alfred Hitchcock's masterpiece VERTIGO in which Madeleine Elster/Judy Barton mourns her own brief existence (\"You took no notice,\" she says, as Cole and Railly watch from their seats in the movie theatre they are hiding in).",
    "id": "b3e49444-3f06-46fc-a38b-72d3f216a1b1"
  },
  {
    "content": "All were solid, but the  Black Bean style fish was by far the best.",
    "id": "3dc5636f-4d81-4329-8524-f314fd291f7f"
  },
  {
    "content": "One day, they saw a shiny new automobile parked in front of their house.",
    "id": "1aa2a6af-524a-41bc-89f6-f3d2208e04bc"
  },
  {
    "content": "When her father consoles her with \"I'll take you to the zoo tomorrow\", she replies \"Oh I can see enough monkeys around here\"!!",
    "id": "73ef022c-1c5e-4e19-9b37-19265c1c2c09"
  },
  {
    "content": "#### B.",
    "id": "3fe8d81d-76f3-4694-9bf7-bce20099653e"
  },
  {
    "content": "Initially she had been definitely a supporting player but her potential was so vivid that the script was rewritten to make her the star.",
    "id": "8170d151-4f87-42cc-9133-c23880d618f6"
  },
  {
    "content": "Big Blue’s new direction and new management get one brokerage firm’s vote.",
    "id": "71b7437f-d367-4329-88b9-cf250d8b8c86"
  },
  {
    "content": "It's disturbing and distracting.<br /><br />Probably a coincidence, the Louis Armstrong song 'What a Wonderful World' was used at the end of both '12 Monkeys' and the final episode of the TV series of 'The Hitchhiker's Guide to the Galaxy'.",
    "id": "01454a56-ebe1-4460-80b2-49ebcda9ce47"
  },
  {
    "content": "Together, Brightcove and ByteArk will further empower media organizations, content owners using OTT (over-the-top) platforms, and enterprises to create a flawless viewer experience that",
    "id": "8a1c42fe-2bcf-4a8d-88bc-6b1cec8bbcd4"
  },
  {
    "content": "Out of fucking tortilla shells!",
    "id": "5b839fa8-75ce-428a-bfaa-b960f1cf18d5"
  },
  {
    "content": "He felt happy and fun.",
    "id": "108917d3-1e63-49bd-a114-87ae1e4b66f4"
  },
  {
    "content": "Tim thought for a moment and then he shrugged.",
    "id": "f52ae447-db41-4f51-95ca-045de60d9248"
  },
  {
    "content": "By adopting comprehensive methodologies, actionable steps, best practices, and strategic frameworks, historians can better articulate the multifaceted nature of causation in history.",
    "id": "4d84da34-1074-4935-a8e6-d0146ec0c833"
  },
  {
    "content": "Actionable Steps\n\n1.",
    "id": "83bc73bc-5920-45a4-ba41-417448f8a820"
  },
  {
    "content": "Sarah smiled and said, \"Okay, I will permit you to take a fun quiz at home with me.\"",
    "id": "6498069a-89ab-447d-9bdb-135a84920437"
  },
  {
    "content": "The U.City location is larger and serves the food more quickly than any other location.",
    "id": "eb95b029-447e-42cd-a8af-2fb20da3cded"
  },
  {
    "content": "In summary, spreadsheets shape not just the data but also the narratives we tell with that data; they hold the power to instill confidence or sow doubt in forecasts based on their design, organization, and presentation.",
    "id": "0c853144-399d-40d4-871b-bd0a00b246f1"
  },
  {
    "content": "Let's go and see.\"",
    "id": "3a7ca092-d2b7-49c8-851f-ad7c414e292f"
  },
  {
    "content": "Customer service was absolutely excellent; I am praying it stays that way!!",
    "id": "1acfd2ad-4ed2-4870-9d0c-a18de7ab0c24"
  },
  {
    "content": "Brightcove Inc. (NASDAQ: BCOV), the world’s leading video technology platform, today published the Brightcove Q2 2020 Global Video Index Entertainment and Media Edition, which found that OTT streaming of entertainment content continued to dominate, even as governments began loosening stay-at-home restrictions.",
    "id": "94c050c8-5f39-4f9b-bb58-c88e4eb0e5ac"
  },
  {
    "content": "I would have to say it's one of the.best burgers I had in a long time and their smash fries with rosemary, olive oil and\nGarlic were delicious and wish I had more of them!",
    "id": "b70771e2-95af-4302-a5ee-cf420e2812a2"
  },
  {
    "content": "You could ask some questions but since you can't have an answer yourself it is better to agree with the movie.<br /><br />'Twelve Monkeys' works as sci-fi, with some great images and a dark atmosphere, and it works as a thriller.",
    "id": "5c812cbe-f010-4b94-9fc4-1f978b4bcfc7"
  },
  {
    "content": "I rate this movie 8 out of 10.",
    "id": "fc09a9df-5247-460c-b484-59233e025cc6"
  },
  {
    "content": "Let’s delve into the role of bottom-up OKRs within the broader OKR framework, outlining actionable steps, best practices, and providing a strategic framework for their successful implementation.",
    "id": "31dfc75c-53ca-444a-bc6f-4a86ac595bbd"
  },
  {
    "content": "With me on the call are Jeff Ray, Brightcove's chief executive officer; and Rob Noreck, Brightcove's chief financial officer.",
    "id": "abd15c79-a234-4843-a842-fe07f0e69ba6"
  },
  {
    "content": "This complexity can obscure how small disturbances can lead to large-scale events.",
    "id": "9465310e-d63b-4c1e-af2f-432fc73f05ef"
  },
  {
    "content": "I ordered it with a side of rice pilaf and veggies and really enjoyed it.",
    "id": "ed2282c0-4eb5-4205-a172-bbdd5d7f5a4d"
  },
  {
    "content": "In project management, this bias can lead to unrealistic timelines, budget overruns, and unmet objectives, ultimately jeopardizing the success of a project.",
    "id": "b2d4c69c-f60b-4954-90a2-2d9ffee34c56"
  },
  {
    "content": "Extreme impact - Consequences are significant, often transformative.",
    "id": "04d7c400-cd43-4e72-857f-47c2d0bf755c"
  },
  {
    "content": "- Stay informed about advancements in automation and artificial intelligence that can increase efficiency.",
    "id": "af913045-cd15-4322-8c17-f828edd75997"
  },
  {
    "content": "You can still sense that same weirdness as in the Python's, but for me the directing is pretty much flawless though in its odd way of describing things it also makes some scenes strangely disturbing.",
    "id": "a6b284cc-c81d-43dc-8efd-5b25d54452d2"
  },
  {
    "content": "Ethical considerations demand accountability, which involves acknowledging mistakes and taking corrective actions.",
    "id": "2244b181-c647-45c1-a404-bbc44a8b54ff"
  },
  {
    "content": "One day, they take the dragon to the park.",
    "id": "e1004b1f-3631-4d63-b919-aa793b7965c2"
  },
  {
    "content": "#### 4.",
    "id": "9e3cfb23-e080-4c5f-9a49-d5233fedce1b"
  },
  {
    "content": "I luckily came up with the money but definitely want to see Cheyanne again at some point at this location and do something nice for her kindness.",
    "id": "4a22181f-56ed-48c6-86d5-23ac53aab7df"
  },
  {
    "content": "They have cards with pictures of animals, fruits, and colors.",
    "id": "e4d05860-efbf-48bb-a275-b63cf75eb60f"
  },
  {
    "content": "3 Top-Ranked Internet Stocks to Watch in a Challenging Industry",
    "id": "5fa41620-65ae-46e2-925f-4a2206ba554a"
  },
  {
    "content": "Where do I begin?",
    "id": "f306473c-d87f-4041-b903-37fac1af85c4"
  },
  {
    "content": "Deanna Durbin, then 14 and just under contract to MGM, made a short feature in 1936 which paired her with Judy Garland, a year younger, in the first film for both of them.",
    "id": "da6268aa-4142-4e0c-ac52-580d048afff6"
  },
  {
    "content": "Brightcove Inc. (NASDAQ:BCOV) Q2 2020 Earnings Conference Call July 22, 2020 5:00 PM ET Company Participants Brian Denyeau - Investor Relations Jeff Ray - Chief Executive Officer Rob Noreck - Chief Financial Officer Conference Call Participants Mike Latimore - Northland Capital Markets Steven Frankel - Colliers Lee Krowl - B.",
    "id": "d977571a-0f11-42f1-8897-e63b97179e9e"
  },
  {
    "content": "You will have leftovers.",
    "id": "770e3af6-575d-4d20-ae78-3960b9488e22"
  },
  {
    "content": "It's typically during the lunch rush.",
    "id": "25d92313-786f-4616-b8de-c169b1392c3b"
  },
  {
    "content": "This feedback will offer insights on the practical implications of the forecasts and help refine future forecasts.",
    "id": "b08b4c4e-31d4-42be-a6a6-e61f7fa71365"
  },
  {
    "content": "\"I'm Tom.",
    "id": "aa7706a8-3e24-45d5-b710-9a70e634d76b"
  },
  {
    "content": "The specialty discount retailer fell along with the entire sector after Target and Walmart gave out poor commentary for the full year.",
    "id": "b8f2e4f8-1ff5-4e9e-af55-59e43cdaeceb"
  },
  {
    "content": "Well,  I never should have gone here but let me vent.",
    "id": "19548036-2c01-4ab5-ba12-6ddc5e955fbc"
  },
  {
    "content": "Brightcove's (BCOV) CEO Jeff Ray on Q4 2020 Results - Earnings Call Transcript",
    "id": "cdfdaa7c-e775-4c90-95e1-5a50faa269bc"
  },
  {
    "content": "And realized that I left it at home I was so embarrassed I was digging for any change that I can find in my purse.",
    "id": "ab2c8f24-7561-406e-a57b-bdf29a1b78f4"
  },
  {
    "content": "Do the numbers hold clues to what lies ahead for the stock?",
    "id": "9d9eecad-518b-488c-9c6d-d37822523d24"
  },
  {
    "content": "All they know is that there is are a bunch of animals running around a city above them, the deaths began during 1996-1997, and twelve monkeys have something to do with it.",
    "id": "6eff76ad-a25f-4afb-bde0-f8e043f9771f"
  },
  {
    "content": "Happy hour specials are pretty solid, and we ordered several rounds of drinks and a bunch of apps to share.",
    "id": "eb262ae9-7392-40b8-8f1c-b7fba96f8868"
  },
  {
    "content": "Wicket Labs, a Seattle startup that provides audience data to online video providers, has been acquired by publicly traded video platform Brightcove.",
    "id": "eb5502ae-a20c-4b1e-8391-cff50c47cbb7"
  },
  {
    "content": "Mia gave Tom a big hug and said goodnight.",
    "id": "369f1eed-d490-447b-aed1-3007c0c7728a"
  },
  {
    "content": "Ben grabbed Lily's hand.",
    "id": "61ddeb9c-d2a1-435f-a748-b08903e38ab1"
  },
  {
    "content": "Though it has its confusing parts of the plot, it doesn't greatly interfere with your understanding of the movie.",
    "id": "152b4e27-e400-4f78-843d-ba07af7f3412"
  },
  {
    "content": "Sara says.",
    "id": "bdd2fcc6-fc91-4f27-af4a-4c8b14448b9a"
  },
  {
    "content": "They run to the truck and see a man with a hat and a shirt.",
    "id": "ee67358d-3368-407f-849b-563f11d7478a"
  },
  {
    "content": "He says, \"Don't cry, Mia.",
    "id": "2c1f4cf7-4e58-4db5-8c36-6e404dcaf6fc"
  },
  {
    "content": "In its 47th year, Luck Productions needed to quickly and easily pivot the annual event to a virtual 90-minute concert film segment, and called on Brightcove to stream the event to its dedicated audience after successfully live-streaming A Night for Austin last month.",
    "id": "06561377-c901-42f2-8898-2cd41e1cf934"
  },
  {
    "content": "And, yes, the green tea lived up to my expectations.",
    "id": "e02cc8e0-0a18-4e1c-bf99-d4438986f3a5"
  },
  {
    "content": "**Foundation**: \n   - Begin by establishing a clear understanding of the objectives of predictions and the information landscape.",
    "id": "7b6200c6-c569-4053-8d76-c9603b938e53"
  },
  {
    "content": "I am sooooo happy we finally have a CFA close to my house!!",
    "id": "0db09132-d7ca-44a1-b3fb-b38dea606f90"
  },
  {
    "content": "Koode helps the Malayali community around the world discover content from their homeland without geographical restrictions.",
    "id": "7eec6854-1651-49a2-af84-b4cdfac5cacf"
  },
  {
    "content": "It's a fascinating sequence, more so because of the most improbable occurrence of the names of the actors in both films: Madeleine Stowe plays Kathryn Railly who dons a blond wig and grey trench-coat and calls herself \"Judy Simmons\" while helping an \"insane\" man named James Cole; James Stewart plays a detective who tries to help \"insane\" Madeleine Elster who will later re-appear not once, but twice, first as brunette Judy Barton, and later, as Madeleine.",
    "id": "5f9d762b-3f43-4b0e-8eb6-1d347cd8b68e"
  },
  {
    "content": "She is still crying and holding her dress.",
    "id": "c0d48c84-f4e4-4329-a6c0-bef7935d910c"
  },
  {
    "content": "The dangerous animal saw Lucy and said, \"Hello, little girl.",
    "id": "5cc4c82b-1a94-418a-8297-0f29468db2f5"
  },
  {
    "content": "He was sad.",
    "id": "c3856985-a5a9-484f-a488-e0193a60c6a9"
  },
  {
    "content": "I don't know, I feel like this is one of the unfriendliest Subways I've ever stepped foot in.",
    "id": "75a7d8dd-3dcb-47cc-8e77-5b64766839fa"
  },
  {
    "content": "But hey if your audience is left wanting more then this movie has succeeded.<br /><br />I would really recommend anyone in Hollywood to look up Antonella Ríos who is an excellent Spanish talent (something hard to find now days with all the bad novela over acting).",
    "id": "715f7ee0-8caa-4bb7-91a8-555546a413cd"
  },
  {
    "content": "Lily was not sure.",
    "id": "330de157-7a39-489c-b31d-3fd9a8a8101e"
  },
  {
    "content": "Come from long line of gingers.",
    "id": "540561ca-2e5a-4378-92ad-152fca9bfffa"
  },
  {
    "content": "In the interim,  I notice the blonde.",
    "id": "6edb970d-187d-457a-8a6d-2a25bcb6fc43"
  },
  {
    "content": "Lily said, \"Yes, let's wait for the cars to stop.",
    "id": "534ca8da-7984-46b6-b555-01c939dcfefa"
  },
  {
    "content": "Inside, there were more shiny things to decorate the tree.",
    "id": "754db4f1-7cd7-4774-865a-b86e2a3b1cd8"
  },
  {
    "content": "They jog and run and jump and laugh with Sam and Lisa.",
    "id": "cf08d433-7a9e-4bb4-b51d-67c65dae2ec3"
  },
  {
    "content": "This store is my shiiiiiii!!",
    "id": "8e3cd1b6-0747-4993-b72b-c1d93df2a8b6"
  },
  {
    "content": "She said, \"well, it just depends...\".",
    "id": "6f6fa74c-5eba-457e-8f8d-d3b1168b8ff3"
  },
  {
    "content": "When Garland was unavailable Universal switched to Durbin.",
    "id": "10f361f0-7fc6-46a2-ac41-424caf0a1d01"
  }
]