[
  {
    "content": "Tandem Diabetes Care, Inc. (TNDM) CEO John Sheridan on Q1 2021 Results - Earnings Call Transcript",
    "id": "12321c54-77c3-4932-b7ae-beacb27b5bab"
  },
  {
    "content": "While they do carry a lot of other appliances that are not listed on Consumer Reports, I like to stick to highly-rated and well-tested products, which means that I usually go online to Amazon for appliances.",
    "id": "a27b1db6-33c4-4d4a-b362-457070dcd1bc"
  },
  {
    "content": "He decided to launch the missile and see how high it could go.",
    "id": "6de016ea-19d7-4da9-b56f-abad4eaf2e40"
  },
  {
    "content": "She told her mom the whole story and asked if they could look for the pipe together.",
    "id": "b95185ee-bd9e-43bf-986f-57d02ff47825"
  },
  {
    "content": "Suddenly, a three year old came into the room.",
    "id": "00cb71cb-8189-4fa0-a215-39950193564f"
  },
  {
    "content": "Community Financial (TCFC) cheers investors with a 17% sequential hike in the quarterly cash dividends.",
    "id": "eb3ff1be-bec5-46c9-ac78-fb35208da54e"
  },
  {
    "content": "Tandem Diabetes Care, Inc. (TNDM) delivered earnings and revenue surprises of -800% and 0.65%, respectively, for the quarter ended September 2022.",
    "id": "bfa14b1a-cf15-495e-800c-57d12d551163"
  },
  {
    "content": "- **Leverage Technology**: Use marketing automation tools for decisive customer engagement and data analysis.",
    "id": "6b82bd01-1dba-4afb-806b-2cc88e284aaa"
  },
  {
    "content": "It would be safe to assume this film could apply to the life in many countries, but it particularly reflects Finland as it is, and pretty damn well.<br /><br />One comment about the acting: Being the fan of Finnish cinema I am, I've never seen any of these actors on any other movie, but I found the acting in this feature right next door to perfect overall.",
    "id": "7f4e0754-39f3-4e33-b134-499081a9f9bb"
  },
  {
    "content": "Bob liked being outside in the sunshine.",
    "id": "839323bf-7869-4f6f-9e00-0e7939a5924c"
  },
  {
    "content": "What's next for the stock?",
    "id": "1b30ccfb-8a1a-4916-ae9b-6762f200f393"
  },
  {
    "content": "The only thing that prevents this from being a really great movie is Burke--she's not a very good actress (it's no surprise that this has been her only film) and it hurts the movie.",
    "id": "d6b0c5df-7848-4e98-bccf-dc230149835b"
  },
  {
    "content": "The boy never found his drum again.",
    "id": "cb73def9-5f8f-4233-b8c1-a34f5825d729"
  },
  {
    "content": "I've used Enterprise before but never this location.",
    "id": "304e4a07-6832-423f-8f6c-33a96c200986"
  },
  {
    "content": "Not only does Meena Kumari age and fall ill but listen carefully to Lata's voice.",
    "id": "6f04c594-106b-485e-a581-2166c9b514ad"
  },
  {
    "content": "I felt the look on the other patrons faces was repayment enough and I left.",
    "id": "d378e690-a76b-47e8-8d70-4ecc3c5c90ea"
  },
  {
    "content": "Cultural Alignment\n1.",
    "id": "3e9286dc-367b-43ba-88e9-3683947bc2a3"
  },
  {
    "content": "- **Set measurable goals** that correlate with enhancing community-oriented culture in the organization.",
    "id": "904c74ec-60ac-4808-84a2-18b5218be54e"
  },
  {
    "content": "Continued adoption of Tandem Diabetes' (TNDM) t:slim X2 technology and international expansion of the Control-IQ technology add to the company's solid second-quarter performance.",
    "id": "d54894f6-94ba-4d91-a6ab-a05d275c8f79"
  },
  {
    "content": "It was very busy at lunch time but every time I hit the button to start my order, the \"red button activated\" message came up but then disappeared a few seconds later taking me back to the start--almost as if someone inside cleared the order.",
    "id": "15961954-91da-43e3-b678-470ab590c116"
  },
  {
    "content": "If it was in the box the food prep person put the burger in, what else was laces with a sprinkle of hair?",
    "id": "90ca647f-caf7-4127-8955-cf7c98b2b8be"
  },
  {
    "content": "Sugary, buttery yum yum.",
    "id": "7530f51a-d23b-48fe-9784-88c5af6b77d7"
  },
  {
    "content": "Huge.",
    "id": "02b30e91-0763-47c3-857b-ea0e8011d9c6"
  },
  {
    "content": "This was a very good movie that could appeal to many.",
    "id": "cca7daba-24a3-4e15-9783-8abfa378f658"
  },
  {
    "content": "Trying to find a fish that wasn't fried, butter ladened, or swimming in cream sauce was difficult.",
    "id": "f9d5877d-c98c-48ac-95c3-d795e3cd4742"
  },
  {
    "content": "Mixed Q4 2021 and Q1 2022 earnings, coupled with the overall market downturn, have created an extremely low valuation relative to its high-growth peers.",
    "id": "2815e262-d806-4dc7-8bd1-0a152d0e0696"
  },
  {
    "content": "**5.2 Leadership Training**  \nProvide training for leaders on the importance of feedback, delving into how to harness it effectively to foster engagement and drive performance.",
    "id": "24551e97-3e22-495a-ac03-d07a182f8070"
  },
  {
    "content": "LAZY, RLGY, WSM, BKR, and TCFC have been added to the Zacks Rank #1 (Strong Buy) List on July 16, 2021.",
    "id": "75655c95-bd7b-41c6-ad42-d9a86c00290d"
  },
  {
    "content": "The Company posted EPS of $0.09, a turnaround from a loss of $(0.15) and beating the Wall Street estimate of $0.06.",
    "id": "21c67999-c6b7-4e02-97fe-a3622ab62904"
  },
  {
    "content": "Great viewing for art cinema lovers.",
    "id": "0ed7dde5-ef16-4554-bd6b-e21edbdb7db1"
  },
  {
    "content": "Bette Midler is again Divine!",
    "id": "3fb49900-ff04-4dd7-94aa-7e04967e1daa"
  },
  {
    "content": "I'm not sure why, it was the middle of the day/dinner time.",
    "id": "e07233f0-9959-41c5-8d9f-e367920c5a66"
  },
  {
    "content": "2.",
    "id": "6f5f90c1-25f6-4697-98ce-1abb16013c92"
  },
  {
    "content": "The place is tidy, the bathrooms are clean, and staff is attentive and prompt.",
    "id": "0f2c4445-4237-4f86-bfcf-3f51ba4fc692"
  },
  {
    "content": "- Gather input from various stakeholders, including employees, management, and external experts.",
    "id": "9cab9f16-08ac-441a-b770-bdc8f2f30404"
  },
  {
    "content": "He had a great lazy summer day.",
    "id": "b605a4b4-e483-414b-937c-174ae8fda0e6"
  },
  {
    "content": "**Situation Analysis**\n   - **Market Research**: Evaluate industry trends, consumer behavior, and competitor actions.",
    "id": "c52ed45f-616c-4a12-ae9c-c3ad57779117"
  },
  {
    "content": "and unfortunately, in my experience, Home Depot does not carry a lot of the top-rated appliances.",
    "id": "ffc63a10-1749-4e6d-80f0-28dc28b95414"
  },
  {
    "content": "Some of its poignant scenes are filled with sublime emotional intensity, like the instance, when Meena Kumari refuses to say \"YES\" as an approval for Nikah (Marriage Bond) and climbs down the hill while running berserk in traumatized frenzy.",
    "id": "d09e376f-33bb-472b-8d44-ed850d9bb31f"
  },
  {
    "content": "Tandem Diabetes (TNDM) is witnessing strong customer retention, driven by the impressive positive response from the Control-IQ technology.",
    "id": "e596668d-2c2e-4189-a0bd-504e85e72250"
  },
  {
    "content": "Fox, and Kathleen Turner at the time the movie was made.<br /><br /> It's not superbly written - e.g., the characters' lines are not particularly memorable.",
    "id": "468ba1c3-95d2-46cd-8a4a-c445d3ad2c5e"
  },
  {
    "content": "The child eagerly spun the piece and thought that it was the most incredible thing ever!",
    "id": "be13cdc0-6af0-46a3-a838-698547f36ca9"
  },
  {
    "content": "Stated the order a second time and she rang it up incorrectly and then asked what the other half of our order was.",
    "id": "cb7abd09-9d97-4b95-acc2-a0dfde2e9f0d"
  },
  {
    "content": "Jimmy and Drew did a fine job as a young love-struck couple suffering from Jimmy's Bosox \"jones\".",
    "id": "b38c09c1-3265-4072-be0b-76c03b69ce1a"
  },
  {
    "content": "The end.",
    "id": "09bf7261-6d6b-4efe-8510-6a2693618ebc"
  },
  {
    "content": "Even then it comes second to this masterpiece.",
    "id": "10008e14-3308-44df-b211-56c67b9f6ef0"
  },
  {
    "content": "The Company is one of two named institutions from Maryland of the 35 total institutions named to the Class of 2021.",
    "id": "091ac77b-7c2e-4a43-8926-8bb8bf31fc30"
  },
  {
    "content": "### 4.",
    "id": "332e8c70-9769-4fb2-b274-aef14b67ad20"
  },
  {
    "content": "Shared Responsibility and Leadership**\n\n#### **Lesson:** Shared Leadership Models\n- **Actionable Step:** Explore shared leadership frameworks where responsibility, decision-making, and accountability are distributed among team members.",
    "id": "19d42dd6-1414-49bd-bbbe-00282cd3933d"
  },
  {
    "content": "The pizza we received was made poorly also.",
    "id": "96f80afb-fb6a-4a15-93d2-33bea6bc0ba6"
  },
  {
    "content": "**Survival Mechanism**:\n    - Early humans lived in environments filled with challenges, such as predators, environmental changes, and competition for resources.",
    "id": "9c21d5d1-3add-4ade-8e1d-d28e9cdfa60a"
  },
  {
    "content": "He looked everywhere but couldn't see anything special.",
    "id": "9abb0628-4191-425d-b5a9-7b64a0ecf631"
  },
  {
    "content": "Now he was able to turn off the lights with a flick of the switch.",
    "id": "3c4e41d2-436d-40f8-b728-04f2d7a4b678"
  },
  {
    "content": "In the film Kongwon-do ui him it features a relatively intimate look into the meaningfulness (as well as general meaninglessness) into the lives of various Koreans; empty people seeking ways to fill themselves, enjoying the escapism of nature.",
    "id": "deca128e-e7a5-4960-9d8d-a5c8d5f5c068"
  },
  {
    "content": "What's next for the stock?",
    "id": "5b0a61fa-7fbf-4a71-ab10-c6f71d5072df"
  },
  {
    "content": "He laughed and screamed and before he knew it, his mom was calling him home.",
    "id": "910cbcf5-b677-4cdf-85d9-de0656e88854"
  },
  {
    "content": "**2.",
    "id": "892c8f79-f328-431d-8108-39ab8740474d"
  },
  {
    "content": "Great delivery times.",
    "id": "f62031c7-183f-49f1-913c-4c2ca5e701ea"
  },
  {
    "content": "I first saw this movie when I was about 10 years old.",
    "id": "dfa2909c-0ed5-4e99-8c28-6d1f03a0757a"
  },
  {
    "content": "**Investor Behavior**: Analyze how the dividend yield influenced investor behavior at the time.",
    "id": "7a99c6c0-bd15-47b8-8142-609a41c69e92"
  },
  {
    "content": "Especially the scene when Anna's dad comes into the paperhouse trying to kill her is a bit short.<br /><br />Now to the plot.",
    "id": "1fdee04f-b790-4e57-9912-1584c7fcca14"
  },
  {
    "content": "Once there was a bear named Bob.",
    "id": "7b5f5e1f-9c0b-466c-8478-59b7f5e7c0f0"
  },
  {
    "content": "Once upon a time there were two friends, a shy kitten and a happy bunny.",
    "id": "2320ae22-8079-46e9-b26c-7838febcccef"
  },
  {
    "content": "The bunny jumped back in surprise, but the kitten was so shocked that he couldn't move!",
    "id": "35a99400-f239-4736-80e3-dda478fefe4c"
  },
  {
    "content": "It is hard to believe that the script was originally written that way, but the end product is better then I expected.",
    "id": "cb52fd01-690a-4882-940c-e3224bd827ed"
  },
  {
    "content": "The products and customer service here is fantastic.",
    "id": "44f0af61-c884-4e80-aece-56811ea90b74"
  },
  {
    "content": "Thank you!",
    "id": "e03e2cf3-446a-45b2-8c57-6dd40510ace3"
  },
  {
    "content": "The end.",
    "id": "1a498e49-98d5-49fa-819d-253eae5449d6"
  },
  {
    "content": "She held her stretched penny high for everyone to see and was filled with joy.",
    "id": "3d67f88e-f915-4868-9e64-5ad87eacac3b"
  },
  {
    "content": "Anyway, when I pointed out the mistake my server said she could not take back or refund the drink.",
    "id": "03b7dbcf-4197-4dc5-a207-fc17583033a8"
  },
  {
    "content": "Tandem Diabetes (TNDM) reports better-than-expected revenues for third-quarter 2021 as strong domestic and international pump shipments drive the top line.",
    "id": "f699df88-9fa6-41b9-b08b-946f54669251"
  },
  {
    "content": "As a lover of the surreal (in art and film) I was pleased to discover this film on IFC.",
    "id": "ba699591-36d4-44f1-9b5a-82ba8f12783e"
  },
  {
    "content": "Mia was very happy that she found out where the impressive vine ended.",
    "id": "29bcaff7-3357-4623-8e44-f152e9eca457"
  },
  {
    "content": "The next day, the people gathered again around the swing.",
    "id": "7e63d955-1e33-4367-a914-3aa466c1dfcb"
  },
  {
    "content": "It's interesting at the very least.",
    "id": "1433e056-893a-4e6f-a88f-9ccb5bdef377"
  },
  {
    "content": "A strategic framework that encompasses culture, leadership development, performance management, and community engagement can ensure these lessons are not only learned but effectively operationalized in today’s businesses.",
    "id": "24ee8dc2-994c-42b0-91d6-680723ea5f40"
  },
  {
    "content": "Get prepared with the key expectations.",
    "id": "add80a0a-bd97-40f8-9c7a-ab8afe25235d"
  },
  {
    "content": "One day, a scientist wanted to test it.",
    "id": "457d1692-58d9-43a4-9f27-6207c97ffcf8"
  },
  {
    "content": "$100 dollars later, the food was a waste, the service was non-existent, and the beer used to be good when you could get what you ordered.",
    "id": "e77417b4-cada-415d-b8d2-d8911373c39b"
  },
  {
    "content": "Tandem Diabetes Care, Inc. (TNDM) CEO John Sheridan on Q3 2020 Results - Earnings Call Transcript",
    "id": "44d627b9-6c41-453e-8ea2-3e675c53cc81"
  },
  {
    "content": "The AMF Medical acquisition will help Tandem (TNDM) advance with its sustainability objectives by offering an additional pump that minimizes electronic and battery waste generation.",
    "id": "c210c5c0-110d-460c-9687-2366056261e4"
  },
  {
    "content": "One day, he mentioned a secret.",
    "id": "b839bc39-5ac1-4ac3-a214-a81bc27d1ac9"
  },
  {
    "content": "**Sustaining Momentum**:\n   - Regularly update the organization on progress towards diversity goals and continue to promote the importance of inclusivity as a shared value across the organization.",
    "id": "65bf462c-14cd-4591-8473-3d34886a4f4a"
  },
  {
    "content": "Community Financial (TCFC) delivered earnings and revenue surprises of 3.77% and 3.08%, respectively, for the quarter ended March 2022.",
    "id": "e6938490-d440-4af9-9ecb-12691a202095"
  },
  {
    "content": "At the bottom of the well, she found a little fairy.",
    "id": "312a9ec8-0c6a-4a5e-a359-66374179c688"
  },
  {
    "content": "Her voice is as beautiful as ever and will truly impress you.",
    "id": "a738ceb0-9d17-4e3d-8a8c-3cd4dce557bd"
  },
  {
    "content": "I'm posting before and after pictures.",
    "id": "3d060216-ed3e-4e14-9f70-8c0c6085af05"
  },
  {
    "content": "He meets up with his wife (Cybill Shepherd) and friend (Ryan O'Neal) and his daughter, who is now grown up.",
    "id": "0bbc416b-4714-4630-8287-fd729ee4c260"
  },
  {
    "content": "### Conclusion\n\nAddressing declining employee engagement and productivity is a strategic endeavor requiring a systematic and considerate approach.",
    "id": "f5b72054-df5f-4b2c-9fe0-def02429b08a"
  },
  {
    "content": "And what a directorial debut by Bernard Rose!",
    "id": "b7fc8ba6-157b-46ac-b574-7e0b79691985"
  },
  {
    "content": "### 3.",
    "id": "b7f442fa-0f09-409a-b194-d7c0cecad6bb"
  },
  {
    "content": "Tools like moving averages can help spot trends in dividend growth.",
    "id": "84d59eda-51cd-4054-b6a0-0fa35950d3f3"
  },
  {
    "content": "He lived in a pretty meadow filled with wildflowers.",
    "id": "8d01296a-2181-472c-96a3-34f86fc06e17"
  },
  {
    "content": "What's that sound?",
    "id": "ddf63f31-af6f-46d8-bc1f-8dc4152d93bf"
  },
  {
    "content": "Tandem Diabetes (TNDM) defers $0.6 million of United States pump sales as a result of Tandem Choice.",
    "id": "aead4f0a-1fdf-4954-837d-039166089d63"
  },
  {
    "content": "Just don't expect the next Bladerunner.",
    "id": "74c7c660-74bf-409e-bea6-d6ee24b93de9"
  },
  {
    "content": "The Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style.",
    "id": "20541530-17c1-41e7-b005-751b6694e269"
  },
  {
    "content": "I rate this one 7/10.",
    "id": "6496c266-e04c-4aba-b130-8caba8a490f2"
  },
  {
    "content": "I ordered a chicken quesadilla only to receive a quesadilla with three strands of chicken in the entire quesadilla!",
    "id": "181b7339-363a-418f-922d-a99e6bda105e"
  },
  {
    "content": "SAN DIEGO--( BUSINESS WIRE )--Tandem Diabetes Care, Inc. (NASDAQ: TNDM), a leading insulin delivery and diabetes technology company, plans to release its fourth quarter and full year 2022 results after the financial markets close on Wednesday, February 22, 2023.",
    "id": "68693cc1-9b24-4964-be9a-1fa8ab199426"
  }
]