[
  {
    "content": "But critics charge it isn’t necessary and will hurt borrowers’ ability to tap into low rates.",
    "id": "912c8aa7-c064-47b8-9861-31aa2e721819"
  },
  {
    "content": "Positive Q3 results from Volkswagen and P911.",
    "id": "c69dd8bd-2c90-4615-84f9-2f7c1ac60ddd"
  },
  {
    "content": "**Adjusting Consumption Taxes:**\n   - Utilize consumption taxes strategically—temporarily decrease taxes on essential goods to mitigate immediate inflation pressures on consumers.",
    "id": "ea4ad761-36c1-4623-ac39-9fbc9efb1894"
  },
  {
    "content": "Sam had a pocket.",
    "id": "a60e4e09-995c-4d3c-8eb5-b5004f6573ed"
  },
  {
    "content": "Yes cute childish jokes that made our car laugh.",
    "id": "5013b705-e094-429c-a191-3b8a346c4f4f"
  },
  {
    "content": "### Common Denominators in Organizational Workflows\n\n1.",
    "id": "ce3ce94e-7190-4f93-abf3-e3ec8081d64c"
  },
  {
    "content": "!",
    "id": "e394cd16-e1f3-4b36-a829-866411d5d1a6"
  },
  {
    "content": "would choose a quick burger over this restaurant.",
    "id": "adc5a900-d561-4b54-a90f-00a030e5ea5b"
  },
  {
    "content": "The little girl was excited, so she stepped forward and carefully picked it up.",
    "id": "a427359c-45c6-4769-a967-0c66480f9db2"
  },
  {
    "content": "Zero stars out of 10, I wish there was a negative scale in order to appropriately rate this pile of crap.",
    "id": "1abf3b96-64fc-4a8f-a5ae-fc08a9b21c32"
  },
  {
    "content": "3.",
    "id": "78260e34-15ea-4872-8416-f86d5a557221"
  },
  {
    "content": "HomeStreet (HMST) delivered earnings and revenue surprises of 19.47% and 3.54%, respectively, for the quarter ended March 2021.",
    "id": "f57b97a3-f4c7-4827-85b9-b43ab6c8dfa7"
  },
  {
    "content": "**Implement Meeting Protocols**:\n   - Establish protocols for meetings where all voices are heard.",
    "id": "94d4c910-7e6a-4f47-b3c6-f562dbe120ba"
  },
  {
    "content": "U.S. average rates on long-term mortgages rose this week though they remain at historically low levels",
    "id": "2563d6b9-eefa-47d3-b101-6f7ce4fc8667"
  },
  {
    "content": "Is HomeStreet (HMST) a great pick from the value investor's perspective right now?",
    "id": "1773344a-d869-49d8-aabd-16d5cdbfdbd1"
  },
  {
    "content": "Once upon a time, there was an orange passport.",
    "id": "3da2364f-6137-4950-a327-5e63e34fb431"
  },
  {
    "content": "If you were walking down the street and saw a $100 bill just sitting near the curb, would you pick it up?",
    "id": "995fc3b8-62cf-402a-b13c-2db7687b661e"
  },
  {
    "content": "I could have drank like......at least a bottle and a half (which means two) bottles of wine waiting for the tow truck for 4 hours after my car decided to break down on 95.",
    "id": "9bcda5fd-7669-4df2-847f-cca71a96c0ed"
  },
  {
    "content": "She asked Sal where she had got the pill from, but Sal would not tell her.",
    "id": "19d9e53d-82ab-47b4-a2c3-2fd6eb7e7863"
  },
  {
    "content": "Sure, that sucks too, but at least you'll get the blood and guts you expect.<br /><br />The only reason I can see for anyone praising this crap is because they feel they're supposed to.",
    "id": "3291fa55-ffe1-42a2-9e24-0875499a02df"
  },
  {
    "content": "The real story, then, is how society (and the world) treats the different, those who have different accents, different beliefs, than we do and how we treat what they say as suspect.<br /><br />It's difficult to hear the phrase \"A dingo took my baby!\"",
    "id": "54bf83fa-d11b-4aa5-8004-0ea831763f64"
  },
  {
    "content": "- Conduct diversity training focused on cultural awareness and sensitivity.",
    "id": "e05db036-cd8b-43a1-8757-01dc877bc809"
  },
  {
    "content": "**Anonymity and Confidentiality**\n   - Assure respondents that their answers are confidential and anonymous to promote honesty in responses.",
    "id": "298942e3-54e7-43ab-bf49-7cd41b4e72f6"
  },
  {
    "content": "She did and the sauce was perfect.",
    "id": "b9e2a701-0620-4e13-b889-0ce616fa67bf"
  },
  {
    "content": "I ordered a Big Mac, fries and a Coke.",
    "id": "16319274-a944-47a3-a5c1-0cb77c4cbac1"
  },
  {
    "content": "It wanted everyone to be happy and have fun.",
    "id": "49e71738-18b4-4204-9316-cbe0c86a6b98"
  },
  {
    "content": "As illustrated with real-life examples, effective execution at each stage not only establishes a recognizable and respected brand but also fosters deep emotional connections with customers, ultimately leading to increased loyalty, advocacy, and market success.",
    "id": "9b730db6-d302-4f67-bc58-3a083aafd1ca"
  },
  {
    "content": "The dinosaur was so excited and said yes.",
    "id": "8978041f-fb2d-44d5-aad1-19889951c4ed"
  },
  {
    "content": "He decided to zip out of the box.",
    "id": "746c9ba6-9b7c-4b55-a668-c4d3e564f45d"
  },
  {
    "content": "When established businesses provide undue financial support or advantages to new ventures, it can create imbalances in the market that stifle competition and hinder the natural process of creative destruction that drives innovation.",
    "id": "0a8d24e6-e1a1-4dd0-ba2c-de25a8f5b814"
  },
  {
    "content": "This was all about fooling the public to make enough money after opening day to equal or do better than it cost through marketing.",
    "id": "e9ee9e16-1b99-4a27-bb3a-5f2386166fb6"
  },
  {
    "content": "Uhm?",
    "id": "766d72ea-b26a-4ad1-9c4b-3a063bb0aec5"
  },
  {
    "content": "So sure, this a fast-food sandwich chain and nothing ultra remarkable but I have to hand it to this little shop here in the SoBro neighborhood in downtown Nashville.",
    "id": "a16687fd-afe4-4a74-8527-e800062b22b1"
  },
  {
    "content": "They always liked cooking together.",
    "id": "df8ddc9c-5e1c-467e-af84-7d8d30769186"
  },
  {
    "content": "The old man got angry and started shouting at the other man to leave but he wouldn't go.",
    "id": "9c1e1400-fa58-4a6e-91b1-6509b53c2238"
  },
  {
    "content": "The Original Dukes of Hazzard was a kid safe, Hemi powered, show of fun that parents didn't have to worry about teaching their kids George Carlin's seven words.",
    "id": "5ffbf61b-49a8-4d55-b2d0-c10083b99f22"
  },
  {
    "content": "HomeStreet (HMST) has seen solid earnings estimate revision activity over the past month, and belongs to a strong industry as well.",
    "id": "fe8cec5f-0f6b-47a1-aa98-69f7711de267"
  },
  {
    "content": "This is the only time I saw so much clevage and was not turned on.",
    "id": "85a59c0e-a4b0-4f34-996f-88081793e1d1"
  },
  {
    "content": "**Establish Ethical Guidelines**:\n   - Codify ethical principles into a formal code of conduct that guides decision-making, ensuring consistency across the organization.",
    "id": "41992268-3f86-4175-bfcd-94f1308dd841"
  },
  {
    "content": "Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.",
    "id": "58092838-4be0-4271-9ace-68387c8016a5"
  },
  {
    "content": "The acting isn't brilliant but to give everyone credit they put some effort into it, lots of exaggerated facial movements & some serious overacting means it's never dull, oh & the three birds in Dr. Hackenstein are fit if you know what I mean.",
    "id": "31a6d88c-752d-4468-bd39-b8980c24ecd3"
  },
  {
    "content": "He refunded my money and I left.",
    "id": "d3df4783-eb73-47d3-a013-53de083067d1"
  },
  {
    "content": "It's hard to make sense of them all.",
    "id": "9bef14c1-d2f6-4fd0-926f-af4b9f742aab"
  },
  {
    "content": "The fish wanted to help and so it asked other fish to join it.",
    "id": "2bc85ec4-ba34-4c81-b8b9-394d89271324"
  },
  {
    "content": "For instance, during economic downturns, many may hold onto their jobs longer, while expanded job opportunities during growth periods can encourage job changes.",
    "id": "f99b9710-9e91-4a19-b368-570ffc4a954a"
  },
  {
    "content": "She plays pale, undeveloped character of Bruce's girlfriend Grace, and stays completely forgettable in this movie.",
    "id": "68db9fa1-5765-4818-a8d2-632c8a47a75c"
  },
  {
    "content": "**Benefits Packages**\n   - **Health and Wellness Benefits**: Offer comprehensive health insurance options, including mental health support, to address employee healthcare needs.",
    "id": "633720dd-ae19-4726-a038-6d1ea3f1b7cc"
  },
  {
    "content": "I watched this as a curiosity (as the other parts in the series) and now I know how insignificant trash these are.",
    "id": "2c4ea2c1-b6de-4c5c-9311-e5290b228de8"
  },
  {
    "content": "Three brave friends ran to rescue the kitten.",
    "id": "30854363-dfc3-4124-a0d9-0a1b07a8e832"
  },
  {
    "content": "I'll be back to location for future home needs.",
    "id": "bd340405-3d63-4c39-8058-18b6bac8f4bf"
  },
  {
    "content": "Up to 40 million Americans could lose their homes in the pandemic.",
    "id": "84fadbe2-790c-497b-8c38-5f7f06e1c8c8"
  },
  {
    "content": "He tirelessly searched the forest for the best berries, and found lots that were ripe and sweet.",
    "id": "07b8b98c-9eb0-4deb-8ec5-2ea164078b25"
  },
  {
    "content": "Everyone called it \"Super Rod\".",
    "id": "6feaede1-c3ad-4441-bed4-e555fb2548b9"
  },
  {
    "content": "Interest rates on home loans are still extremely low by historical standards, and that’s helping to create fierce competition in the real-estate market.",
    "id": "fa7b4d3a-6183-41eb-8710-ec786956b1f8"
  },
  {
    "content": "Earnings & Valuation This table compares Parke Bancorp and HomeStreet’s top-line revenue, earnings per share and […]",
    "id": "52f16f17-5a67-493c-a258-8b40912ec32d"
  },
  {
    "content": "She smiled, because she felt so good in her new clothes.",
    "id": "d2f3b1b1-1178-440b-b616-ec067c7411b3"
  },
  {
    "content": "Wedbush analyst D. Chiaverini now expects that the financial services provider will earn $3.22 per share for the year, up from their prior forecast of $3.21.",
    "id": "3379eb16-d73b-4b5a-8c82-0d6a17fd3f1c"
  },
  {
    "content": "- Engage in scenario planning to prepare for potential financial disruptions.",
    "id": "83a84c82-9079-4496-b623-abb92f2df459"
  },
  {
    "content": "Since then I have become a very big Ewan McGregor fan but I still can't bring myself to forgive this movie's existence.<br /><br />My sister has always been a huge Jane Austen fan and because of that, I have been subjected to various of the classics, Emma being one of them.",
    "id": "13f602be-13ea-4266-abff-acb70a362ac4"
  },
  {
    "content": "Even though it was a weekday lunch during Williamson County spring break, we knew there might be a crowd... and sure enough, it was nearly impossible to find a parking space.",
    "id": "b2ff7f5e-4a0e-4d03-a172-3e5a45fed2d1"
  },
  {
    "content": "Wonderful drive through experience.",
    "id": "94c5161b-f493-43c8-b877-26322c13c82b"
  },
  {
    "content": "I was surprised when I saw this film.",
    "id": "af9664fd-10a2-4387-86fa-6733b4651013"
  },
  {
    "content": "Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.",
    "id": "cff5563e-d678-453f-ac8a-dda931dbc178"
  },
  {
    "content": "Members may agree superficially without engaging in meaningful discussion, leading to disengagement and dissatisfaction.",
    "id": "611b04c6-2e01-4100-9a40-6e7797c5d662"
  },
  {
    "content": "They even tacked some surprisingly unfunny out-takes at the end, in the further hope that this would lessen the bad taste.",
    "id": "b19187e4-d2a3-4ebb-b477-0b1a4b2511bf"
  },
  {
    "content": "I could literally hear the folks over at High Times magazine receiving their jollies over the enormous \"buds\" that litter this picture.",
    "id": "6cba2d8a-00e4-4877-9b68-cdbb05e9113c"
  },
  {
    "content": "HomeStreet, Inc. (HMST) CEO Mark Mason on Q3 2021 Results - Earnings Call Transcript",
    "id": "e04d500e-6013-4fe1-87c2-5ba06c126519"
  },
  {
    "content": "I'm not talking about the moral code / political opinion of the company, but the fact the chicken remains stupidly addictive while also being stupidly unhealthy.",
    "id": "94a2be9a-5735-4ab2-ac77-1ba29f65b34f"
  },
  {
    "content": "Really???",
    "id": "7155688c-b56b-487f-94e4-4b9a3cb17314"
  },
  {
    "content": "He looked around and saw a dog.",
    "id": "c3016e70-8912-43eb-b293-868fc452a709"
  },
  {
    "content": "4.",
    "id": "dcc806f9-a6c4-429c-b1a8-45a2ebbec0a3"
  },
  {
    "content": "**Passion**\n   - **Description**: Passionate candidates tend to be more engaged, motivated, and committed.",
    "id": "b180823b-ae50-4af6-b0ad-abdcb4b19b2d"
  },
  {
    "content": "Not funny.",
    "id": "1713a963-eb3a-41c7-b782-b82f98c26afd"
  },
  {
    "content": "### Goal Setting Techniques\n\n1.",
    "id": "0fc25439-7196-46a1-be47-ab9fae71d3a7"
  },
  {
    "content": "Almost every demographic group would be bored by this trivial, TV-movie-quality production.",
    "id": "a60329af-94a8-4ee9-b0ce-7f6dc7624b99"
  },
  {
    "content": "Beautiful Jessica Simpson (as Daisy) fills her skimpy short well - but, even her arousing pink bikini can't beat off the competition from a dormitory full of bouncing, topless coeds.",
    "id": "b7acb2d8-63fc-4548-be4f-69a8ed9d7caa"
  },
  {
    "content": "It was a small girl, staring at it from far away.",
    "id": "2c3c4c90-fcdc-4933-8889-929e020c437a"
  },
  {
    "content": "##### B.",
    "id": "bdb71a25-ac58-49c0-bab8-7ff27629c503"
  },
  {
    "content": "He wanted to keep the trophy all to himself and not share it with Tim.",
    "id": "7496cdd8-f32d-433c-b084-6f368117bd3d"
  },
  {
    "content": "I put the DVD thinking \"oh man, this is gonna be sick.\"",
    "id": "32e657e6-d9ad-4f79-add2-7187fe38529e"
  },
  {
    "content": "Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks.",
    "id": "30d277af-44a4-4267-a385-75a1bbad7c33"
  },
  {
    "content": "Ensure all teams understand how their roles contribute to overarching goals.",
    "id": "88097c59-bbaf-47b2-abab-660214417765"
  },
  {
    "content": "HomeStreet, Inc. (HMST) CEO Mark Mason on Q4 2020 Results - Earnings Call Transcript",
    "id": "8f73ef79-d4c1-4c9b-a18c-ee49bc82a50a"
  },
  {
    "content": "Spurred by ultra-low mortgage rates, home buyers rushed last month to snap up a limited supply of existing houses, causing the pace of purchases to jump by a record-high 24.7%",
    "id": "edc0b2d1-770f-43dd-9054-b08c61f36295"
  },
  {
    "content": "It's quite good.",
    "id": "d9253c09-f05f-4604-84f2-5ea809c6baa8"
  },
  {
    "content": "HomeStreet, Inc. (NASDAQ:HMST) is a financial services company headquartered in Seattle, Washington, serving consumers and businesses in the western United States and Hawaii through its various operating subsidiaries.",
    "id": "fdfd84d1-ccb4-4821-b8f9-bb64db9df80b"
  },
  {
    "content": "(However, his later films do improve.)",
    "id": "9a42a192-c0a3-43c3-b5ff-821cb948106c"
  },
  {
    "content": "#### **5.3.",
    "id": "4d7be7e6-6de7-4c09-b953-9ea5dfa36096"
  },
  {
    "content": "The Federal Housing Finance Agency is also improving their online multifamily property loan look-up tools for tenants.",
    "id": "044133d3-ff09-4323-a61c-d28d67c8053a"
  },
  {
    "content": "Now homeowners are exploring their options as some forbearance periods end.",
    "id": "dcec37f3-12ed-4b84-baeb-56742f42e500"
  },
  {
    "content": "The screen t's were never present on the dukes!!",
    "id": "c27e81f3-d9cf-418c-89c1-ba96fc4b4643"
  },
  {
    "content": "Joe started to feel sad.",
    "id": "6563ddd8-4a1d-4124-a7f6-15c814b8b470"
  },
  {
    "content": "The online ordering couldnt be easier and I love the settings you can save for even faster ordering.",
    "id": "cbc8cd95-521f-4a67-be8d-1c23f4a1da5c"
  },
  {
    "content": "The ant worked hard to keep it safe.",
    "id": "a64bd783-c448-43bd-a8a0-56bf9d2702c0"
  },
  {
    "content": "Since this is 100% fake and nobody got hurt during its production, it IS legitimate to make such a film.",
    "id": "f1a95560-b9f3-41ea-8181-c97fe835e673"
  },
  {
    "content": ".for it to be over.",
    "id": "20037de6-6b8d-46e8-aab2-9d4af40edc01"
  },
  {
    "content": "I can't wait to rent the sequel, China O'Brien II.",
    "id": "b8c333ca-121f-452a-a869-32e98bce4754"
  },
  {
    "content": "They always treat my car problems with an eye towards helping me, not selling me.",
    "id": "4a8edf1b-8886-4f60-838c-d50f4e79aa2e"
  },
  {
    "content": "5.",
    "id": "308bb2bc-c683-482d-8a01-6bcfeab61fc1"
  },
  {
    "content": "The food was on point here, but it was lacking the smiling and friendly service I am used to at other locations.",
    "id": "22373ab1-6048-4f1d-840b-a46aa8181ec5"
  }
]