[
  {
    "content": "I also tried the mango passionfruit unsweet tea which was pretty good.",
    "id": "831d4062-1555-408e-9876-efb8ca2fa7a2"
  },
  {
    "content": "- **Invest in Ethics**: Allocate resources toward ethical practices, recognizing that this is a long-term investment that can lead to substantial returns.",
    "id": "19a6f458-5823-43f2-b57c-e83056e58f96"
  },
  {
    "content": "Such forward-looking statements are subject to risks (including those set forth in the Company’s Annual Report on Form 10-K, filed with the Securities and Exchange Commission on March 30, 2020) and uncertainties which could cause actual results to differ from the forward-looking statements.",
    "id": "4722b998-9635-4488-b9c5-510b282d91eb"
  },
  {
    "content": "Instead, he chose to live a life of",
    "id": "8226e785-07b9-4f3d-a61b-b59f4d34c5e8"
  },
  {
    "content": "The cheesy saxophone music throughout made the film worse as well.",
    "id": "caeecc98-0a6c-43fa-a28c-7a61fc246b9b"
  },
  {
    "content": "Identified charges also include the cost of maintaining a board of directors prior to being a publicly traded company.",
    "id": "06972e64-53d3-4174-ac06-edc982848b5f"
  },
  {
    "content": "The food has been sitting out for a while and is sometimes cold when I get it.",
    "id": "b62decda-43aa-4ad1-93ea-bd81ea637b8f"
  },
  {
    "content": "Not to mention it was pretty flavorless.",
    "id": "34365085-c76b-4643-baac-87af1f738e25"
  },
  {
    "content": "In the garden there were many apples.",
    "id": "1e6512ff-4ff2-421b-92b8-ef21c1b765d7"
  },
  {
    "content": "Maybe my judgment wouldn't be so harsh if the film didn't promise so much, but I just felt like this movie cheated and played me for a fool at every turn.<br /><br />I didn't have any beef with the acting, but I thought the characters were awful.",
    "id": "432528a8-0bb6-4780-a1bc-7c8c7f4e1c06"
  },
  {
    "content": "As they got closer, their eyes lit up - it was a big, new dinosaur!",
    "id": "2d11bad1-8b94-48e4-92dd-922af732f0d3"
  },
  {
    "content": "The company is betting on Redbox's streaming offering to propel it forward […]",
    "id": "f5c285d1-8c2c-4570-a548-1cbfa536c2d0"
  },
  {
    "content": "**Organizational Values**: Core beliefs and ethical standards guiding behavior and decision-making.",
    "id": "b22e6c5b-f874-4ed3-bdd0-fe0b0c4a406a"
  },
  {
    "content": "Finally they found a solution and the harsh queen was overthrown.",
    "id": "67ffb74a-2a70-470e-947c-83148c1711ec"
  },
  {
    "content": "Organizations that actively recognize and address these dimensions are better positioned to foster innovation, improve employee satisfaction, and enhance overall performance.",
    "id": "c9ce148e-edcd-459e-ad65-44ef6f558e64"
  },
  {
    "content": "For more information, visit: www.screenmedia.net.FORWARD-LOOKING STATEMENTS  This press release includes forward-looking statements that involve risks and uncertainties.",
    "id": "ba80a98d-31e2-4710-9cd1-12b94c53210f"
  },
  {
    "content": "It was quite stressful to return the car!",
    "id": "18918b64-f5d3-4446-a418-d043c00a1fac"
  },
  {
    "content": "A number of CEF strategies can provide additional margin-of-safety without necessarily reducing income.",
    "id": "7ad5d421-f5c7-4864-a5e7-94223f4724b2"
  },
  {
    "content": "Joe was a little nervous but he guessed he'd be OK as long as he stayed close to Peter.",
    "id": "197c7f01-72ea-4ca3-8f3c-bd1fd52670f3"
  },
  {
    "content": "With one last stare at the old chest, he ran away, never wanting to come back to the attic again.",
    "id": "8fa2adb0-9e4b-4212-8236-805aa6faeed3"
  },
  {
    "content": "Avoid unless you're a King-o-Phile or are REALLY psyched up at the idea of the voice of Fat Tony from the Simpsons terrorizing a gypsy camp.",
    "id": "1ff22209-6507-4c24-b4e3-a1dd91ae1fa0"
  },
  {
    "content": "Over priced for crappy and incompetent service.",
    "id": "072d0b1b-c4b1-4b57-aa2e-0aaf9aa0fa36"
  },
  {
    "content": "**Digital Infrastructure Enhancement**\n   - Invest in an e-commerce platform capable of handling transactions, customer management, and data analysis.",
    "id": "3252bc29-593f-4332-885f-3327debec3bc"
  },
  {
    "content": "\"Oh no!",
    "id": "6763fa7e-ad81-4d79-98dd-4a99311c21b9"
  },
  {
    "content": "That night, Jack touched the lamp and said, \"I wish for something incredible!\"",
    "id": "8e195b2d-a419-4575-b621-0f5892aa0ad8"
  },
  {
    "content": "She enjoyed stirring her hot chocolate, her soup and her paint.",
    "id": "3d571080-506d-4785-8871-477ec96e58cd"
  },
  {
    "content": "The most comparable GAAP measure is operating income.",
    "id": "5ed226f8-9fe5-406e-b3f6-a2b322dd6dd2"
  },
  {
    "content": "Three writers made a valiant attempt to adapt Jane Stanton Hitchcock's novel for the tube, yet this television movie has ultimately been injected with too much melodrama and just doesn't know when to quit.",
    "id": "9ad55203-368d-4422-858c-9e6a9eb05ac6"
  },
  {
    "content": "Given the slow, plodding pace and complete lack of laughter in the first 30, I seriously doubt it.<br /><br />The lead character starts the movie in classic \"I don't know how to start my movie\" style, with a long, tiresome monologue about how he doesn't want to get sued.",
    "id": "bc6b681a-c5ed-427c-8be0-d10567daff6c"
  },
  {
    "content": "Tried to order from the drive thru at around 2 in the morning after a night out.",
    "id": "3651389c-9d1a-48e8-8aa3-a79eac926919"
  },
  {
    "content": "They didn't like it when they disagreed, but they couldn't understand each other.",
    "id": "86a7d2b1-088a-42bf-80ee-04ae445ed99f"
  },
  {
    "content": "The company has benefited from general trends such as increased online viewership, the dearth of new content, the shut down of movie",
    "id": "ac942b1c-7cc0-4d1a-8621-8763e3f0df89"
  },
  {
    "content": "Second Quarter 2020 Financial Summary  * Gross revenue of $13.9 million, compared to $12.2 million in the year-ago period.",
    "id": "82ba058e-68d2-4b82-9ad3-81cf807d4e4a"
  },
  {
    "content": "For most of the part they were good with their job and always very nice at handling her.",
    "id": "15324ee8-f931-483d-aae9-70aec819e95e"
  },
  {
    "content": "2.",
    "id": "18be0ab6-7bf7-4852-9b17-b1f4c59a60a9"
  },
  {
    "content": "One day, he wanted to explore the river further, but to get there he had to swim across the river.",
    "id": "bd4d4b07-f0a7-4557-af4b-9a457e577188"
  },
  {
    "content": "Crackle owner Chicken Soup for the Soul Entertainment, an ad-supported video-on-demand streaming company, acquired Redbox Entertainment, the operator of 38,000 DVD rental kiosks, for $375 million, comprised of $50 million in Chicken Soup stock and the assumption of $325 million in Redbox's debt.",
    "id": "39e47d6d-6737-4719-813b-95cdae4d31c8"
  },
  {
    "content": "I ordered it medium-rare and it was cooked to perfection.",
    "id": "8918b1b7-3ec7-4699-87a0-bdff5afb7eaf"
  },
  {
    "content": "For a start I didn't like the pacing of the film, starting off with mastermind Clive Owen's raison d'etre piece to camera, unnecessarily repeated at the conclusion, then finding the narrative peppered with confusing, not to say unreal-seeming witness interviews, then finding yourself jumped into scenes you sense had begun earlier.",
    "id": "17961650-5120-4e28-8e44-8a17a1d0930b"
  },
  {
    "content": "So, he followed his mom and went home.",
    "id": "f8d5b4f6-0f80-4640-b96b-f27379749c0b"
  },
  {
    "content": "To understand the difference between recruitment and selection, we first need to define each term clearly, followed by examining how they fit into the overall hiring process.",
    "id": "ee1b150f-4bd1-4747-9131-e91f04bcc4ec"
  },
  {
    "content": "This place feels like you walked into an episode of The Walking Dead.",
    "id": "063459da-47c7-40de-a8b8-272ecf38c9d6"
  },
  {
    "content": "Chicken Soup For The Soul Entertainment Inc (NASDAQ: CSSE) inked an agreement to acquire the film and television assets of Sonar Entertainment, Inc.",
    "id": "84625ca1-4836-4238-a0df-58787f141470"
  },
  {
    "content": "No, I haven't read the Stephen King novel \"Thinner,\" but I choked down the film version.",
    "id": "b7419054-43fc-487e-a071-d4d5f3f05d8d"
  },
  {
    "content": "- Share personal stories of overcoming challenges to inspire resilience in team members.",
    "id": "39c46fb1-34d2-4326-928d-c60318c0e9f0"
  },
  {
    "content": "Their insight can provide valuable perspectives on role clarity and potential pain points.",
    "id": "d06380eb-89dd-4b9a-82d7-e01a92182e4e"
  },
  {
    "content": "The silly pot was so delighted by the surprise that it opened its lid for a closer look.",
    "id": "a17f607b-cbf3-4026-8a2f-f16103a3d24b"
  },
  {
    "content": "The Company expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in the Company’s expectations with respect thereto or any change in events, conditions or circumstances on which any statement is based.",
    "id": "d964da8f-96bf-4831-803a-b5147ebc7446"
  },
  {
    "content": "Sustaining Innovation\n\nBefore diving into considerations and strategies, it's essential to define disruptive and sustaining innovations:\n\n**Disruptive Innovation:** \n- Introduces breakthrough solutions that significantly alter how markets operate.",
    "id": "118a8268-a868-42f9-b14b-8dcc1e284631"
  },
  {
    "content": "Chicken Soup for the Soul Entertainment is a subsidiary of Chicken Soup for the Soul, LLC, which publishes the famous book series and produces super-premium pet food under the Chicken Soup for the Soul brand name.FORWARD-LOOKING STATEMENTSThis press release includes forward-looking statements that involve risks and uncertainties.",
    "id": "d94d39e5-6202-4d14-88f6-d9fe4c9b4142"
  },
  {
    "content": "It also owns subscription video-on-demand (SVOD) platform Pivotshare.",
    "id": "14a3796f-2ca1-4d91-91d8-b05183a5c652"
  },
  {
    "content": "It seems to me that Stephen King's \"Bachman\" pen-name was a way for him to put out some of the grimmer, rawer, more mean-spirited stuff that he wanted to write without 'contaminating' his 'brand name'.",
    "id": "c3696f2c-832d-43e4-92bd-1ae11d544ef7"
  },
  {
    "content": "I think he's one of the funniest stand-ups around today.",
    "id": "fff69dbf-3c93-4f04-8c10-f3aa6ae12051"
  },
  {
    "content": "Everybody there is excellent.",
    "id": "18317111-c45a-43d5-ab48-fa3e1900f3e9"
  },
  {
    "content": "**Aligning Workforce with Business Strategy:** Effective workforce planning aligns the workforce with the strategic goals of the organization, ensuring that human resources contribute to the attainment of these objectives.",
    "id": "025f5367-fb19-4849-836a-fca389d103b8"
  },
  {
    "content": "I got an Impala - more car than I needed but it was that or a mini van since it was around the holidays.",
    "id": "2315ddf7-6a66-4e4a-8d09-22c454669fe8"
  },
  {
    "content": "Patricia Scanlon puts in a very funny appearance as Helen the ex-secretary, who has been driven insane by her old boss, and makes harassing phone calls from her basement, while holding a flashlight under her face.",
    "id": "a4d7d944-dbf7-439b-97b0-c6106ec218ac"
  },
  {
    "content": "Please, rockets at a truck known to be carrying plutonium?",
    "id": "b75cb34f-231c-491b-8145-e523b4fce92e"
  },
  {
    "content": "“We also continue to make it even easier for audiences to find us through our new deal with Xumo.”With the recent addition of Plex, Xfinity Flex, and FuboTV, Philo and Xumo, Crackle is available in the U.S. on over 26 devices and services including Amazon FireTV, RokuTV, Apple TV, Smart TVs (Samsung, LG, Vizio), gaming consoles (PS4 and XBoxOne), on iOS and Android mobile devices and on desktops at Crackle.com.",
    "id": "b8ed1a55-68d3-4c09-8aac-4416c32f61e0"
  },
  {
    "content": "There is no plot, no storyline, no interesting or noteworthy events, no emotion, no meaningful dialogue, and most importantly \u0096 no drama.<br /><br />The most eventful scene has two people \"banging\" on a bed with a person masturbating underneath the mattress \u0096 ironic that it's also totally tasteless and gratuitous.",
    "id": "3975cd14-b53e-4eff-ab66-f9257a778b39"
  },
  {
    "content": "### 6.",
    "id": "c91d7e58-9d5e-4acc-a7ae-94db2981a77c"
  },
  {
    "content": "Everything is muffled, dull, airless, and no fun to watch...with the vivid exception of the spectacle of the main character getting....thinner, and thinner, and thinner.",
    "id": "d1f4780b-78c0-4ceb-ab82-b4998f35dafb"
  },
  {
    "content": "I have had an incident one time where she messed up my order and then got cocky with me.",
    "id": "04b7af36-6d47-4993-a5dc-ba71372a4d87"
  },
  {
    "content": "She looked around the bus, seemingly ignorant of the people who surrounded her.",
    "id": "89b4a192-8395-45ad-8849-beefa95b46c0"
  },
  {
    "content": "Only saving grace in this film is Tembi Locke who doesn't have a chance to show her talents with the awful acting of Jenkins, Hyser, Hiltz and DeLuise around her.",
    "id": "c80698b0-0a5e-4851-9333-fee3233ee27a"
  },
  {
    "content": "Every day he would go outside and play in the icy snow.",
    "id": "ab316ffe-51aa-4a51-8365-34ab13c735e2"
  },
  {
    "content": "Shares of movie-rental business Redbox Entertainment Inc. were falling Wednesday after the company reached an agreement to be acquired by Chicken Soup for the Soul Entertainment Inc. in an all-stock deal that implies a Redbox valuation below $1 a share.",
    "id": "ce072d0b-5882-40c6-863e-493bb0816eec"
  },
  {
    "content": "**Scouting for Trends**\n   - Develop capabilities in trend scouting to identify emerging technologies, market changes, and evolving consumer behaviors that may signal opportunities for disruptive innovations.",
    "id": "0fc79d88-fc7a-4b48-a699-15f5294298fd"
  },
  {
    "content": "Reserved a van a week in advance; on the day of pickup, they were being SOOOOO DIFFICULT.",
    "id": "50d49379-d7de-4193-8793-f83a1ffeeec3"
  },
  {
    "content": "While this fund has been a reasonable performer over the past few months, I believe getting a bit more cautious now makes sense.",
    "id": "11e92c4a-8a9f-4fdc-91b1-4f2f042502a5"
  },
  {
    "content": "This involves:\n\n- **Segmentation** - Breaking down the audience into distinct groups based on criteria such as age, gender, income, interests, etc.",
    "id": "951b122f-3c4f-4d91-9336-78ecfe4bd9ec"
  },
  {
    "content": "Ok it was funny the first and maybe even the second time.",
    "id": "bfeaa8e7-cb17-49c5-b65c-1b0a7dde0368"
  },
  {
    "content": "Align Objectives with Orientation\n- **Set Clear Goals**: Based on your orientation, create objectives.",
    "id": "3e1d36b3-7bbb-4fb1-b4e7-546b621c8c47"
  },
  {
    "content": "It giggled with joy!",
    "id": "28a40f9a-729b-4b13-8cb7-9a90f8f7a772"
  },
  {
    "content": "Many of the topics he covers he has covered before - I even think I recognised a few recycled jokes in there.<br /><br />If you buy the DVD you'll find a behind-the-scenes look at Eddie's tour (interesting in places, but not very funny), and a French language version of one of his shows.",
    "id": "b0aeacc4-d2a1-493b-ad6f-648387dc56fb"
  },
  {
    "content": "- **Encourage Feedback**: Create channels for providing feedback and addressing concerns openly without fear of repercussions.",
    "id": "a98d74ca-f38c-4435-85bb-d6bc11874953"
  },
  {
    "content": "He eagerly took a bite.",
    "id": "6536c073-b94c-45ef-8c1e-54ea54c00748"
  },
  {
    "content": "I try to avoid other locations as this one is like home.",
    "id": "acc49fea-2a8d-41fb-84db-d5d5d81ba62b"
  },
  {
    "content": "The smart money sentiment can provide an answer to this question.",
    "id": "701d0453-03cb-4e41-95fa-145cbaea21df"
  },
  {
    "content": "Though not necessarily convenient, no big deal.",
    "id": "fd478d3e-e60f-428d-a0d1-4b055c13f9f0"
  },
  {
    "content": "The filet was the best one I've ever had.",
    "id": "c768eb27-cb6c-4d7c-b01e-3438ccfed2f3"
  },
  {
    "content": "Without this non-cash film library amortization expense, the gross profit would have been $7.0 million or 51% of total net revenue.Operating loss for the quarter ended June 30, 2020 was $13.1 million, compared to an operating loss of $3.0 million for the year-ago period.",
    "id": "3dbafaf1-991b-4c6b-b8a8-604d7dc54969"
  },
  {
    "content": "He saw that the bag had snacks, toys, and even a new knife!",
    "id": "6406ca94-0dca-417a-bc8d-a6c19c17f02b"
  },
  {
    "content": "Sell!",
    "id": "ca5fffa1-575b-4ed3-ac31-eb8b7ccd99ef"
  },
  {
    "content": "It encompasses an openness to different cultures, a commitment to understanding global issues, and a capacity for thinking beyond one’s local context.",
    "id": "1c83a904-6aea-4906-ae61-4432735bb26d"
  },
  {
    "content": "<br /><br />The funny thing is, I am pretty discriminating when it comes to movies I like or even 'love'.",
    "id": "bce39ea3-1785-404c-af99-9ce29ba595ec"
  },
  {
    "content": "Once upon a time there was a little boy.",
    "id": "4f7819ed-b04b-4526-9912-afe981bb4c9e"
  },
  {
    "content": "CSSE stock moved up this morning while traders digested this development.",
    "id": "c053542b-9fad-4138-a751-bac8b7d0fedf"
  },
  {
    "content": "This store is efficient and friendly.",
    "id": "2193e285-2fed-482d-9537-36bb0c5e3020"
  },
  {
    "content": "In the same quarter last year, Chicken Soup for the Soul posted EPS of $-0.19 on sales of $11.97 million.",
    "id": "9d3f0fbb-0442-48fb-8320-9df839603550"
  },
  {
    "content": "She smiled with accomplishment and hugged her mommy.",
    "id": "165c9120-331f-4844-927b-024e0ef82aa9"
  },
  {
    "content": "A short squeeze can occur when a heavily shorted stock rises in value instead of falling.",
    "id": "07a55022-e0b0-4030-98e5-c1aa8a0c5bd8"
  },
  {
    "content": "Forward-looking statements are statements that are not historical facts.",
    "id": "1d8c40bb-ac05-4f8e-a68d-16fd8f2401bf"
  },
  {
    "content": "Gather insights into whether teams feel adequately supported and sufficiently resourced to achieve their goals.",
    "id": "3550ded7-dfdb-4e86-9b4a-b24018446bdc"
  },
  {
    "content": "I ordered the Dave's double with cheese add mustard hold the mayonnaise and onion keep the lettuce tomato and pickle on it.",
    "id": "6d824290-fa83-482d-89b6-5bd75a70b436"
  },
  {
    "content": "7.",
    "id": "691bafb7-8540-48e4-b364-dbe249d7e60e"
  },
  {
    "content": "i observed today in dunkin' donuts.",
    "id": "6d0f436b-36d7-42cc-a714-f6b88c450897"
  },
  {
    "content": "**Action Planning**:\n   - Develop detailed action plans for both strategies, specifying tasks to be added (enlargement) versus added responsibilities (enrichment).",
    "id": "2c6cac31-82df-435b-8197-a214ec3c3d0a"
  },
  {
    "content": "She jumped until she was tired.",
    "id": "a9683e18-06e5-43f9-b820-25188e8733c3"
  },
  {
    "content": "One day, they decided to play with pastels.",
    "id": "dc8d171f-b7e6-427e-953e-c03bf508cfe5"
  }
]